// Sociology12thQuiz.jsx
import React, { useState, useEffect, useRef } from "react";

// --- 12th Sociology Question Bank (100 questions) - Hindi & English ---

// Hindi Questions
const sociologyHindi = [
  {
    question: "निम्न में से किसने ‘सोशियोलॉजी’ शब्दावली का सृजन किया ?",
    option: ["स्पेंसर", "अगस्त कॉम्ट", "दुखीम", "कार्ल मार्क्स"],
    answer: "अगस्त कॉम्ट"
},
{
    question: "समाजशास्त्र को ‘सामाजिक स्थैतिक’ एवं सामाजिक गतिक’ में किसने विभाजित किया ?",
    option: ["मेकाईवर एवं पेज", "जॉनसन", "अगस्त कॉम्ट", "दुखीम"],
    answer: "दुखीम"
},
{
    question: "मनुस्मृति के रचनाकार कौन हैं ?",
    option: ["तुलसीदास", "वेदव्यास", "चाणक्य", "मनु"],
    answer: "मनु"
},
{
    question: "समाजशास्त्र का जन्म किस वर्ष हुआ ?",
    option: ["1838", "1836", "1898", "1810"],
    answer: "1838"
},
{
    question: "किस समाजशास्त्री के समुदाय की – परिभाषा में’हम भावना’ का स्पष्ट उल्लेख किया गया है ?",
    option: ["बोगार्डस की", "गिंसबर्ग की", "मैकाइवर", "किंग्सले डेविस की"],
    answer: "बोगार्डस की"
},
{
    question: "निम्नलिखित में कौन समुदाय का उदाहरण है ?",
    option: ["क्रिकेट टीम", "राज्य", "कॉलेज का छात्रावास", "संघ लोक सेवा आयोग"],
    answer: "राज्य"
},
{
    question: "“भारत में भिन्नता में एकता निहित है, परन्तु मौलिक एकता उतनी स्पष्ट नहीं है, जितनी बाह्य भिन्नता।” ऐसा किसने कहा है ?",
    option: ["फिक्टर ने", "स्मिथ ने", "ग्रीन ने", "टॉयलर"],
    answer: "स्मिथ ने"
},
{
    question: "राष्ट्रीय एकीकरण के लिए सबसे अधिक आवश्यक क्या है ?",
    option: ["आर्थिक उन्नति", "धार्मिक स्वतंत्रता", "धार्मिक सहिष्णुता", "शिक्षा का प्रसार"],
    answer: "धार्मिक सहिष्णुता"
},
{
    question: "राष्ट्रीयता का तात्पर्य क्या है ?",
    option: ["सामान्य सामाजिक पृष्ठभूमि", "सामान्य जातिगत पृष्ठभूमि", "सामान्य भौगोलिक पृष्ठभूमि", "उपर्युक्त कोई सही नहीं"],
    answer: "सामान्य भौगोलिक पृष्ठभूमि"
},
{
    question: "भारत छोड़ो आंदोलन का आरंभ कब से हुआ ?",
    option: ["9 अगस्त, 1917 से", "9 अगस्त, 1939 से", "9 अगस्त, 1942 से", "9 अगस्त 1947 से"],
    answer: "9 अगस्त, 1942 से"
},
{
    question: "‘पुनर्जन्म’ की अवधारणा किस धर्म से संबंधित है ?",
    option: ["हिन्दू", "इस्लाम", "ईसाई", "इनमें से सभी"],
    answer: "हिन्दू"
},
{
    question: "राष्ट्रीय समन्वय के मार्ग में कौन-सा तत्व बाधक नहीं है ?",
    option: ["जातीय भावना", "धार्मिक भावना", "अल्पसंख्यक की सुरक्षा", "आर्थिक विषमता"],
    answer: "अल्पसंख्यक की सुरक्षा"
},
{
    question: "“प्रजनन क्षमता में कमी होने के पहले नैतिकता के स्तर में ह्रास होना जरूरी है।” यह विचाकिसने व्यक्त की है ?",
    option: ["डब्लयू० नोटेस्टेन", "माल्थस", "थामसन", "के० डेविस"],
    answer: "डब्लयू० नोटेस्टेन"
},
{
    question: "उग्र राष्ट्रवादियों का काल कब कहा जाता है ?",
    option: ["1905 से 1918", "1885 से 1905", "1919 से 1947", "इनमें कोई नहीं"],
    answer: "1905 से 1918"
},
{
    question: "निम्नलिखित में किस विद्वान ने भारतीय गाँव को एक जीवन विधि माना है ?",
    option: ["मजूमदार", "श्रीनिवास", "मैकिम मैरियट", "बेली"],
    answer: "मजूमदार"
},
{
    question: "संस्था शब्द का उपयोग सर्वप्रथम किस विद्वान ने किया था ?",
    option: ["दुर्थीम", "स्पेन्सर", "काम्ट", "एम० एन० श्रीनिवास"],
    answer: "स्पेन्सर"
},
{
    question: "स्पेन्सर की पुस्तक ‘First Principles’ में सर्वप्रथम किस शब्द का उपयोग किया गया ?",
    option: ["संस्था", "समिति", "प्राथमिक समूह", "जाति"],
    answer: "संस्था"
},
{
    question: "किस विद्वान ने समुदाय की परिभाषा में हम की भावना’ का स्पष्ट उल्लेख किया है ?",
    option: ["बोगार्डस ने", "गिंसबर्ग ने", "मैकाइवर ने", "किंग्सले डेविस ने"],
    answer: "बोगार्डस ने"
},
{
    question: "निम्नलिखित में से किस समाज में महिलाओं की प्रस्थिति अपेक्षाकृत बेहतर है ?",
    option: ["औद्योगिक समाज", "आदिवासी समाज", "कृषि समाज", "उपर्युक्त सभी में"],
    answer: "औद्योगिक समाज"
},
{
    question: "जब मृत्यु दर बढ़ती है और जन्म दर में गिरावट आती है तो उसके फलस्वरूप –",
    option: ["जनसंख्या में वृद्धि होती है", "जनसंख्या में गिरावट आती है", "जनसंख्या स्थिर रहती है", "जनसंख्या में गतिशीलता आती है"],
    answer: "जनसंख्या में गिरावट आती है"
},
{
    question: "वह आंदोलन जिसको माल्थस के अनुयायियों ने संतति निग्रह एवं अन्य उपायों द्वारा जनसंख्या कम करने के लिए चलाया, कहलाता है—",
    option: ["नव-माल्थसवाद", "माल्थसवाद", "मार्क्सवाद", "नव-मार्क्सवाद"],
    answer: "नव-माल्थसवाद"
},
{
    question: "निम्नलिखित में किसने विचलन को समाज के लिए प्रकार्यात्मक माना है ?",
    option: ["ए० कोहन", "ई० दुर्खाइम", "आर० के० मर्टन", "एल० के० व्वाइट"],
    answer: "ई० दुर्खाइम"
},
{
    question: "इनमें कौन समुदाय का उदाहरण है ?",
    option: ["विद्यालय", "गाँव", "धर्म", "जाति"],
    answer: "जाति"
},
{
    question: "समुदाय में हम की भावना विकसित होती है –",
    option: ["आर्थिक समानता से", "राजनीतिक आधारों से", "सदस्यों की संख्या से", "इनमें से किसी से नहीं"],
    answer: "इनमें से किसी से नहीं"
},
{
    question: "” गाँव एक लघु गणराज्य हैं” । किसने कहा ?",
    option: ["मेटकॉफ", "ए० आर० देसाई", "कार्ल मार्क्स", "महात्मा गाँधी"],
    answer: "मेटकॉफ"
},
{
    question: "भारत में ईस्ट इंडिया कंपनी का शासन कब ब्रिटिश शासन के रूप में परिवर्तित हुआ ?",
    option: ["सन् 1839", "सन् 1858", "सन् 1862", "सन् 1885"],
    answer: "सन् 1858"
},
{
    question: "भारत में राष्ट्रीय जनसंख्या आयोग के अध्यक्ष कौन हैं ?",
    option: ["राष्ट्रपति", "प्रधानमंत्री", "स्वास्थ्य मंत्री", "गृहमंत्री"],
    answer: "प्रधानमंत्री"
},
{
    question: "भारत के लोग मुख्य रूप से आश्रित हैं—",
    option: ["नौकरी पर", "कृषि पर", "व्यवसाय पर", "उद्योग पर"],
    answer: "कृषि पर"
},
{
    question: "निम्न में से ग्रामीण समुदाय की प्रमुख विशेषता कौन हैं ?",
    option: ["सामाजिक गतिशीलता", "बड़ा आकार", "स्त्रियों की उच्च प्रस्थिति", "कृषि पर आधारित"],
    answer: "कृषि पर आधारित"
},
{
    question: "भारत में जनाधिक्य का मूल कारण क्या है ?",
    option: ["पर्यावरण", "प्रजनन शक्ति", "सामाजिक-सांस्कृतिक कारक", "इनमें से कोई नहीं"],
    answer: "सामाजिक-सांस्कृतिक कारक"
},
{
    question: "भारतीय ग्रामीण समुदाय की विशेषताएँ है –",
    option: ["सामान्य निश्चित क्षेत्र", "सामुदायिक एकता", "प्राथमिक संबंधों की प्रधानता", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "पार्सन्स द्वारा कितने प्रकार के प्रतिमानित विकल्पों का वर्णन किया गया है ?",
    option: ["तीन", "चार", "पाँच", "छः"],
    answer: "तीन"
},
{
    question: "नैसर्गिक प्रतिबन्ध किसकी अवधारणा है ?",
    option: ["माल्थस", "सैडलर", "कैनन", "डाल्टन"],
    answer: "माल्थस"
},
{
    question: "कब राष्ट्रीय कांग्रेस का अधिवेशन में मूल अधिकार की घोषणा की गई ?",
    option: ["1930", "1931", "1932", "1933"],
    answer: "1931"
},
{
    question: "नैसर्गिक प्रतिबंध किसकी अवधारणा है ?",
    option: ["माल्थस", "सैडलर", "कैनन", "डाल्टन"],
    answer: "माल्थस"
},
{
    question: "2001 ई० की जनगणना के अनुसार भारत में सर्वाधिक लिंगानुपात वाला राज्य कौन-सा था ?",
    option: ["सिक्किम", "मध्यप्रदेश", "केरल", "बिहार"],
    answer: "केरल"
},
{
    question: "2001 ई० की जनगणना के अनुसार भारत के न्यूनतम लिंगानुपात वाला राज्य कौन-सा था ?",
    option: ["हरियाणा", "मध्यप्रदेश", "केरल", "बिहार"],
    answer: "हरियाणा"
},
{
    question: "शिशु मृत्यु दर में कितने वर्ष के बच्चों की गणना की जाती है ?",
    option: ["दो वर्ष", "एक वर्ष", "चार वर्ष", "पाँच वर्ष"],
    answer: "एक वर्ष"
},
{
    question: "राष्ट्रीय जनसंख्या नीति-2000 के अंतर्गत निम्न में से किन बातों को शामिल किया गया है ?",
    option: ["तत्कालिक उद्देश्य", "मध्यकालीन उद्देश्य", "दीर्घकालिक उद्देश्य", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "माल्थस के अनुसार बढ़ती हुई जनसंख्या को नियंत्रित करने के निम्नलिखित में से कौन-से उपाय उपयुक्त हैं ?",
    option: ["नैसर्गिक प्रतिबंध", "निरोधक प्रतिबंध", "दोनों", "उपर्युक्त में कोई नहीं"],
    answer: "निरोधक प्रतिबंध"
},
{
    question: "भारत के किस विश्वविद्यालय से समाजशास्त्र की पढ़ाई शुरू हुयी थी ?",
    option: ["बम्बई विश्वविद्यालय", "कलकत्ता विश्वविद्यालय", "पटना विश्वविद्यालय", "दिल्ली विश्वविद्यालय"],
    answer: "बम्बई विश्वविद्यालय"
},
{
    question: "समाजशास्त्र की उत्पत्ति किन भाषाओं से हुई है ?",
    option: ["लैटिन एवं फ्रेंच", "लैटिन एवं ग्रीक", "लैटिन एवं अंग्रेजी", "ग्रीक एवं अंग्रेजी"],
    answer: "लैटिन एवं ग्रीक"
},
{
    question: "निम्नलिखित में से किसको नगरीकरण बढ़ावा देती है ?",
    option: ["गुमनामिता", "भीड़", "प्रदूषण", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्न में से कौन भारत का सबसे अधिक नगरीयकृत राज्य है ?",
    option: ["पश्चिम बंगाल", "महाराष्ट्र", "आध्र प्रदेश", "केरल"],
    answer: "महाराष्ट्र"
},
{
    question: "शहरीकरण का लक्षण है –",
    option: ["व्यापार में विकास", "एक शहर के चारों ओर केंद्रों का विकास", "ग्रामीण से शहरी प्रवसन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "धर्म निरपेक्षता का अर्थ क्या है ?",
    option: ["विभिन्न धर्मों का सह अस्तित्व", "अन्य धर्मो के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना है", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "2001 की जनगणना के अनुसार भारत में प्रति 1000 पुरुष पर स्त्रियों की संख्या है –",
    option: ["967", "933", "947", "955"],
    answer: "933"
},
{
    question: "1931 में भारतीय राष्ट्रीय कांग्रेस का अधिवेशन किस स्थान पर हुआ था ?",
    option: ["कराची", "लाहौर", "दिल्ली", "कलकत्ता"],
    answer: "कराची"
},
{
    question: "सामुदायिक पहचान क्या होती है ?",
    option: ["अर्जित", "प्रदत्त", "अर्जित व प्रदत्त दोनों", "इनमें से कोई नहीं"],
    answer: "प्रदत्त"
},
{
    question: "निम्न में से किसने ‘ग्रामीण-नगरीय सातव्य’ की अवधारणा के विकास में योगदान दिया ?",
    option: ["एस० सी० दूबे०", "सोरोकिन", "रेडफील्ड", "कॉम्ट"],
    answer: "रेडफील्ड"
},
{
    question: "भारत में परिवार नियोजन कार्यक्रम कब लागू किया गया ?",
    option: ["1948", "1950", "1952", "1954"],
    answer: "1952"
},
{
    question: "स्त्रियों का सबसे अधिक प्रतिशत किस राज्य में है ?",
    option: ["बिहार", "पश्चिम बंगाल", "उत्तर प्रदेश", "केरल"],
    answer: "केरल"
},
{
    question: "मानव समाज एवं संस्कृति का इतिहास कहाँ से शुरू होता है ?",
    option: ["गाँव से", "शहर से", "नगर से", "इनमें से कोई नहीं"],
    answer: "गाँव से"
},
{
    question: "भारतीय समाज का इतिहास कितने वर्षों की अवधि का है ?",
    option: ["2000 वर्ष", "3000 वर्ष", "4000 वर्ष", "5000 वर्ष"],
    answer: "4000 वर्ष"
},
{
    question: "इनमें से कौन-सी विशेषता गाँव की नहीं है ?",
    option: ["कृषि व्यवसाय", "एकाकी परिवार", "सजातीयता", "रूढ़िवादिता"],
    answer: "रूढ़िवादिता"
},
{
    question: "इनमें से जनसंख्या वृद्धि का परिणाम कौन नहीं है ?",
    option: ["खाद्य समस्या", "आवास की समस्या", "रोजगार की समस्या", "ठंडे मौसम में सर्दी लगना"],
    answer: "ठंडे मौसम में सर्दी लगना"
},
{
    question: "उपनिवेशवाद किस सोच का प्रतिफल है ?",
    option: ["साम्राज्यवाद", "समाजवाद", "मानवतावाद", "अंतरराष्ट्रीयतावाद"],
    answer: "साम्राज्यवाद"
},
{
    question: "भारत में ब्रिटिश उपनिवेशवाद की स्थापना तथा इसके विस्तार में कौन सहायक था ?",
    option: ["लॉर्ड कार्नवालिस", "लॉर्ड क्लाइव", "वारेन हेस्टिग्ज", "उपर्युक्त सी"],
    answer: "उपर्युक्त सी"
},
{
    question: "डेमोग्राफी (जनांकिकी) शब्द का प्रयोग सबसे पहले किस विद्वान द्वारा गया था ?",
    option: ["गुईलार्ड", "सोरोकिन", "लेविस", "वार्कले"],
    answer: "गुईलार्ड"
},
{
    question: "‘ग्रामीण क्षेत्रों का नगरीय क्षेत्रों में परिवर्तित होने की प्रक्रिया को नगरीकरण कहते हैं’, यह किसका कथन है ?",
    option: ["फेयर चाइल्ड", "एम० एस० ए० राव", "एम० एन० श्रीनिवास", "इ० एफ० बर्गेस"],
    answer: "इ० एफ० बर्गेस"
},
{
    question: "नई राष्ट्रीय जनसंख्या नीति कब घोषित की गयी ?",
    option: ["1999", "2000", "2001", "2002"],
    answer: "2000"
},
{
    question: "समुदाय का सर्वमहत्त्वपूर्ण लक्षण निम्नलिखित में क्या है ?",
    option: ["हम भावना", "समान भू-भाग", "सामुदायिक भावना", "समान नियम"],
    answer: "सामुदायिक भावना"
},
{
    question: "जनसंख्या सूची स्तंभ किससे जुड़ा है ?",
    option: ["आयु और विवाह संरचना", "आयु और लिंग संरचना", "आयु और श्रम बल संरचना", "आयु और साक्षरता संरचना"],
    answer: "आयु और लिंग संरचना"
},
{
    question: "जनसंख्या से संबंधित सूचना प्राप्त करने की प्राथमिक विधि क्या है ?",
    option: ["सेन्सस", "सर्वे विधि", "सेम्पल विधि", "इनमें कोई नहीं"],
    answer: "सेन्सस"
},
{
    question: "भारत में जनसंख्या में वृद्धि और घनत्व प्रत्यक्ष रूप से निर्धारित होता है—",
    option: ["क्षेत्र की महिलाओं की संख्या द्वारा", "प्रजनन दर तथा मृत्यु दर द्वारा", "देश के विभिन्न भागों में प्रव्रजनवैमिन्य के द्वारा", "पुरुषों पर भारतीय महिलाओं की बौद्धिक श्रेष्ठता द्वारा"],
    answer: "प्रजनन दर तथा मृत्यु दर द्वारा"
},
{
    question: "जनांकिकी विज्ञान है –",
    option: ["पर्यावरण अध्ययन का", "जनसंख्या अध्ययन का", "वन अध्ययन का", "जल अध्ययन का"],
    answer: "जनसंख्या अध्ययन का"
},
{
    question: "इनमें कौन नगरीय समुदाय की विशेषता है ?",
    option: ["अधिक जनसंख्या", "सामाजिक विभिन्नता", "स्थानीय पृथककरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "जनांकिकी शब्द का प्रयोग सबसे पहले कब किया गया ?",
    option: ["सन् 1855", "सन् 1856", "सन् 1857", "सन् 1860"],
    answer: "सन् 1855"
},
{
    question: "उदारीकरण, भूमंडलीकरण का किस प्रकार का तत्त्व है ?",
    option: ["सामाजिक", "आर्थिक", "राजनैतिक", "सांस्कृतिक"],
    answer: "आर्थिक"
},
{
    question: "भारत में अनियंत्रित जनसंख्या वृद्धि के लिए उत्तरदायी कारक है –",
    option: ["बाल-विवाह", "राजनीतिक चेतना", "आर्थिक विकास", "इनमें से कोई नहीं"],
    answer: "बाल-विवाह"
},
{
    question: "भारतीय जनसंख्या के इतिहास में कौन-सा वर्ष ‘ग्रेट डिवाइड’ माना जाता है ?",
    option: ["1901", "1921", "1951", "1961"],
    answer: "1921"
},
{
    question: "निम्नलिखित में कौन यह विश्वास करता है कि जनसंख्या वृद्धि होती है ?",
    option: ["ए० ड्युमो", "फ्रेंक फेटर", "एफ० एस० नीटो", "यू० स्ट्रेनबर्ग"],
    answer: "एफ० एस० नीटो"
},
{
    question: "विवेकपूर्ण जनसंख्या नीति के आवश्यक तत्त्व क्या है ?",
    option: ["परिवार नियोजन कार्यक्रम का प्रचार और प्रसार", "सामाजिक वातावरण में परिवर्तन", "प्रवासी-प्रवृति को प्रोत्साहन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "राष्ट्रवाद का अर्थ है",
    option: ["सामान्य सामाजिक पृष्ठभूमि", "सामान्य जाति पृष्ठभूमि", "सामान्य भौगोलिक पृष्ठभूमि", "इनमें से कोई नहीं"],
    answer: "सामान्य भौगोलिक पृष्ठभूमि"
},
{
    question: "निम्नलिखित में से कौन भारतीय समाज की विशेषता है ?",
    option: ["अनेकता में एकता", "संस्कारों द्वारा समाजीकरण", "पुरुषार्थ", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "‘सोसाइटी’ नामक पुस्तक का रचयिता कौन है ?",
    option: ["मेकाइवर एण्ड पेज", "पी० जीस्वर्ट", "एच० एम० जॉनसन", "इनमें से कोई नहीं"],
    answer: "मेकाइवर एण्ड पेज"
},
{
    question: "उदारीकरण से क्या अर्थ निकलता है ?",
    option: ["समाजवाद", "मनुष्य का उदार होना", "काफी उन्नति होना", "मुक्त बाजार व्यवस्था"],
    answer: "मुक्त बाजार व्यवस्था"
},
{
    question: "सन् 2001 की जनगणना के अनुसार भारत की ग्रामीण जनसंख्या है लगभग –",
    option: ["56 प्रतिशत", "65 प्रतिशत", "72 प्रतिशत", "80 प्रतिशत"],
    answer: "72 प्रतिशत"
},
{
    question: "भारतीय राष्ट्रीय कांग्रेस की स्थापना कब हुई ?",
    option: ["दिसम्बर, 1885 में", "दिसम्बर, 1857 में", "दिसम्बर, 1947 में", "दिसम्बर, 1917 में"],
    answer: "दिसम्बर, 1885 में"
},
{
    question: "”The Population of India & Pakistan” नामक पुस्तक के लेखक कौन हैं ?",
    option: ["डेविस", "मर्टन", "मिर्डल", "माल्थस"],
    answer: "डेविस"
},
{
    question: "चम्पारण में नील आंदोलन’ कब आरम्भ हुआ ?",
    option: ["1917 ई०", "1918 ई०", "1919 ई०", "इनमें से कोई नहीं"],
    answer: "1917 ई०"
},
{
    question: "स्त्री-पुरुष अनुपात किस राज्य में सबसे कम है ?",
    option: ["बिहार", "पश्चिम बंगाल", "उड़ीसा", "तमिलनाडु"],
    answer: "बिहार"
},
{
    question: "निम्न में से कौन राष्ट्रीय एकीकरण में बाधक है ?",
    option: ["धर्मनिरपेक्षता", "सांप्रदायिकता", "दोनों", "उपर्युक्त में से कोई नहीं"],
    answer: "सांप्रदायिकता"
},
{
    question: "बिहार में समाजशास्त्र की पढ़ाई सर्वप्रथम किस विश्वविद्यालय में शुरू हुई थी ?",
    option: ["पटना विश्वविद्यालय", "मुंगेर विश्वविद्यालय", "पाटलिपुत्र विश्वविद्यालय", "भागलपुर विश्वविद्यालय"],
    answer: "पटना विश्वविद्यालय"
},
{
    question: "अगस्त कॉम्ट के गुरू कौन थे ?",
    option: ["मेकाईवर", "अरस्तू", "सेंट साइमन", "मार्क्स"],
    answer: "सेंट साइमन"
},
{
    question: "किसने कहा, “समाजशास्त्र समाज का विज्ञान है” ?",
    option: ["वार्ड", "मेकाईवर", "गिडिग्स", "स्पेंसर"],
    answer: "वार्ड"
},
{
    question: "“पॉजिटिव फिलास्फी” नामक पुस्तक के रचयिता कौन थे ?",
    option: ["कॉम्ट", "सोरोकिन", "मार्क्स", "हीगले"],
    answer: "कॉम्ट"
},
{
    question: "बम्बई विश्वविद्यालय में समाजशास्त्र विभाग की स्थापना किनकी अध्यक्षता में हुई ?",
    option: ["जी०एस०घुर्ये", "पैट्रिक गिड्स", "आर०के०मुखर्जी", "डी०एन०मुखर्जी"],
    answer: "पैट्रिक गिड्स"
},
{
    question: "इनमें से कौन भारतीय संस्कृति का मूल तत्व है ?",
    option: ["आध्यात्मवाद", "कर्म संबंधी विश्वास", "सामूहिकता", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "निम्न में से कौन समाज की विशेषता नहीं है ?",
    option: ["समाज मूर्त है", "परिवर्तनशीलता", "पारस्परिक निर्भरता", "पारस्परिक जागरूकता"],
    answer: "समाज मूर्त है"
},
{
    question: "किसने कहा, “समाज संघर्ष मिश्रित सहयोग है” ?",
    option: ["बोगार्डस", "मैकाईवर", "अगस्त कॉम्ट", "जॉर्ज सिमेल"],
    answer: "मैकाईवर"
},
{
    question: "किसने कहा, “प्रत्येक व्यक्ति यह जानता है कि नगर क्या है, किन्तु किसी ने भी संतोषजनक परिभाषा नहीं दी है” ?",
    option: ["बर्गेल", "एण्डरसन", "बिल कॉक्स", "मेकाईवर"],
    answer: "बर्गेल"
},
{
    question: "किस प्रमुख ऐतिहासिक घटना से भारत में राष्ट्रवाद की भावना का उदय हुआ ?",
    option: ["1857 का सिपाही विद्रोह", "भारत छोड़ो आन्दोलन", "असहयोग आन्दोलन", "सविनय अवज्ञा आन्दोलन"],
    answer: "1857 का सिपाही विद्रोह"
},
{
    question: "‘वानप्रस्थ आश्रम’ आश्रम व्यवस्था का कौन सा स्तर है ?",
    option: ["प्रथम", "द्वितीय", "तृतीय", "चतुर्थ"],
    answer: "तृतीय"
},
{
    question: "बंगाल में स्वदेशी आन्दोलन किसने आरम्भ किया ?",
    option: ["राजनारायण बसु", "रामसिंह कूका", "वासुदेव जोशी", "महात्मा गाँधी"],
    answer: "राजनारायण बसु"
},
{
    question: "भारत की वर्तमान आबादी कितनी है ?",
    option: ["एक अरब के ऊपर", "एक अरब से नीचे", "100 लाख", "इनमें से कोई नहीं"],
    answer: "एक अरब के ऊपर"
},
{
    question: "निम्न में से भारत के किस राज्य में साक्षरता दर सबसे कम है ?",
    option: ["उत्तर प्रदेश", "झारखण्ड", "मध्य प्रदेश", "बिहार"],
    answer: "बिहार"
},
{
    question: "भारत में जनाधिक्य का मूल कारण क्या है ?",
    option: ["पर्यावरण", "सामाजिक – सांस्कृतिक कारक", "प्रजनन शक्ति", "इनमें से कोई नहीं"],
    answer: "प्रजनन शक्ति"
},
{
    question: "नई राष्ट्रीय जनसंख्या नीति कब घोषित की गयी ?",
    option: ["1999 ई. में", "2000 ई. में", "2001 ई. में", "2002 ई. में"],
    answer: "2000 ई. में"
},
{
    question: "भारत में प्रथम बार जनगणना कब हुआ था ?",
    option: ["1873", "1872", "1856", "1874"],
    answer: "1872"
},
{
    question: "अल्पसंख्यक एक",
    option: ["सामजशास्त्रीय संकल्पना है", "गणितीय संकल्पना है", "राजनैतिक संकल्पना है", "मनोवैज्ञानिक संकल्पना है"],
    answer: "राजनैतिक संकल्पना है"
},
{
    question: "लैंगिक विषमता का सम्बन्ध है",
    option: ["सामाजिक मूल्यों से", "आर्थिकी से", "राजनैतिक मूल्यों से", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "किसने लैंगिक असमानता के सात प्रकार का उल्लेख किया है ?",
    option: ["पाणिकर", "मजूमदार", "दूबे", "आमर्त्यसेन"],
    answer: "आमर्त्यसेन"
},
{
    question: "ग्रामीण एवं नगरीय समाज के बीच निम्नलिखित में कौन अंतर का आधार है ?",
    option: ["जनसंख्यात्मक आधार", "समुदाय का आकार", "सामाजिक गतिशीलता की प्रकृति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "टी.के. उम्मन ने संप्रदायवाद के कितने आयामों को रेखांकित किया है ?",
    option: ["दो आयामों को", "चार आयामों को", "छः आयामों को", "आठ आयामों को"],
    answer: "दो आयामों को"
},
{
    question: "रेडिकल नारीवाद के अनुसार लैंगिक असमानता का मूल कारण क्या है ?",
    option: ["पितृसत्ता है", "मातृसत्ता है ।", "दोनों में कोई भी नहीं", "नहीं कह सकते"],
    answer: "पितृसत्ता है"
},
{
    question: "सामाजिक वर्ग एक समुदाय का कोई भाग है जो सामाजिक स्थिति के आधार पर शेष भाग से पृथक किया जा सके । यह कथन किसका है ?",
    option: ["ऑगबर्न तथा निमकॉफ", "मैकाइवर एवं पेज", "बोगार्डस", "गॉन एच टैण्डल"],
    answer: "मैकाइवर एवं पेज"
},
{
    question: "राष्ट्र से अभिप्राय एक जाति अथवा वंशगत विशेषताओं वाला मानव संगठन है । यह कथन किसका है ?",
    option: ["बर्गेस", "मैकाइवर एवं पेज", "लीकॉक", "बोगार्डस"],
    answer: "बर्गेस"
},
{
    question: "भारतीय समाज का विभाजन का आधारों पर हुआ है, यह विभाजन ही कहलाता",
    option: ["समुदाय", "उपनिवेशवाद", "राष्ट्रवाद", "वर्ग"],
    answer: "समुदाय"
},
{
    question: "आर्थिक आधार पर समाज कितने वर्गों में विभक्त है ?",
    option: ["चार", "पाँच", "तीन", "दो"],
    answer: "तीन"
},
{
    question: "2011 के जनगणना के अनुसार किस राज्य की जनसंख्या घटी है ?",
    option: ["बिहार", "महाराष्ट्र", "नागालैण्ड", "सिक्किम"],
    answer: "नागालैण्ड"
},
{
    question: "भारत में सबसे अधिक जनसंख्या पनल वाला राज्य है",
    option: ["पश्चिम बंगाल", "झारखंड", "बिहार", "छत्तीसगढ़"],
    answer: "पश्चिम बंगाल"
},
{
    question: "भारत में सबसे अधिक शिक्षित महिलाओं वाला राज्य है",
    option: ["मध्य प्रदेश", "केरल", "बिहार", "उत्तर प्रदेश"],
    answer: "केरल"
},
{
    question: "भारत में सबसे कम साक्षरता वाला राज्य है ।",
    option: ["राजस्थान", "गुजरात", "मध्य प्रदेश", "बिहार"],
    answer: "बिहार"
},
{
    question: "भारत की जनसंख्या विश्व की जनसंख्या का कुल कितना प्रतिशत है ।",
    option: ["20 प्रतिशत", "16 प्रतिशत", "10 प्रतिशत", "40 प्रतिशत"],
    answer: "16 प्रतिशत"
},
{
    question: "‘जनसांख्यिकी’ शब्द किस भाषा से लिया गया है ?",
    option: ["उर्दू", "संस्कृत", "ग्रीक", "फ्रेंच"],
    answer: "ग्रीक"
},
{
    question: "जनसंख्या अध्ययन को क्या कहते",
    option: ["न्यूमेसमेटिक्स", "डेमेग्राफी", "इपीग्राफी", "इनमें से कोई नहीं"],
    answer: "डेमेग्राफी"
},
{
    question: "जनांकिकी (जनसांखिकी) का जनक कहा जाता",
    option: ["माल्थस", "गुर्डलाई", "जॉन ग्रान्ट", "एडम स्मिथ"],
    answer: "जॉन ग्रान्ट"
},
{
    question: "जनसंख्या की दृष्टि से भारत का विश्व में कौन – सा स्थान है ?",
    option: ["दूसरा", "तीसरा", "पाँचवां", "आठवां"],
    answer: "दूसरा"
},
{
    question: "वर्ष 2011 की जनगणना के अनुसार भारत में साक्षरता की दर (लगभग) है",
    option: ["65 %", "68 %", "74 %", "76 %"],
    answer: "74 %"
},
{
    question: "भारत में पहली बार किस वर्ष राष्ट्रीय जनसंख्या नीति घोषित की गयी ?",
    option: ["सन् 1974 में", "सन् 1976 में", "सन् 1956 में", "सन् 1982 में"],
    answer: "सन् 1976 में"
},
{
    question: "निम्नलिखित में से किसका सम्बन्ध ‘जनसंख्या के स्वयं समायोजन चक्र’ से है ?",
    option: ["एडम स्मिथ", "चाइल्ड", "माल्थस", "इनमें से कोई नहीं"],
    answer: "एडम स्मिथ"
},
{
    question: "भारत में परिवार नियोजन कार्यक्रम की शुरूआत की गयी",
    option: ["सन् 1944 में", "सन् 1952 में", "सन् 1956 में", "सन् 1960 में"],
    answer: "सन् 1952 में"
},
{
    question: "निम्नलिखित में से जनसंख्या के किस परिप्रेक्ष्य को ‘जनांकिकीय पारगमन त्रि – स्तरीय मॉडल’ के नाम से जाना जाता है ?",
    option: ["जनाकिकी परिप्रेक्ष्य", "समाजशास्त्रीय परिप्रेक्ष्य", "आर्थिक परिप्रेक्ष्य", "ऐतिहासिक परिप्रेक्ष्य"],
    answer: "ऐतिहासिक परिप्रेक्ष्य"
},
{
    question: "जनसांख्यिकी के अध्ययन में निन में से किसे सम्मिलित किया गया है ?",
    option: ["जनसंख्या के आकार में परिवर्तन", "जनसंख्या की बनावट", "जनसंख्या का वितरण", "इनमें से कोई नहीं"],
    answer: "जनसंख्या के आकार में परिवर्तन"
},
{
    question: "भारत में जनसंख्या वृद्धि का प्रमुख कारण है",
    option: ["धार्मिक एवं भाग्यवादी मान्यताओं का प्रभाव", "अज्ञानता एवं अशिक्षा", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "उपर्युक्त दोनों"
},
{
    question: "भारत में राष्ट्रीय जनसंख्या नीति (1976) में निम्न में से कौन – सा प्रावधान किया गया ?",
    option: ["विवाह हेतु न्यूनतम आयु क्रमशः लड़के की 21 वर्ष और लड़की की 18 वर्ष निर्धारित की गयी", "केन्द्रीय सहायता का 8 % भाग परिवार कल्याण कार्यक्रम पर व्यय करने का प्रावधान", "औपचारिक विद्यालयी शिक्षा में जनसंख्या शिक्षा की अनिवार्यता", "उपर्युक्त सभी"],
    answer: "केन्द्रीय सहायता का 8 % भाग परिवार कल्याण कार्यक्रम पर व्यय करने का प्रावधान"
},
{
    question: "निम्नलिखित में से माल्थस के जनसंख्या सिद्धान्त की मान्यता है",
    option: ["मनुष्य को जीवित रखने के लिए भोजन आवश्यक है", "कृषि में उत्पत्ति ह्रास नियम लागू होता है", "जनसंख्या आवश्यक रूप से जीविका के साधनों द्वारा निर्धारित होती", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "किसने कहा “मनुष्य को यह समझ लेना चाहिए कि वह अपनी गरीबी का स्वयं ही कारण है ?”",
    option: ["सोरोकिन", "रिचर्ड डेवी", "बर्गेल", "माल्थस"],
    answer: "माल्थस"
},
{
    question: "2001 की जनगणना के अनुसार भारत में प्रति 1000 पुरुष पर स्त्रियों की संख्या है",
    option: ["967", "933", "947", "955"],
    answer: "933"
},
{
    question: "कौन – सी परिस्थिति जनसंख्या वृद्धि के लिए उत्तरदायी है ?",
    option: ["सामाजिक मूल्य", "जीवन पद्धति", "शैक्षणिक स्तर", "आर्थिक विकास"],
    answer: "शैक्षणिक स्तर"
},
{
    question: "भारतीय समाज का इतिहास कितने वर्षों की अवधि का है ?",
    option: ["2000 वर्ष", "3000 वर्ष", "4000 वर्ष", "5000 वर्ष"],
    answer: "3000 वर्ष"
},
{
    question: "इनमें से जनसंख्या वृद्धि का परिणाम कौन नहीं है ?",
    option: ["खाद्य समस्या", "आवास की समस्या", "रोजगार की समस्या", "ठंडे मौसम में सर्दी लगना"],
    answer: "ठंडे मौसम में सर्दी लगना"
},
{
    question: "बिहार में बेरोजगारी भत्ता किस आयु समूह को दिया जाता है ?",
    option: ["21 से 31", "18 से 25", "18 से 27", "16 से 27"],
    answer: "21 से 31"
},
{
    question: "“संयुक्त परिवार एक ऐसा परिवार है जिसमें लोग समान आवास में रहते हैं, एक चूल्हा का बना खाते हैं, समान सम्पत्ति के हकदार होते हैं और समान पूजा–पाठ में भाग लेते हैं।” संयुक्त परिवार की ऐसी परिभाषा किसने दी है?",
    option: ["इरावतीकार्वे", "आई ० पी ० देसाई", "ए ० आर ० देसाई", "एम ० एन ० श्रीनिवास"],
    answer: "एम ० एन ० श्रीनिवास"
},
{
    question: "निम्न में कौन जनजातीय धर्म का स्वरूप है?",
    option: ["ब्रह्मवाद", "टोटमवाद", "ओझागिरी", "इनमेंसभी"],
    answer: "टोटमवाद"
},
{
    question: "परीक्षा विवाह किस जनजाति में होती है?",
    option: ["मुंडा", "संथाल", "नागा", "भील"],
    answer: "भील"
},
{
    question: "भारत में अनुसूचित जातियों के लिए आरक्षण का प्रावधान किस धारा के अन्तर्गत की गयी है?",
    option: ["धारा-355", "धारा-379", "धारा-302", "धारा-330"],
    answer: "धारा-355"
},
{
    question: "निम्नलिखित में कौन एक जाति है?",
    option: ["वैश्य", "राजपूत", "शूद्र", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "भारतीय सामाजिक व्यवस्था का महत्वपूर्ण पहन क्या है?",
    option: ["संयुक्त परिवार", "जाति–व्यवस्था", "धर्म", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में कौन एक संस्था है?",
    option: ["गाँव", "राष्ट्र", "विवाह", "किसान संघ"],
    answer: "विवाह"
},
{
    question: "निम्न में से भारत के किस राज्य में आदिवासी आबादी सर्वाधिक है?",
    option: ["पश्चिम बंगाल", "छत्तीसगढ़", "उत्तर प्रदेश", "गुजरात"],
    answer: "गुजरात"
},
{
    question: "जाति–व्यवस्था की उत्पत्ति से सम्बन्धित प्रजातीय सिद्धान्त के प्रतिपादक निम्न में से कौन–सा विद्वान है",
    option: ["हट्टन", "रिजले", "नेसफील्ड", "श्रीनिवास"],
    answer: "रिजले"
},
{
    question: "निम्न में से कौन एक संस्था है?",
    option: ["राष्ट्र", "गाँव", "परिवार", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में से कौन जाति–व्यवस्था की एक मौलिक विशेषता नहीं है?",
    option: ["संस्तरण", "समाज का खण्डात्मक विभाजन", "सामाजिक गतिशीलता", "अन्तर्विवाह"],
    answer: "सामाजिक गतिशीलता"
},
{
    question: "भारत का सबसे बड़ा जनजातीय समूह कौन है?",
    option: ["संथाल", "मुंडा", "गारो", "गोंड"],
    answer: "गारो"
},
{
    question: "भारतीय संविधान के किस अनुच्छेद के द्वारा लोकसभा अनुसूचित जाति एवं जनजाति के सदस्यों के लिए स्थान आरक्षित किया गया है?",
    option: ["अनुच्छेद-334", "अनुच्छेद-332", "अनुच्छेद-330", "अनुच्छेद-338"],
    answer: "अनुच्छेद-330"
},
{
    question: "खस या खासी बहुपति विवाह किस जनजाति में पाया जाता है?",
    option: ["संथल", "टोडा", "मुंडा", "खस"],
    answer: "खस"
},
{
    question: "किसने कहा, ‘जाति एक बंद वर्ग है’",
    option: ["मैक्स वेबर", "मजूमदार एवं मदन", "रिजले", "मैकाइवर एवं पेज"],
    answer: "मजूमदार एवं मदन"
},
{
    question: "कौन सा आदिवासी समाज मातृ प्रधान है?",
    option: ["संथाल", "मुंडा", "भील", "इनमेंसे कोई नहीं"],
    answer: "इनमेंसे कोई नहीं"
},
{
    question: "कौन भारतीय समाज की सबसे प्रमुख विशेषता है?",
    option: ["वर्ण व्यवस्था", "अनेकतामें एकता", "यजमानीव्यवस्था", "इनमेंसभी"],
    answer: "इनमेंसभी"
},
{
    question: "निम्न में से कौन जनजातीय समाज की समस्या नहीं है?",
    option: ["भूमिविलगाव", "छुआछूत", "( a ) एवं ( b ) दोनों", "इनमेंसे कोई नहीं"],
    answer: "( a ) एवं ( b ) दोनों"
},
{
    question: "निम्नलिखित में से कौन परिवार की विशेषता है",
    option: ["सार्वभौमिकता", "सीमित आकार", "भावात्मक आधार", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में से कौन जनजाति की विशेषता है?",
    option: ["सामान्य भू–भाग", "सामान्य भाषा", "सामान्य संस्कृति", "इनमेंसभी"],
    answer: "इनमेंसभी"
},
{
    question: "निम्नलिखित में से बन्द स्तरीकरण का उदाहरण कौन–सा है",
    option: ["वर्ग", "सत्ता", "जाति", "उपर्युक्त सभी"],
    answer: "जाति"
},
{
    question: "निम्न में से कौन से कारक भारतीय जाति व्यवस्था में परिवर्तन के उत्तरदायी है?",
    option: ["औद्योगिकरण", "पंचायतीराज", "जजमानीव्यवस्था", "प्रभुजाति"],
    answer: "पंचायतीराज"
},
{
    question: "भील नामक जनजाति किस राज्य में निवास करती है?",
    option: ["असम", "प्रदेश", "पश्चिम बंगाल", "बिहार"],
    answer: "प्रदेश"
},
{
    question: "निम्न में से कौन जाति की विशेषता नहीं है?",
    option: ["संस्तरण", "अन्तःविवाह", "शुद्धता", "खुलापन"],
    answer: "खुलापन"
},
{
    question: "‘चाचा’ नातेदारी के किस श्रेणी के अन्तर्गत आता है?",
    option: ["प्राथमिक", "द्वितीयक", "तृतीयक", "इनमेंसे कोई नहीं"],
    answer: "द्वितीयक"
},
{
    question: "निम्न में से कौन–सा नातेदारी से स्पष्ट रूप से नहीं आता है?",
    option: ["वंश परम्परा", "विवाह अन्य संबंध", "प्रस्थिति", "समकक्ष समूह"],
    answer: "विवाह अन्य संबंध"
},
{
    question: "जाति व्यवस्था की उत्पत्ति–संबंधी देवत्व का सिद्धांत किस वेद में वर्णित है?",
    option: ["अथर्ववेद", "सामवेद", "ऋग्वेद", "यजुर्वेद"],
    answer: "सामवेद"
},
{
    question: "निम्न में से कौन भारतीय ने जाजातियों के लिए ‘अलगाव की नीति’ की वकालत की?",
    option: ["बेली", "घुरिये", "एल्विन", "डॉ. मजूमदार"],
    answer: "डॉ. मजूमदार"
},
{
    question: "जनजाति समाजों में निम्न में से क्या नहीं पाया जाता है?",
    option: ["श्रम–विभाजन", "युवागृह", "महिलाकी आजादी", "सरल अर्थव्यवस्था"],
    answer: "महिलाकी आजादी"
},
{
    question: "घुमकुरिया किस जनजाति में पाया जाता है?",
    option: ["मुंडा", "संथाल", "उराँव", "हो"],
    answer: "उराँव"
},
{
    question: "जाति व्यवस्था का व्यावसायारत्यक सिद्धांत के प्रतिपादक कौन है?",
    option: ["रिजले", "घुरिये", "नेसफील्ड", "मार्क्स"],
    answer: "रिजले"
},
{
    question: "जाति का आधार क्या है?",
    option: ["भाग्य", "कर्म", "पुनर्जन्म", "जन्म"],
    answer: "जन्म"
},
{
    question: "निम्न में से कौन द्विज नहीं कहलाते हैं?",
    option: ["ब्राह्मण", "क्षत्रिय", "वैश्य", "शूद्र"],
    answer: "शूद्र"
},
{
    question: "किस समाज में हुतु विवाह का प्रचलन है?",
    option: ["हिन्दूसमाज में", "जनजातीय समाज में", "मुस्लिम समाज में", "इनमेंसे कोई नहीं"],
    answer: "जनजातीय समाज में"
},
{
    question: "मुस्लिम विबाह है एक",
    option: ["संस्कार", "समझौता", "मित्रता", "इनमेंसे कोई नहीं"],
    answer: "समझौता"
},
{
    question: "निम्न में से कौन सा हिन्दू विवाह का उद्देश्य है",
    option: ["धार्मिक कर्त्तव्य", "पुत्र प्राप्ति", "रति", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "वर्ग व्यवस्था है एक",
    option: ["खुलीव्यवस्था", "बन्द व्यवस्था", "न ही खुली न ही बन्द", "इनमेंसे कोई नहीं"],
    answer: "खुलीव्यवस्था"
},
{
    question: "सामाजिक परिवर्तन का तात्पर्य है",
    option: ["सामाजिक संबंधों मेंपरिवर्तन", "सामाजिक समूहों में परिवर्तन", "सामाजिक अन्तः क्रियाओं मेंपरिवर्तन", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "सहपलायन विवाह, विवाह का एक प्रकार है–",
    option: ["जनजातीय समाज में", "हिन्दूसमाज में", "मुस्लिम समाज में", "ईसाई समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "किसने कहा धर्म किसी आध्यात्मिक शक्ति में विश्वास है?",
    option: ["टायलर", "फ्रेजर", "दुखीम", "मॉलिनोस्की"],
    answer: "टायलर"
},
{
    question: "निम्न में से कौन एक वर्ग नहीं है?",
    option: ["डॉक्टर", "शिक्षक", "ब्राह्मण", "वकील"],
    answer: "ब्राह्मण"
},
{
    question: "परिवीक्षा विवाह, विवाह का एक प्रकार है",
    option: ["जनजातीय समाज में", "हिन्दूसमाज में", "मुस्लिम समाज में", "ईसाई समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "हिन्दूओं में विवाह के कितने स्वरूप माने जाते ह",
    option: ["दस", "पाँच", "आठ", "चार"],
    answer: "आठ"
},
{
    question: "”भारत में विवाह और परिवार” किसने लिखी?",
    option: ["ए.एम. शाह", "जी.एस. घुर्ये", "के.एम. कपाडिया", "डब्ल्यू. आई. वार्नर"],
    answer: "के.एम. कपाडिया"
},
{
    question: "डेन्जरस ड्रग्स एक्ट किस वर्ष में पारित किया गया?",
    option: ["1930", "1931", "1938", "1933"],
    answer: "1938"
},
{
    question: "परिवार सामाजिक नियंत्रण के किस प्रकार के साधनों के अन्तर्गत आता है",
    option: ["औपचारिक नियंत्रण", "अनौपचारिक नियंत्रण के साधन", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "अनौपचारिक नियंत्रण के साधन"
},
{
    question: "“परिवार निश्चित यौन सम्बन्धों द्वारा परिभाषित एक ऐसा समूह है, जो बच्चों के जनन एवं पालन–पोषण की व्यवस्था करता है।” उपर्युक्त परिभाषा दी है",
    option: ["लसूमेयर ने", "बोगार्ड्स ने", "मैकाइवर एवं पेज ने", "बर्गेस एवं लॉक ने"],
    answer: "मैकाइवर एवं पेज ने"
},
{
    question: "किस विद्वान ने परिवार को ‘मानव स्वभाव की पोधिका’ कहा है?",
    option: ["मरडॉक", "चार्ल्स कूले", "मैकाइवर", "इनमेंसे कोई नहीं"],
    answer: "चार्ल्स कूले"
},
{
    question: "इनमें से कौन जाति व्यवस्था की देन है?",
    option: ["शोषण", "असमानता", "जातिवाद", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "किस प्रकार के परिवार को ‘दो–पीढ़ी परिवार’ कहा जाता है?",
    option: ["बृहत्संयुक्त परिवार", "संयुक्त परिवार", "एकाकीपरिवार", "इनमेंसे कोई नहीं"],
    answer: "एकाकीपरिवार"
},
{
    question: "निम्नलिखित में से परिवार का प्रकार्य है",
    option: ["सन्तानोत्पत्ति", "यौन इच्छाओं कीपूर्ति", "प्रजातिकी निरन्तरता", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "”नातेदारी सामाजिक उद्देश्यों के लिए स्वीकृत वंश सम्बन्ध है, जो कि सामाजिक सम्बन्धों के परम्परागत सम्बन्धों का आधार है।” उपर्युक्त कथन का सम्बन्ध है",
    option: ["रिवर्स", "जी.डी. माइकेल", "रैडक्लिफ ब्राउन", "मरडॉक"],
    answer: "रैडक्लिफ ब्राउन"
},
{
    question: "‘मानवशास्त्रीय शब्दकोष’ नामक पुस्तक के लेखक हैं",
    option: ["चार्ल्स विनिक", "इरावतीकर्वे", "मैकाइवर एवं पेज", "आर. के. ब्राउन"],
    answer: "चार्ल्स विनिक"
},
{
    question: "मॉर्गन ने नातेदारी संज्ञाओं के कितने प्रकारों का उल्लेख किया है?",
    option: ["एक", "दो", "तीन", "चार"],
    answer: "दो"
},
{
    question: "यह किसका कथन है कि “परिहास सम्बन्धों के द्वारा नातेदारों के बीच सहजतापूर्ण व घनिष्ठ मैत्रीपूर्ण सम्बन्धों का विकास होता है।”",
    option: ["आर.के. ब्राउन", "जे. फ्रेजर", "वेस्टरमार्क", "टॉयलर"],
    answer: "वेस्टरमार्क"
},
{
    question: "संयुक्त परिवार व्यवस्था पायी जाती है",
    option: ["औद्योगिक समाज में", "नगरीय समाज में", "ग्रामीण समाज में", "इनमेंसे कोई नहीं"],
    answer: "ग्रामीण समाज में"
},
{
    question: "संयुक्त परिवार की कौन–सी विशेषता है?",
    option: ["बड़ाआकार", "सामान्य सम्पत्ति", "सामान्य निवास", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "प्रायः संयुक्त परिवार कर्ता कौन होता है?",
    option: ["सबसेबुजुर्ग पुरुष", "सबसेबुजुर्ग महिला", "पढ़ा–लिखा व्यक्ति", "ज्येष्ठ पुत्र"],
    answer: "सबसेबुजुर्ग पुरुष"
},
{
    question: "निम्नलिखित में क्या संयुक्त परिवार का प्रकार्य नहीं है?",
    option: ["सामाजिक सुरक्षा", "आर्थिक सुरक्षा", "व्यक्तिवादिता", "मानसिक सुरक्षा"],
    answer: "व्यक्तिवादिता"
},
{
    question: "जन्ममूलक परिवार एवं प्रजनन मूलक परिवार की व्याख्या किस विद्वान ने की है?",
    option: ["लिण्टन", "डेविस", "मैकाइवर", "बोगार्डस"],
    answer: "डेविस"
},
{
    question: "”एक जनजाति के रूप में क्षेत्र, भाषा, सांस्कृतिक समरूपता तथा एक सूत्र में बाँधने वाले सामाजिक संगठन को लेते हैं, जिसमें गोत्र या गाँव सम्मिलित होते हैं।” जनजाति की उक्त परिभाषा दी है",
    option: ["हरबर्ट स्पेन्सन", "चार्ल्स विनिक", "डी.एन. मजूमदार", "मैकाइवर एवं पेज"],
    answer: "चार्ल्स विनिक"
},
{
    question: "निम्न में से सामान्य निषेध ‘(टेव) का सम्बन्ध है",
    option: ["खान–पान से", "विवाह से", "व्यवसाय से", "इन में सभी से"],
    answer: "इन में सभी से"
},
{
    question: "प्रो. एस.सी. दुबे ने भौगोलिक दृष्टि से भारतीय जनजातियों को निम्न में से कितने भागों में विभक्त किया है?",
    option: ["दो", "तीन", "चार", "पाँच"],
    answer: "चार"
},
{
    question: "निम्नलिखित में से शिकार एवं खाद्य संग्रहण जनजाति समूह है।",
    option: ["कुका", "मुण्डा", "भील", "गोंड"],
    answer: "कुका"
},
{
    question: "किस मानवशास्त्री ने पर–संस्कृतिग्रहण को जनजाति संस्कृति के विघटन के लिए उत्तरदायी माना है?",
    option: ["एम.एन. श्रीनिवास", "रैडक्लिफ ब्राउन", "किंग्सले डेविस", "मजूमदार एवं मदान"],
    answer: "मजूमदार एवं मदान"
},
{
    question: "किस संविधान संशोधन के तहत अनुसूचित जाति, जनजाति अत्याचार निरोधक अधिनियम पारित किया गया?",
    option: ["32 वें", "65 वें", "44 वें", "66 वें"],
    answer: "65 वें"
},
{
    question: "संविधान के किस अनुच्छेद के अन्तर्गत यह प्रावधान किया गया कि सम्बन्धित राज्य का राज्यपाल, राष्ट्रपति की अनुमति से किसी भी जनजाति को अनुसूचित जनजाति में सम्मिलित कर सकता है?",
    option: ["अनुच्छेद-342", "अनुच्छेद-338", "अनुच्छेद-339", "उपर्युक्त सभी"],
    answer: "अनुच्छेद-342"
},
{
    question: "जनजातियों को ‘पिछड़े हिन्दू’ कहकर किस समाजशास्त्री ने सम्बोधित किया है?",
    option: ["आर.के. मुखर्जी", "जी.एस. घुरये", "आर.के. ब्राउन", "एस.सी. दुबे"],
    answer: "जी.एस. घुरये"
},
{
    question: "बी.एस. गुहा ने उत्तरी–पूर्वी क्षेत्र के अन्तर्गत किस सीमावर्ती राज्य को सम्मिलित किया है?",
    option: ["मध्य प्रदेश", "झारखण्ड", "पूर्वीपंजाब", "आन्ध्र प्रदेश"],
    answer: "पूर्वीपंजाब"
},
{
    question: "निम्न में से जनजाति की विशेषता है",
    option: ["सामान्य संस्कृति", "एक विशिष्ट नाम", "बहिर्विवाहीसमूह", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से द्रविड़ भाषायी परिवार से सम्बन्धित जनजाति है",
    option: ["गोंड", "उराँव", "( a ) और ( b ) दोनों", "इनमेंसे कोई नहीं"],
    answer: "( a ) और ( b ) दोनों"
},
{
    question: "भारतीय समाज में सामाजिक स्तरीकरण का बुनियादी आधार क्या है",
    option: ["धन एवं सम्पत्ति", "जाति", "परिवार", "धर्म"],
    answer: "धर्म"
},
{
    question: "प्रभुजाति की अवधारणा देन है",
    option: ["पी.एन. प्रभु की", "मजूमदार की", "रिजलेकी", "श्रीनिवास की"],
    answer: "श्रीनिवास की"
},
{
    question: "निम्न में से किसने जाति प्रथा की उत्पत्ति पर प्रजातीय दृष्टिकोण प्रस्तुत किया है?",
    option: ["मॉर्गन", "रिजले", "नेसफील्ड", "ए.आर. देसाई"],
    answer: "रिजले"
},
{
    question: "निम्न में से कौन जनजाति की विशेषता है?",
    option: ["सामान्य भूभाग", "सामान्य भाषा", "सामान्य संस्कृति", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "निम्न में से किसने सामाजिक–धार्मिक सुधार आन्दोलनों में अग्रणी भूमिका निभायी?",
    option: ["राजाराममोहन राय", "दयानन्द सरस्वती", "उपर्युक्त दोनों", "उपर्युक्त में से कोई नहीं"],
    answer: "उपर्युक्त दोनों"
},
{
    question: "निम्न में से किसने भारतीय जनजातियों के लिए ‘अलगाव की नीति’ की वकालत की?",
    option: ["बेली", "घुरिये", "एल्विन", "मजूमदार"],
    answer: "एल्विन"
},
{
    question: "जनजाति समाजों में निम्न में से क्या नहीं पाया जाता है?",
    option: ["श्रम विभाजन", "युवागृह", "महिलाकी आजादी", "सरल अर्थव्यवस्था"],
    answer: "श्रम विभाजन"
},
{
    question: "भारत सरकार द्वारा ‘दहेज निरोधक अधिनियम’ किस वर्ष पारित किया गया?",
    option: ["सन्1961 में", "सन्1965 में", "सन्1968 में", "सन्1971 में"],
    answer: "सन्1961 में"
},
{
    question: "उराँव निवासी हैं राज्य के।",
    option: ["बिहार", "झारखण्ड", "ओडिशा", "मध्य प्रदेश"],
    answer: "झारखण्ड"
},
{
    question: "युवा संगठन पायाजाता है",
    option: ["ग्रामीण समाज में", "नगरीय समाज में", "जनजातीय समाज में", "औद्योगिक समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "कौन समस्या जनजातीय जीवन से सम्बन्धित नहीं है?",
    option: ["छूआछूत", "युवाआवासशाला", "जातिसंस्तरण काविकास", "भूमिनिष्कासन"],
    answer: "छूआछूत"
},
{
    question: "एक विचारधारा के रूप में ‘जाति–व्यवस्था’ का अध्ययन निम्न में से किस समाजशास्त्री ने किया है?",
    option: ["लुई ड्यूमाँ", "एम.एस. श्रीनिवास", "मैकम मैरियट", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "जाति व्यवस्था में परिवर्तन के लिए निम्नलिखित में से कौन–सा कारण उत्तरदायी है?",
    option: ["शिक्षाका प्रसार", "धर्म के प्रभाव मेंकमी", "पश्चिमीसभ्यता का प्रभाव", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "किस समाजशास्त्री ने ‘जाति’ की अवधारणा का प्रयोग ‘प्रजाति’ के सन्दर्भ में किया है?",
    option: ["मैक्स वेबर", "अब्बेडुवॉयस", "केतकर", "रिजले"],
    answer: "अब्बेडुवॉयस"
},
{
    question: "यह कथन किसका है कि “जब एक वर्ग लगभग पूर्ण रूप से वंशानुक्रमण पर आधारित होता है, तब उसे हम जाति कहते हैं”?",
    option: ["चार्ल्स कूले", "लुई ड्यूमा", "एम.एन. श्रीनिवास", "आन्द्रेबेताई"],
    answer: "चार्ल्स कूले"
},
{
    question: "‘द्विधर प्रतिकूलता का सिद्धान्त’ दिया है",
    option: ["एस.सी. दुबे", "एम.एन. श्रीनिवास", "आन्द्रे बेताई", "लुई ड्यूमा"],
    answer: "लुई ड्यूमा"
},
{
    question: "सर हरबर्ट रिजले के नेतृत्व में किस वर्ष जाति आधारित जनगणना आयोजित की गयी?",
    option: ["सन्1971 में", "सन्1981 में", "सन्1901 में", "सन्1921 में"],
    answer: "सन्1901 में"
},
{
    question: "निम्नलिखित में से जाति व्यवस्था की विशेषता है",
    option: ["खान–पान एवं सामाजिक सहवास पर प्रतिबन्ध", "खुलीव्यवस्था", "एक अन्तर्विवाही समूह", "इनमेंसे सभी"],
    answer: "खान–पान एवं सामाजिक सहवास पर प्रतिबन्ध"
},
{
    question: "नातेदारी की कितनी श्रेणियाँ होती हैं?",
    option: ["दो", "तीन", "चार", "पाँच"],
    answer: "तीन"
},
{
    question: "धर्म की उत्पत्ति के ‘आत्मवाद’ का सिद्धान्त किसने दिया?",
    option: ["टायलर", "दुर्थीम", "मैक्स मूलर", "फ्रेजर"],
    answer: "टायलर"
},
{
    question: "निम्न में से कौन जातिवाद का दुष्परिणाम है?",
    option: ["औद्यौगिक प्रतिस्पर्धा", "सामाजिक समस्याओं मेंवृद्धि", "जजमानीव्यवस्था", "नारीशिक्षा"],
    answer: "सामाजिक समस्याओं मेंवृद्धि"
},
{
    question: "निम्न में से कौन बिहार में अनुसूचित जाति नहीं है?",
    option: ["पासवान", "मांझी", "रविदास", "कुर्मी"],
    answer: "कुर्मी"
},
{
    question: "भारतीय समाज कितने आश्रमों में विभाजित था?",
    option: ["चार", "पाँच", "तीन", "सात"],
    answer: "चार"
},
{
    question: "‘दादी’ नातेदारी की किस श्रेणी के अन्तर्गत आती है?",
    option: ["प्राथमिक", "द्वितीयक", "तृतीयक", "इनमेंसे कोई नहीं"],
    answer: "द्वितीयक"
},
{
    question: "निम्न में से कौन–सा एक वर्ण है?",
    option: ["ब्राह्मण", "यादव", "त्यागी", "अग्रवाल"],
    answer: "ब्राह्मण"
},
{
    question: "किस समाज में ‘पैशाच विवाह’ का प्रचलन था?",
    option: ["हिन्दूसमाज में", "मुस्लिम समाज में", "सिख समाज में", "आदिवासी समाज में"],
    answer: "हिन्दूसमाज में"
},
{
    question: "मरडॉक के अनुसार विवाह का क्या उद्देश्य है?",
    option: ["यौन इच्छा की पूर्ति", "बच्चोंका पालन पोषण", "आर्थिक सहयोग", "इनमेंसे सभी"],
    answer: "यौन इच्छा की पूर्ति"
},
{
    question: "‘अहिंसा परमो धर्मः’ किस धर्म की शिक्षा है?",
    option: ["हिन्दू", "बौद्ध", "सिख", "जैन"],
    answer: "हिन्दू"
},
{
    question: "निम्न में से कौन जाति नहीं है?",
    option: ["ब्राह्मण", "शूद्र", "कुशवाहा", "रविदास"],
    answer: "शूद्र"
},
{
    question: "घरेलू हिंसा का क्या तात्पर्य है?",
    option: ["ग्रामीण हिंसा", "सामुदायिक हिंसा", "धार्मिक हिंसा", "पारिवारिक हिंसा"],
    answer: "पारिवारिक हिंसा"
},
{
    question: "निम्न में से कौन जनजाति नहीं है?",
    option: ["भील", "संथाल", "खासी", "चौपाल"],
    answer: "चौपाल"
},
{
    question: "जाति का प्रजातीय सिद्धान्त किसने प्रतिपादित किया?",
    option: ["नेसफील्ड", "एस ० सी ० दूबे", "होकार्ट", "हर्बर्ट रिजले"],
    answer: "नेसफील्ड"
},
{
    question: "निम्न में से कौन एक वर्ग नहीं है?",
    option: ["प्रधानाचार्य", "चिकित्सक", "न्यायाधीश", "राजपूत"],
    answer: "राजपूत"
},
{
    question: "हिन्दू विवाह के किस स्वरूप में एक जोड़े बैल एवं गाय की माँग की जाती है?",
    option: ["दैव विवाह", "ब्रह्म विवाह", "आर्ष विवाह", "प्रजापत्य विवाह"],
    answer: "आर्ष विवाह"
},
{
    question: "हिन्दू विवाह का निम्न में से कौन–सा प्रकार अमान्य है?",
    option: ["ब्रह्म विवाह", "दैव विवाह", "प्रजापत्य विवाह", "असुर विवाह"],
    answer: "असुर विवाह"
},
{
    question: "जनजातियों में जीवन साथी प्राप्त करने की कितनी पद्धतियाँ हैं?",
    option: ["आठ", "सात", "पाँच", "ग्यारह"],
    answer: "सात"
},
{
    question: "समाज का निर्माण निम्न में से किससे होता है?",
    option: ["व्यक्तियोंसे", "संस्थाओंसे", "सामाजिक संबंधों से", "इनमेंसे सभी"],
    answer: "इनमेंसे सभी"
},
{
    question: "प्राचीन भारतीय समाज कितने वर्षों में विभाजित था?",
    option: ["तीन", "चार", "पाँच", "दो"],
    answer: "चार"
},
{
    question: "हिन्दू विवाह का कौन–सा प्रकार परस्पर प्रेम पर आधारित है?",
    option: ["गंधर्व", "प्रजापत्य", "असुर", "राक्षस"],
    answer: "गंधर्व"
},
{
    question: "निम्न में से कौन नातेदारी की रीतियाँ नहीं है?",
    option: ["परिहार", "वर्गीकृत संज्ञाएँ", "परिहास सम्बन्ध", "माध्यमिक संबोधन"],
    answer: "वर्गीकृत संज्ञाएँ"
},
{
    question: "निम्न में से किसने जाति व्यवस्था की उत्पत्ति के धार्मिक सिद्धान्त की वकालत की?",
    option: ["होकार्ट एवं सेनार्ट", "हबर्ट रिजले", "मजूमदार एवं मदान", "जी० एस० घुर्ये"],
    answer: "होकार्ट एवं सेनार्ट"
},
{
    question: "किस समाज में सेवा विवाह का प्रचलन है?",
    option: ["हिन्दूसमाज में", "मुस्लिम समाज में", "जनजातीय समाज में", "सिख समाज में"],
    answer: "जनजातीय समाज में"
},
{
    question: "बाजार क्या है ?",
    option: ["एक संस्था", "एक सामाजिक समूह", "एक समुदाय", "इनमें से कोई नहीं"],
    answer: "इनमें से कोई नहीं"
},
{
    question: "बाजार किस चीज का केन्द्र है ?",
    option: ["विनिमय", "खपत", "वितरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "दो पक्षों के के मध्य होने वाले ऐच्छिक, वैधानिक एवं पारस्परिक धन के हस्तांतरण को विनिमय कहते हैं। यह किसका कथन है ?",
    option: ["मार्शल", "थॉमस", "स्मिथ", "डॉ. मजूमदार"],
    answer: "मार्शल"
},
{
    question: "एक वस्तु से दूसरी वस्तु के प्रत्यक्ष विनिमय को ही वस्तु विनिमय हैं कहते। यह कथन किसका है ?",
    option: ["मार्शल", "थॉमस", "एडम स्मिथ", "ब्लेयर"],
    answer: "थॉमस"
},
{
    question: "घोराई किस राज्य में है ?",
    option: ["बिहार", "झारखंड", "मध्य प्रदेश", "छत्तीसगढ़"],
    answer: "छत्तीसगढ़"
},
{
    question: "‘द वेल्थ ऑफ नेशन्स’ के रचयिता हैं",
    option: ["मैक्स वेबर", "एडम स्मिथ", "कार्ल मार्क्स", "कॉलिन्स"],
    answer: "एडम स्मिथ"
},
{
    question: "बाजार स्थिति से अर्थ विनिमय के किसी भी विषय के लिए उसे द्रव में बदलने के उन तमाम अवसरों से होता है, जिनके बारे में बाजार स्थिति में सहभागी को पता है कि वे उन्हें प्राप्त हैं और वे दामों तथा प्रतिस्पर्द्धा की दृष्टि से उनकी मनोवृत्तियों के लिए सन्दर्भपूर्ण हैं। बाजार की उक्त परिभाषा दी है",
    option: ["मैक्स वेबर", "सिजविक", "एडम स्मिथ", "मैकाइवर एवं पेज"],
    answer: "सिजविक"
},
{
    question: "‘अदृश हाथ’ की अवधारणा का सम्बन्ध किस समाज वैज्ञानिक से है ?",
    option: ["आर. के. ब्राउन", "मार्शल", "स्पेन्सर", "स्मिथ"],
    answer: "स्मिथ"
},
{
    question: "प्राचीन काल में भारत में ‘विनिमय बिल’ या हुण्डी का प्रचलन किस प्रकार की व्यवस्था से सम्बन्धित था ?",
    option: ["बैंकिंग व्यवस्था से", "जाति व्यवस्था से", "वर्ग व्यवस्था से", "इनमें से किसी से नहीं"],
    answer: "बैंकिंग व्यवस्था से"
},
{
    question: "ग्रामीण भारत में ‘वस्तु विनिमय’ किस नाम से जाना जाता है ? पर आधारित अर्थव्यवस्था को",
    option: ["सती प्रथा", "जजमानी प्रथा", "जौहर प्रथा", "ये सभी"],
    answer: "जजमानी प्रथा"
},
{
    question: "वह बाजार जो किसी भी प्रकार की राष्ट्रीय अथवा अन्य रोकथाम से पूर्णतः मुक्त होता है, कहलाता है",
    option: ["मुक्त या खुला बाजार", "बन्द बाजार", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "मुक्त या खुला बाजार"
},
{
    question: "यह किसका कथन है कि सभी आर्थिक व्यवस्थाएँ सामाजिक व्यवस्थाएँ भी हैं। प्रत्येक उत्पादन विधि विशेष उत्पादन सम्बन्धों से निर्मित होती है, जो अन्ततः एक विशिष्ट वर्ग संरचना का निर्माण करती है।",
    option: ["जॉर्ज सिमैल", "मैक्स वेबर", "कार्ल मार्क्स", "लुईस वर्थ"],
    answer: "कार्ल मार्क्स"
},
{
    question: "भारत में भूमण्डलीकरण का आरम्भ किस दशक से माना जाता है ?",
    option: ["1960 ई. में", "1990 ई. में", "1980 ई. में", "इनमें से कोई नहीं"],
    answer: "1990 ई. में"
},
{
    question: "वह प्रक्रिया जिसमें कोई भी वस्तु जो पूर्व में बाजार का हिस्सा नहीं थी, वह अब बाजार में बिकने वाली वस्तु बन गयी है अर्थात् वह अब बाजार का एक हिस्सा बन गयी है, कहलाती है",
    option: ["पण्यीकरण", "पूँजीवाद", "उपभोग", "उदारवाद"],
    answer: "पण्यीकरण"
},
{
    question: "निम्नलिखित में से बाजार की प्रमुख विशेषता है",
    option: ["बाजार में वस्तुओं का मूल्य उसकी माँग एवं पूर्ति द्वारा निर्धारित किया जाता है।", "बाजार में सभी सेवाएँ भी अन्य वस्तुओं की भाँति खरीदी व बेची जाती है।", "बाजार में श्रम विभाजन एवं विशिष्टीकरण पाया जाता हैं।", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से बाजार का स्वरूप है",
    option: ["साप्ताहिक बाजार (हाट)", "औद्योगिक बाजार", "पूर्ण एवं अपूर्ण बाजार", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "किस वर्ष बाल श्रम पर एक राष्ट्रीय नीति बनाई गई ?",
    option: ["1986", "1991", "1948", "1952"],
    answer: "1986"
},
{
    question: "निम्न में से कौन वैश्वीकरण के प्रमुख प्रेरक हैं ?",
    option: ["बाजार की खोज", "प्रौद्योगिकी, इलेक्ट्रॉनिक एवं कम्प्यूटर नेटवर्क", "बहुराष्ट्रीय विनियोग", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में किस वर्ष समेकित बाल विकास सेवा कार्यक्रम प्रारंभ किया गया ?",
    option: ["1975", "1974", "2011", "1985"],
    answer: "1975"
},
{
    question: "बाल अधिकार संरक्षण हेतु किन्हें नोबेल शांति पुरस्कार से सम्मानित किया गया ?",
    option: ["मलाला युसुफजाई", "कैलाश सत्यार्थी", "मदर टेरेसा", "अमर्त्य सेन"],
    answer: "कैलाश सत्यार्थी"
},
{
    question: "‘बचपन बचाओ आन्दोलन’ के संस्थापक कौन हैं ?",
    option: ["कैलाश सत्यार्थी", "मेधा पाटेकर", "नीरा देसाई", "मदर टेरेसा"],
    answer: "कैलाश सत्यार्थी"
},
{
    question: "जनजातियों के पिछड़ेपन के निम्न में कौन एक कारक है ?",
    option: ["अशिक्षा", "धर्म", "जंगल", "नशाखोरी"],
    answer: "अशिक्षा"
},
{
    question: "मुस्लिम महिलाओं को सम्पत्ति के अधिकार के विवाद से किसका नाम जुड़ा हुआ है ?",
    option: ["शाहबानो", "नूर फातिमा", "शाबाना आजमी", "चाँद बीबी"],
    answer: "शाहबानो"
},
{
    question: "भारत सरकार ने सर्वप्रथम अल्पसंख्यक आयोग की स्थापना किस वर्ष की ?",
    option: ["1978 ई. में", "1992 ई. में", "1999 ई. में", "1988 ई. में"],
    answer: "1978 ई. में"
},
{
    question: "छुआछूत को संविधान के किस अनुच्छेद के अंतर्गत प्रतिबन्धित किया गया है ?",
    option: ["अनुच्छेद -23", "अनुच्छेद -14", "अनुच्छेद -17", "अनुच्छेद -25"],
    answer: "अनुच्छेद -17"
},
{
    question: "भारत के किस प्रांत में हिन्दू अल्पसंख्यक हैं ?",
    option: ["हरियाणा", "पंजाब", "जम्मू – कश्मीर", "केरल"],
    answer: "जम्मू – कश्मीर"
},
{
    question: "निम्न में से भारत के किस राज्य में ईसाइयों की संख्या सर्वाधिक है ?",
    option: ["बिहार", "मध्य प्रदेश", "तमिलनाडु", "केरल"],
    answer: "केरल"
},
{
    question: "निम्न समूहों में से किससे आप भारत के सबसे छोटी धार्मिक अल्पसंख्यक सम्प्रदाय मानते हैं ?",
    option: ["मुस्लिम", "ईसाई", "सिक्ख", "पारसी"],
    answer: "पारसी"
},
{
    question: "जातीय पूर्वाग्रह का क्या अर्थ है ?",
    option: ["जाति वर्गीकरण", "जाति संघर्ष", "किसी जाति में प्रवेश पाने के लिए किया गया प्रयास", "किसी जाति से सम्बन्धित अवैज्ञानिक एवं गलत अवधारणा"],
    answer: "किसी जाति से सम्बन्धित अवैज्ञानिक एवं गलत अवधारणा"
},
{
    question: "बिहार में जतीय तनाव का मुख्य कारण है",
    option: ["जमीन", "फैशन", "शिक्षा", "इनमें से कोई नहीं"],
    answer: "जमीन"
},
{
    question: "हिन्दू विवाह अधिनियम पारित हुआ",
    option: ["1950 ई. में", "1954 ई. में", "1955 ई. में", "1976 ई. में"],
    answer: "1955 ई. में"
},
{
    question: "भारत सरकार द्वारा अनुसूचित जातियों की अधिकृत अनुसूची कब घोषित की गई ?",
    option: ["सन् 1955", "सन् 1950", "सन् 1935", "सन् 1952"],
    answer: "सन् 1950"
},
{
    question: "अन्य पिछड़ा वर्ग के लिए सरकार ने कितना आरक्षण प्रदान किया है ?",
    option: ["33 प्रतिशत", "27 प्रतिशत", "11 प्रतिशत", "44 प्रतिशत"],
    answer: "27 प्रतिशत"
},
{
    question: "निम्नलिखित में से कौन एक सामाजिक समस्या है ?",
    option: ["प्रेम विवाह", "नगरीकरण", "भिक्षावृति", "आधुनिकीकरण"],
    answer: "भिक्षावृति"
},
{
    question: "पारसन्स ने बच्चों के समाजीकरण में",
    option: ["तीन अवस्थाओं का उल्लेख किया है", "तीन अवस्थाओं का उल्लेख किया है", "पाँच अवस्थाओं का उल्लेख किया है", "छः अवस्थाओं का उल्लेख किया है"],
    answer: "पाँच अवस्थाओं का उल्लेख किया है"
},
{
    question: "भारतीय समाज में सामाजिक स्तरीकरण का बुनियाद क्या है ?",
    option: ["धन एवं सम्पत्ति", "जाति", "परिवार", "धर्म"],
    answer: "जाति"
},
{
    question: "भारतीय इतिहास के कस काल को भारतीय स्त्री जाति का ‘काला युग’ कहा जाता है ?",
    option: ["ऋग्वैदिक काल", "उत्तर वैदिक काल", "ब्रिटिश काल", "मध्य काल"],
    answer: "मध्य काल"
},
{
    question: "कब वृद्धों के लिए राष्ट्रीय नीति की घोषणा की गई ?",
    option: ["1999 ई. में", "1998 ई. में", "1997 ई. में", "2000 ई. में"],
    answer: "1999 ई. में"
},
{
    question: "निम्न में किस अधिनियम के द्वारा वैवाहिक संबंधों की स्थापना में धर्म तथा जाति के मददों को वैधानिक तौर पर समाप्त किया गया है ?",
    option: ["सती प्रथा निषेध अधिनियम, 1829", "हिन्दू विधवा पुनर्विवाह अधिनियम, 1856", "हिन्दू स्त्रियों का संपति पर अधिकार अधिनियम, 1937", "विशेष विवाह अधिनियम, 1954"],
    answer: "विशेष विवाह अधिनियम, 1954"
},
{
    question: "‘मेहर’ शब्द किस धर्म से संबंधित है ?",
    option: ["हिन्दू", "मुस्लिम", "सिक्ख", "इनमें से कोई नहीं"],
    answer: "मुस्लिम"
},
{
    question: "‘पुनर्जन्म’ की अवधारणा किस धर्म से संबंधित है ?",
    option: ["हिन्दू", "इस्लाम", "ईसाई", "इनमें सभी"],
    answer: "हिन्दू"
},
{
    question: "पिछड़ा वर्ग वित्त व विकास निगम की स्थापना कब की गई ?",
    option: ["1992 ई. में", "2004 ई. में", "1995 ई. में", "2007 ई. में"],
    answer: "1992 ई. में"
},
{
    question: "राष्ट्रीय स्तर पर भारत में कुल कितने समुदायों को अल्पसंख्यकों के रूप में मान्यता दी गई है ?",
    option: ["दस", "आठ", "पाँच", "चार"],
    answer: "पाँच"
},
{
    question: "भारत की कुल जनसंख्या का कितना प्रतिशत हिन्दू हैं ?",
    option: ["82.42 %", "88.42 %", "77.92 %", "66.42 %"],
    answer: "82.42 %"
},
{
    question: "संविधान के किस अनुच्छेद में जनजातियों के लिए नौकरियों में आरक्षण का प्रावधान है ?",
    option: ["335", "244", "341", "15"],
    answer: "335"
},
{
    question: "भारतीय समाज में सामाजिक स्तरीकरण का बुनियादी अधार क्या है ?",
    option: ["धन एवं सम्पत्ति", "जाति", "वंश", "धर्म"],
    answer: "जाति"
},
{
    question: "भारत में किस प्रांत में मुसलमानों की संख्या सर्वाधिक है ?",
    option: ["आंध्र प्रदेश", "केरल", "असम", "कश्मीर"],
    answer: "कश्मीर"
},
{
    question: "निम्नलिखित में से किसको किसी एक जाति को अनुसूचित जाति घोषित करने का अधिकार है ?",
    option: ["भारत के राष्ट्रपति", "राज्य का राज्यपाल", "अनुसूचित जाति आयुक्त", "केन्द्रीय मंत्रीमंडल"],
    answer: "भारत के राष्ट्रपति"
},
{
    question: "संविधान के किस अनुच्छेद द्वारा लोकसभा में अनुसूचित जाति एवं अनुसूचित जनजाति के सदस्यों के लिए सीट का आरक्षण किया गया है ?",
    option: ["अनुच्छेद -330", "अनुच्छेद -332", "अनुच्छेद -320", "अनुच्छेद -338"],
    answer: "अनुच्छेद -330"
},
{
    question: "संविधान के किस अनुच्छेद में अस्पृश्यता निवारण का प्रावधान किया गया है ?",
    option: ["अनुच्छेद -23", "अनुच्छेद -17", "अनुच्छेद–29", "अनुच्छेद–25"],
    answer: "अनुच्छेद -17"
},
{
    question: "अनुसूचित जनजाति को पहले निम्नलिखित में किस नाम से पुकारा जाता था ?",
    option: ["आदिवासी", "जंगली जाति", "वनजाति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में अनुसूचित जातियों जनजातियों के लिए आरक्षण का प्रावधान संविधान के किस धारा में किया गया है ?",
    option: ["धारा 335", "धारा 379", "धारा 369", "धारा 330"],
    answer: "धारा 335"
},
{
    question: "2001 की जनगणना के अनुसार भारत में अनुसूचित जाति की संख्या कितना प्रतिशत है ?",
    option: ["10 प्रतिशत", "13 प्रतिशत", "15 प्रतिशत", "18 प्रतिशत"],
    answer: "15 प्रतिशत"
},
{
    question: "हिन्दू विवाह का उद्देश्य धर्म, प्रजनन, रीति तथा कुछ अन्य दायित्वों का निर्वहन है",
    option: ["पूर्णत: सही है", "आंशिक रूप से सही है", "गलत है", "नहीं कह सकते"],
    answer: "आंशिक रूप से सही है"
},
{
    question: "अनुसूचित जातियों को आरक्षण दिया जाता है, उनकी",
    option: ["गरीबी के संदर्भ में", "आर्थिक आवश्यकताओं के संदर्भ में", "संख्या के संदर्भ में", "निम्न अनुष्ठानिक स्थिति के संदर्भ में"],
    answer: "निम्न अनुष्ठानिक स्थिति के संदर्भ में"
},
{
    question: "किस धर्म में विवाह को एक संविदा माना जाता है ?",
    option: ["हिन्दू", "इस्लाम", "सिख", "पारसी"],
    answer: "इस्लाम"
},
{
    question: "निम्न में से कौन मादक द्रव्य व्यसन एवं मद्यपान का कारण है ?",
    option: ["सुख की इच्छा", "निराशा", "बुरी संगत", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से कौन पिछड़ा वर्ग आयोग के अध्यक्ष थे ?",
    option: ["काका कलेलकर", "कर्पूरी ठाकुर", "धनिकलाल मंडल", "राम मनोहर लोहिया"],
    answer: "काका कलेलकर"
},
{
    question: "सार्वजनिक जीवन में भ्रष्टाचार निम्न में से किस दशा से संबंधित है ?",
    option: ["नैतिक पतन से", "गरीबी से", "मद्यपान से", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से कौन सामाजिक समस्या नहीं है ?",
    option: ["बाल श्रम", "भ्रष्टाचार", "तस्करी", "आधुनिकीकरण"],
    answer: "आधुनिकीकरण"
},
{
    question: "निम्न में से किस वर्ष काम के बदले अनाज योजना शुरू की गई?",
    option: ["1975", "1976", "1977", "1948"],
    answer: "1977"
},
{
    question: "निम्न में से कौन एक अनुसूचित जाति नहीं है ?",
    option: ["मुसहर", "दुसाध", "रजक", "धनुक"],
    answer: "रजक"
},
{
    question: "किस वर्ष संसद में ”तीन तलाक” पास हुआ ?",
    option: ["2016", "2017", "2018", "2019"],
    answer: "2019"
},
{
    question: "किस वर्ष घरेलू हिंसा कानून पास हुआ ?",
    option: ["2005", "2007", "1998", "2009"],
    answer: "2005"
},
{
    question: "संयुक्त राष्ट्र संघ द्वारा अन्तर्राष्ट्रीय महिला दशक कब गया ?",
    option: ["1975-85", "1980-90", "1985-95", "1990-2000"],
    answer: "1975-85"
},
{
    question: "किसने यांत्रिक एकता एवं सावयवी एकता की अवधारणाओं का निरूपण किया है ?",
    option: ["मैक्स वेबर", "पैरेटो", "मर्टन", "दुर्खीम"],
    answer: "दुर्खीम"
},
{
    question: "क्षेत्रवाद की समस्या का मूल कारण है",
    option: ["आर्थिक भिन्नता", "सांस्कृतिक भिन्नता", "जैविकीय भिन्नता", "नैतिक भिन्नता"],
    answer: "आर्थिक भिन्नता"
},
{
    question: "भारत में कितनी भाषाएँ हैं ।",
    option: ["179", "185", "220", "100"],
    answer: "179"
},
{
    question: "भारत में कितनी बोलियाँ हैं ?",
    option: ["200", "444", "344", "544"],
    answer: "200"
},
{
    question: "हिन्दी को राजभाषा का दर्जा प्राप्त हुआ",
    option: ["14 सितम्बर, 1950", "14 सितम्बर 1949", "14 सितम्बर, 1951", "14 सितम्बर 1947"],
    answer: "14 सितम्बर 1949"
},
{
    question: "पंजाब और हरियाणा अलग – अलग राज्य बना",
    option: ["1966 ई. में", "1953 ई. में", "1965 ई. में", "1980 ई. में"],
    answer: "1966 ई. में"
},
{
    question: "भाषा के आधार पर आंध्र प्रदेश की स्थापना कब हुई ?",
    option: ["1955 ई. में", "1953 ई. में", "1952 ई. में", "195 ई. में"],
    answer: "1953 ई. में"
},
{
    question: "भारतीय समाज में ‘अनेकता में एकता’ का सर्वाधिक महत्वपूर्ण आधार है",
    option: ["प्राचीनता", "धार्मिक सहिष्णुता", "मौलिकता", "उपर्युक्त कोई नहीं"],
    answer: "मौलिकता"
},
{
    question: "दिल्ली में सिखों के विरुद्ध दंगा किस वर्ष हुआ था ?",
    option: ["1990", "1992", "1994", "1984"],
    answer: "1984"
},
{
    question: "क्षेत्रवाद, जातिवाद एवं संप्रदायवाद राष्ट्रीय एकीकरण के मार्ग में बाधक है ।",
    option: ["हाँ", "नहीं", "कह नहीं सकते", "इनमें से कोई नहीं"],
    answer: "हाँ"
},
{
    question: "संस्कृतिकरण द्वारा किस प्रकार के परिवर्तन की व्याख्या की जाती है ?",
    option: ["जातीय परिवर्तन", "राजनीतिक परिवर्तन", "धार्मिक परिवर्तन", "व्यावसायिक परिवर्तन"],
    answer: "जातीय परिवर्तन"
},
{
    question: "भारत में राजनीतिक दलों को कौन मान्यता देता है ?",
    option: ["राष्ट्रपति", "उच्चतम न्यायालय", "संसद", "चुनाव आयोग"],
    answer: "चुनाव आयोग"
},
{
    question: "धर्म निरपेक्षता का अर्थ क्या है ?",
    option: ["विभिन्न धर्मों का सह अस्तित्व", "अन्य धर्मों के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना है", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "संस्कृतिकरण की अवधारणा किसने विकसित की ?",
    option: ["एस.सी. दुबे", "एम.एन. श्रीनिवास", "सच्चिदानंद", "योगेन्द्र सिंह"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "सांप्रदायिकता का दुष्परिणाम भारत – पाक विभाजन के रूप में किस वर्ष देखा गया ?",
    option: ["सन् 1945 में", "सन् 1947 में", "सन् 1950 में", "सन् 1952 में"],
    answer: "सन् 1947 में"
},
{
    question: "2006 का मालेगाँव बम विस्फोट काण्ड उदाहरण",
    option: ["क्षेत्रीयता का", "जातिवाद का", "साम्प्रदायिकता का", "इनमें से कोई नहीं"],
    answer: "साम्प्रदायिकता का"
},
{
    question: "भारत में साम्प्रदायिकतावाद का मुख्य कारण कौन है ?",
    option: ["अपराधी मनोवृत्तियाँ", "निर्धनता एवं बेरोजगारी", "राजनीतिक स्वार्थ", "इनमें से कोई"],
    answer: "राजनीतिक स्वार्थ"
},
{
    question: "साम्प्रदायिकता मानव के लिए खतरा है नहीं",
    option: ["सहमत", "असहमत", "विवादास्पद", "इनमें से कोई नहीं"],
    answer: "विवादास्पद"
},
{
    question: "‘क्रियेशन ऑफ पैट्रियारकी’ नामक पुस्तक किसने लिखी है ?",
    option: ["एम.एन. श्रीनिवास", "वाई. सिंह", "बोगार्डस", "जी. लर्नर"],
    answer: "जी. लर्नर"
},
{
    question: "क्षेत्रवाद की समस्या का मुख्य कारण कौन है ?",
    option: ["भाषायी भिन्नताएँ", "सांस्कृतिक भिन्नताएँ", "जैविक भिन्नताएँ", "आर्थिक भिन्नताएँ"],
    answer: "सांस्कृतिक भिन्नताएँ"
},
{
    question: "किसने कहा है कि क्षेत्रीयता, राष्ट्रीयता के अधीन है ?",
    option: ["डॉ. घुरिये", "डॉ. राधाकमल मुखर्जी", "प्रो. बागार्डस", "प्रो. जीटरवर्ग"],
    answer: "डॉ. राधाकमल मुखर्जी"
},
{
    question: "”जातिवाद एक जाति के व्यक्तियों की वह भावना है जो देश या समाज के सामान्य हितों का ख्याल न रखते हुए केवल अपनी जाति के सदस्यों के उत्थान, जातीय एकता और जाति की सामाजिक प्रस्थिति को सुदृढ़ करने हेतु प्रेरित करती हो ।” यह कथन है",
    option: ["डॉ. कैलाशनाथ शर्मा", "के.एम. पन्निकर", "एम.एस. स्वामीनाथन", "बलवन्त राय मेहता"],
    answer: "डॉ. कैलाशनाथ शर्मा"
},
{
    question: "जातिवाद के विकास का प्रमुख कारक है",
    option: ["नगरीकरण", "औद्योगीकरण", "राजनीति", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "पितृसत्तात्मक परिवार में सत्ता या अधिकार किसके हाथ में रहते हैं ?",
    option: ["पुरुष", "स्त्री", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "पुरुष"
},
{
    question: "उड़ीसा के पहाड़ी प्रदेश में रहने वाली जनजाति में पितृसत्तात्मक संयुक्त परिवारों का विशिष्ट विस्तार है ।",
    option: ["भील", "गारो", "खसिया", "संथाल"],
    answer: "खसिया"
},
{
    question: "निम्न में से कौन साम्प्रदायिकता का परिणाम नहीं है ?",
    option: ["परस्पर विश्वास", "राष्ट्रीय एकता में बाधक", "राष्ट्रीय सुरक्षा में बाधक", "पारस्परिक तनाव"],
    answer: "परस्पर विश्वास"
},
{
    question: "भारत की राष्ट्रीय भाषा कौन है ?",
    option: ["तेलगू", "अंग्रेजी", "मराठी", "हिन्दी"],
    answer: "हिन्दी"
},
{
    question: "निम्न में से कौन मानव तस्करी का कारण है ?",
    option: ["अंगों का निष्कर्षण", "वेश्यावृत्ति", "बलात् विवाह", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से कौन भारतीय समाज की विशेषता है ?",
    option: ["धार्मिक कट्टरता", "सामाजिक गतिशीलता", "व्यक्तिगत सम्पत्ति", "अनेकता में एकता"],
    answer: "अनेकता में एकता"
},
{
    question: "भारत में निम्न में से कौन कारक राष्ट्रीय एकता में बाधक है ?",
    option: ["जातिवाद", "क्षेत्रवाद", "धर्मान्धता", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से किसे द्वितीयक क्षेत्र में रखा जाता है ?",
    option: ["कृषि", "व्यापार", "सेवा", "उद्योग"],
    answer: "उद्योग"
},
{
    question: "रेल यातायांत किस श्रेणी के अन्तर्गत रखा गया है ?",
    option: ["द्वितीय", "तृतीय", "चतुर्थ", "प्रथम"],
    answer: "प्रथम"
},
{
    question: "रासायनिक खाद किस श्रेणी में रखा गया है ?",
    option: ["प्रथम", "द्वितीय", "तृतीय", "चतुर्थ"],
    answer: "द्वितीय"
},
{
    question: "लघु उद्योग में अधिकतम निवेश कितना करोड़ है ।",
    option: ["दो", "चार", "पाँच", "एक"],
    answer: "एक"
},
{
    question: "औद्योगिक नीति के अनुसार भारतीय उद्योगों को कितने श्रेणी में बाँटा गया है ?",
    option: ["चार", "पाँच", "तीन", "सात"],
    answer: "तीन"
},
{
    question: "जिसके स्वामित्व और प्रबंध तथा स्थापना एवं विकास का दायित्व पूर्णरूप से केन्द्रीय सरकार को सौंपा गया है, उसे किस श्रेणी में रखा गया है ?",
    option: ["प्रथम", "द्वितीय", "तृतीय", "चतुर्थ"],
    answer: "प्रथम"
},
{
    question: "किस दशक में राष्ट्रीय और अन्तर्राष्ट्रीय स्तर पर उद्योगों के विकास पर बल दिया गया ?",
    option: ["1950 के दशक में", "1960 के दशक में", "1970 के दशक में", "इनमें से कोई नहीं"],
    answer: "1960 के दशक में"
},
{
    question: "भारत के औद्योगीकरण के विकास हेतु कार्य – योजना में किस बात पर बल दिया गया ?",
    option: ["महानगरों में आबादी से हटकर औद्योगिक इकाइयों का निर्माण", "औद्योगिक कचरा निस्तारण हेतु संयंत्रों को लगाने की अनिवार्यता", "प्रदूषण नियंत्रण हेतु उचित प्रावधान", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में स्पष्ट रूप से उदारीकरण की प्रक्रिया का आरम्भ किसके शासनकाल में हुआ ?",
    option: ["चन्द्रशेखर", "वी.पी. सिंह", "नरसिम्हा राव", "अटल बिहारी वाजपेयी"],
    answer: "नरसिम्हा राव"
},
{
    question: "उदारीकरण की प्रक्रिया के प्रभावस्वरूप आर्थिक क्षेत्र में कौन – सा सुधार हुआ ?",
    option: ["औद्योगिक उत्पादन में तीव्र वृद्धि", "उत्पादों की गुणवत्ता में सुधार", "प्रत्यक्ष विदेशी निवेश को बढ़ावा", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में उदारीकरण की प्रक्रिया अपनाये जाने पर कौन – सी चुनौती सामने आयी ?",
    option: ["परम्परागत लघु उद्योगों का ह्रास", "बेकारी ( बेजोजगारी ) में वृद्धि", "ऋणगस्तता में वृद्धि", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारतीय अर्थव्यवस्था का मॉडल किस प्रकार का है ?",
    option: ["पूँजीवादी", "मिश्रित", "समाजवादी", "साम्यवादी"],
    answer: "मिश्रित"
},
{
    question: "भारत में उदारीकरण की प्रक्रिया का प्रारम्भ कब से माना जाता है ?",
    option: ["1961", "1971", "1981", "1991"],
    answer: "1991"
},
{
    question: "इनमें से कौन उदारीकरण की देन है ?",
    option: ["बाजारवाद", "वैश्वीकरण", "निजीकरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से कौन औद्योगीकरण का सामाजिक परिणाम है ?",
    option: ["संयुक्त परिवार का विघटन", "महिलाओं को रोजगार", "जाति प्रथा का निर्बल होना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "किस दिन अंतर्राष्ट्रीय औषधि दुरुपयोग एवं अनैतिक व्यापार निरोधक दिवस मनाया जाता है ?",
    option: ["26 जून", "27 जून", "05 जून", "11 जून"],
    answer: "26 जून"
},
{
    question: "किस वर्ष बिहार में पूर्ण नशाबंदी कानून लागू हुआ ?",
    option: ["2015", "2016", "2017", "2018"],
    answer: "2016"
},
{
    question: "किस प्रधानमंत्री के कार्यकाल में “एण्टी नारकोटिक एक्ट” पास हुआ ?",
    option: ["राजीव गाँधी", "वी०पी० सिंह", "इन्दिरा गाँधी", "अटल बिहारी वाजपेई"],
    answer: "राजीव गाँधी"
},
{
    question: "निम्न में से किसको नगरीकरण बढ़ावा देती है ?",
    option: ["गुमनामता", "प्रदूषण", "‘मैं’ की भावना", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "संस्कृतिकरण की अवधारणा किसने विकसित की ?",
    option: ["एस० सी० दूबे", "एम० एन० श्रीनिवास", "सच्चिदानंद सिन्हा", "योगेन्द्र सिंह"],
    answer: "एम० एन० श्रीनिवास"
},
{
    question: "धर्म निरपेक्षता का क्या अर्थ है ?",
    option: ["विभिन्न धर्मों का सह-अस्तित्व", "अन्य धर्मों के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से किसे द्वितीयक क्षेत्र में रखा जाता है ?",
    option: ["कृषि", "व्यापार", "सेवा", "उद्योग"],
    answer: "उद्योग"
},
{
    question: "समेकित ग्रामीण विकास कार्यक्रम कब प्रारंभ हुआ ?",
    option: ["1960-61", "1965-66", "1977-78", "1991-92"],
    answer: "1960-61"
},
{
    question: "किसने कहा “नगरीयता एक जीवन पद्धति",
    option: ["रौस", "बर्गल", "विर्थ", "कारपेन्टर"],
    answer: "विर्थ"
},
{
    question: "कब सती प्रथा निषेध अधिनियम पारित हुआ ?",
    option: ["सन् 1825 ई०", "सन् 1859 ई०", "सन् 1832 ई०", "सन् 1835 ई०"],
    answer: "सन् 1832 ई०"
},
{
    question: "आर्य समाज की स्थापना कब हुई ?",
    option: ["1875", "1879", "1882", "1884"],
    answer: "1875"
},
{
    question: "स्त्रियों व कन्याओं का अनैतिक व्यापार अधिनियम कब पारित हुआ ?",
    option: ["सन् 1952", "सन् 1954", "सन् 1956", "सन् 1960"],
    answer: "सन् 1956"
},
{
    question: "गाँव से लोगों का शहर की ओर आना और शहरी मूल्यों को अपनाने को क्या कहते हैं ?",
    option: ["औद्योगिकीकरण", "नगरीकरण", "संस्कृतीकरण", "पश्चिमीकरण"],
    answer: "नगरीकरण"
},
{
    question: "किसने कहा कि, “केवल उत्पादन में होने वाली वृद्धि और प्रति व्यक्ति आय में वृद्धि होना आधुनिकीकरण नहीं है ?",
    option: ["एम० एन० श्रीनिवास", "एस० सी० दुबे", "डॉ० योगेन्द्र सिंह", "डॉ० पी० सिंहा"],
    answer: "एस० सी० दुबे"
},
{
    question: "‘सोशल चेंज इन मॉडर्न इंडिया’ नामक के लेखक कौन हैं ?",
    option: ["श्रीनिवास", "घुरिये", "कॉम्ट", "योगेन्द्र सिंह"],
    answer: "श्रीनिवास"
},
{
    question: "ब्राह्मणीकरण की अवधारणा किनके द्वारा दी गई है ?",
    option: ["श्रीनिवास", "हेतुकर झा", "सच्चिदानंद", "इनमें से कोई नहीं"],
    answer: "श्रीनिवास"
},
{
    question: "धर्म-निरपेक्षीकरण की प्रक्रिया किस विचार को अधिक प्रभावित करता है ?",
    option: ["पवित्रता", "अपवित्रता", "पवित्रता व अपवित्रता", "इनमें से कोई नहीं"],
    answer: "इनमें से कोई नहीं"
},
{
    question: "सूचना का अधिकार अधिनियम कब से लागू हुआ ?",
    option: ["15 जून, 2005 ई० से", "15 जून, 2006 ई० से", "15 अक्टूबर, 2005 ई० से", "15 अक्टूबर, 2006 ई० से"],
    answer: "15 अक्टूबर, 2006 ई० से"
},
{
    question: "ग्रामीण से नगरीय क्षेत्र में रूपांतरित होने वाला पहला देश कौन है ?",
    option: ["ब्रिटेन", "अमेरिका", "फ्रांस", "कनाडा"],
    answer: "ब्रिटेन"
},
{
    question: "“मॉडनाइजेशन ऑफ इंडियन ट्रेडिशन” नामक पुस्तक किसने लिखी है ?",
    option: ["एम० एस० राव", "रवीन्द्रनाथ मुखर्जी", "योगेन्द्र सिंह", "एम० एन० श्रीनिवास"],
    answer: "योगेन्द्र सिंह"
},
{
    question: "“अर्बनाइजेशन ऐन्ड सोशल चेन्ज” नामक पुस्तक किसने लिखी है ?",
    option: ["बर्गेल", "एम० एस० राव", "एन्डसन", "सोरोकन"],
    answer: "एम० एस० राव"
},
{
    question: "औद्योगिकीकरण के फलस्वरूप नगरों में किस तरह का प्रदूषण उत्पन्न हुआ है ?",
    option: ["जल प्रदूषण", "वायु प्रदूषण", "ध्वनि प्रदूषण", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "दहेज निरोधक अधिनियम कब पारित किया गया ?",
    option: ["1960", "1961", "1970", "1962"],
    answer: "1961"
},
{
    question: "आर्य समाज के संस्थापक कौन थे ?",
    option: ["राजाराम मोहन राय", "गोविन्द राणाडे", "दयानन्द सरस्वती", "नारायण जोशी"],
    answer: "दयानन्द सरस्वती"
},
{
    question: "भारत में किसने सर्वप्रथम सतीप्रथा के विरुद्ध आवाज उठाई थी ?",
    option: ["ईश्वरचन्द्र विद्यासागर", "महात्मा गाँधी", "राजाराम मोहन राय", "ऐनी बेसेन्ट"],
    answer: "राजाराम मोहन राय"
},
{
    question: "बाल विवाह निरोधक अधिनियम किस साल लागू हुआ ?",
    option: ["1929", "1939", "1910", "1925"],
    answer: "1929"
},
{
    question: "किसने कहा “ग्रामीण क्षेत्रों का नगरीय क्षेत्रों में बदलने की प्रक्रिया को हम नगरीकरण कहेंगे” ?",
    option: ["श्रीनिवास", "बर्गल", "फेयरचाइल्ड", "थॉमसन"],
    answer: "बर्गल"
},
{
    question: "संस्कृतिकरण की प्रक्रिया के अनुसारनिम्न जातियाँ किस जाति के व्यवहारों का अनुसरण करती हैं?",
    option: ["ब्राह्मण जाति", "द्विज जाति", "प्रभु जाति", "उच्च जाति"],
    answer: "द्विज जाति"
},
{
    question: "“नगरीयता जीवन का एक तरीका है जबकि नगरीकरण एक प्रक्रिया है।” किसने कहा है ?",
    option: ["गाल्पिन", "वर्थ", "वर्गेस", "होमर हियोट"],
    answer: "वर्थ"
},
{
    question: "भारत में लौकिकीकरण किसकी देन है ?",
    option: ["अमेरिकी", "फ्रांसीसी", "अंग्रेज", "पुर्तगाली"],
    answer: "अमेरिकी"
},
{
    question: "आधुनिकीकरण को समाज की संरचना में परिवर्तन लाने वाली एक महत्त्वपूर्ण प्रक्रिया के रूप में किसने स्पष्ट किया है ?",
    option: ["जार्ज साइमन", "एम० एन० श्रीनिवास", "डेनियल लर्नर", "डा० योगेन्द्र सिंह"],
    answer: "डेनियल लर्नर"
},
{
    question: "औद्योगिक समाज में परिवार किस प्रकार की इकाई है?",
    option: ["आर्थिक", "उपयोग", "उत्पादन", "लाभ"],
    answer: "उपयोग"
},
{
    question: "वास्तव में संस्कृतीकरण किस अवधारणाओं को स्पष्ट करता है ?",
    option: ["ब्राह्मणीकरण", "पर संस्कृतीकरण", "अग्रिम समाजीकरण एवं अनुकरण", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "पश्चिमीकरण के कारण समाज में किस वर्ग का उदय हुआ ?",
    option: ["उच्च वर्ग", "निम्न वर्ग", "मध्य एवं व्यापारी वर्ग", "इनमें से कोई नहीं"],
    answer: "उच्च वर्ग"
},
{
    question: "गरिकीकरण सबसे ज्यादा कहाँ हुआ ?",
    option: ["झारखंड", "छत्तीसगढ़", "उत्तराखंड", "महाराष्ट्र"],
    answer: "महाराष्ट्र"
},
{
    question: "किस उद्योग के आरंभ होने को औद्योगिक क्रांति की उत्पत्ति मानी जाती है ?",
    option: ["स्टील उद्योग", "बुनाई उद्योग", "चमड़ा उद्योग", "तेल उद्योग"],
    answer: "चमड़ा उद्योग"
},
{
    question: "कब औद्योगिक क्रान्ति का सूत्रपात हुआ ?",
    option: ["1765", "1766", "1767", "1769"],
    answer: "1767"
},
{
    question: "भारत में औद्योगिकीकरण का इतिहास किस शताब्दी से आरंभ होता है ?",
    option: ["अठारहवीं शताब्दी", "उन्नीसवीं शताब्दी", "बीसवीं शताब्दी", "इक्कीसवीं शताब्दी"],
    answer: "बीसवीं शताब्दी"
},
{
    question: "किस संपदा के आधार पर भारत बड़ा औद्योगिक देश बन सकता है ?",
    option: ["जन संपदा", "प्राकृतिक संपदा", "जन व प्राकृतिक संपदा", "इनमें कोई नहीं"],
    answer: "जन संपदा"
},
{
    question: "विद्वानों ने आधुनिकीकरण को किस शब्द का पर्यायवाची माना है ?",
    option: ["औद्योगिकीकरण", "नगरीकरण", "पश्चिमीकरण", "इनमें से कोई नही"],
    answer: "इनमें से कोई नही"
},
{
    question: "इनमें से आधुनिकीकरण की विशेषता है",
    option: ["गतिशीलता", "हितों का एकत्रीकरण", "अधिक सहभागिता", "इनमें कोई नहीं"],
    answer: "अधिक सहभागिता"
},
{
    question: "आधुनिकीकरण की प्रेरणा से प्रेरित होने पर समाज में कितने प्रकार की अवस्थाएँ उत्पन्न होती है ?",
    option: ["तीन", "दो", "चार", "एक"],
    answer: "एक"
},
{
    question: "नगरीकरण के कारक हैं",
    option: ["औद्योगिक विकास", "व्यावसायिक गतिशीलता", "भौतिकवादी संस्कृति", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "बड़े नगरीय क्षेत्र के निकाय को कहा जाता",
    option: ["नगर पंचायत", "नगर परिषद", "नगर निगम", "इनमें से कोई नहीं"],
    answer: "नगर निगम"
},
{
    question: "विद्वान ने किसकी गतिशीलता व्यक्त करने के लिए संस्कृतिकरण का उपयोग किया ?",
    option: ["वर्ग की गतिशीलता", "जाति की गतिशीलता", "जाति व वर्ग दोनों की गतिशीलता", "इनमें से कोई नहीं"],
    answer: "जाति व वर्ग दोनों की गतिशीलता"
},
{
    question: "निम्नलिखित में से कौन-सी- एक दशा औद्योगिक समाज की विशेषता नहीं है ?",
    option: ["हस्तशिल्प का विकास", "बड़ी मात्रा में उत्पादन", "व्यक्तिगत लाभ की प्रवृत्ति", "नयी प्रौद्योगिकी का उपयोग"],
    answer: "हस्तशिल्प का विकास"
},
{
    question: "निम्नलिखित में से किस एक लेखक ने भारत में सामाजिक परिवर्तन की प्रक्रियाओं का विस्तृत वर्णन प्रस्तुत किया ?",
    option: ["पी० एच० प्रभु", "के० एम० कापड़िया", "इरावती कर्वे", "एम० एन० श्रीनिवास"],
    answer: "एम० एन० श्रीनिवास"
},
{
    question: "भारत में कौन-सी एक दशा उपनिवेशवाद का परिणाम है ?",
    option: ["समाज सुधार आंदोलन का प्रारंभ", "परिवहन के साधनों का आरंभ", "वैज्ञानिक शिक्षा का आरंभ", "धर्मांतरण का आरंभ"],
    answer: "वैज्ञानिक शिक्षा का आरंभ"
},
{
    question: "निम्नलिखित में से कौन-सी एक दशा भारत में नगरीकरण का परिणाम नहीं है ?",
    option: ["एकांकी परिवारों में वृद्धि", "अनौपचारिक संबंधों में वृद्धि", "स्त्रियों की दशा में सुधार", "जातिगत विभेदों में कमी"],
    answer: "अनौपचारिक संबंधों में वृद्धि"
},
{
    question: "उपनिवेशवाद किस दशा का परिणाम है ?",
    option: ["साम्यवाद", "समाजवाद", "साम्राज्यवाद", "प्रजातिवाद"],
    answer: "साम्राज्यवाद"
},
{
    question: "औद्योगीकरण के फलस्वरूप नगरों में किस तरह का प्रदूषण उत्पन्न हुआ ?",
    option: ["जल प्रदूषण", "वायु प्रदूषण", "ध्वनि प्रदूषण", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "भारत के निम्न में से किस राज्य में नगरीकरण की मात्रा सर्वाधिक है ?",
    option: ["बिहार", "पश्चिम बंगाल", "झारखंड", "मध्यप्रदेश –"],
    answer: "पश्चिम बंगाल"
},
{
    question: "वर्ग व्यवस्था परिणाम है",
    option: ["सामाजिक संघर्ष का", "बेरोजगारी का", "वर्ण-व्यवस्था का", "औद्योगीकरण का"],
    answer: "औद्योगीकरण का"
},
{
    question: "धर्म निरपेक्षता का अर्थ क्या है ?",
    option: ["विभिन्न धर्मों का सह-अस्तित्व", "अन्य धर्मों के प्रति श्रद्धा", "राज्य का अपना कोई धर्म न होना", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "भारत में पंचवर्षीय योजना कब आरंभ की गई ?",
    option: ["1950", "1951", "1952", "1954"],
    answer: "1952"
},
{
    question: "एम० एन० श्रीनिवास ने अपनी पुस्तक ‘Social change in Modern India’ में निम्नलिखित में से कौन-सा मत प्रस्तुत किया है ?",
    option: ["जाति पूर्णतः बंद व्यवस्था है", "जाति पूर्णतः खुली व्यवस्था है", "जाति व्यवस्था में गतिशीलता का अवसर निहित है", "जाति वेग की तरह होती है"],
    answer: "जाति व्यवस्था में गतिशीलता का अवसर निहित है"
},
{
    question: "धर्म निरपेक्षीकरण भारत में किसे प्रभावित करती है ?",
    option: ["हिन्दू को", "मुस्लिम को", "आदिवासी को", "सभी नागरिकों को"],
    answer: "आदिवासी को"
},
{
    question: "दहेज उन्मूलन संशोधन अधिनियम कब पारित हुआ ?",
    option: ["1975", "1984", "1990", "1961"],
    answer: "1961"
},
{
    question: "शारदा एक्ट किस वर्ष पारित किया गया ?",
    option: ["1928", "1929", "1930", "1931"],
    answer: "1929"
},
{
    question: "निम्नलिखित में कौन-सा कारण भारतीय नारियों की स्थिति में सुधार के लिए उत्तरदायी है ?",
    option: ["संवैधानिक सुविधाएँ", "शिक्षा का प्रसार", "अन्तर्जातीय विवाह", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "अस्पृश्यता (अपराध) अधिनियम कब पारित हुआ ?",
    option: ["1953", "1954", "1955", "1956"],
    answer: "1955"
},
{
    question: "भारतीय समाज में स्त्रियों की दयनीय स्थिति पर किसने सर्वप्रमुख कार्य किया हैं ?",
    option: ["राजा राममोहन राय", "स्वामी दयानन्द सरस्वती", "ईश्वरचन्द्र विद्यासागर", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "किस वर्ष स्त्रियों को अपने पति से भरण-पोषण की राशि प्राप्त करने का अधिकार दिया गया ?",
    option: ["1936 ई०", "1946 ई०", "1856 ई०", "1966 ई०"],
    answer: "1946 ई०"
},
{
    question: "आर्थिक शोषण के विरुद्ध स्त्रियों की दशा सुधारने के लिए समान वेतन अधिनियम’ कब पारित हुआ ?",
    option: ["सन् 1974", "सन् 1976", "सन् 1978", "सन् 1980"],
    answer: "सन् 1976"
},
{
    question: "ब्रह्म समाज की स्थापना किसने की ?",
    option: ["बाल गंगाधर तिलक", "राजा राममोहन राय", "महात्मा गाँधी", "ईश्वरचंद्र विद्यासागर"],
    answer: "राजा राममोहन राय"
},
{
    question: "भारत के लिए खतरनाक है-",
    option: ["सांप्रदायिकता", "क्षेत्रीयता", "जातीयता", "सभी"],
    answer: "सभी"
},
{
    question: "सामाजिक परिवर्तन का तात्पर्य है –",
    option: ["सामाजिक संबंधों में परिवर्तन", "सामाजिक समूहों में परिवर्तन", "सामाजिक अन्तः क्रियाओं में परिवर्तन", "उपरोक्त सभी"],
    answer: "सामाजिक संबंधों में परिवर्तन"
},
{
    question: "डेन्जरस ड्रग्स एक्ट किस वर्ष में पारित किया गया ?",
    option: ["1930", "1931", "1938", "1933"],
    answer: "1930"
},
{
    question: "मध्याह्न भोजन कहाँ लागू हुआ ?",
    option: ["स्कूल", "कॉलेज", "ऑफिस", "उपर्युक्त सभी"],
    answer: "स्कूल"
},
{
    question: "भारत में किस वर्ष प्रधानमंत्री रोजगार योजना शुरू की गयी ?",
    option: ["1993", "1994", "2011", "2009"],
    answer: "1993"
},
{
    question: "किस वर्ष बालिका समृद्धि योजना की शुरूआत की गई ?",
    option: ["1997", "1998", "1999", "1986"],
    answer: "1997"
},
{
    question: "किस वर्ष बाल श्रम पर एक राष्ट्रीय नीति बनाई गई ।",
    option: ["1987", "1991", "1948", "1952"],
    answer: "1987"
},
{
    question: "भारत में किस वर्ष समेकित बाल विकास सेवा कार्यक्रम प्रारंभ किया गया ?",
    option: ["1975", "1974", "2011", "1985"],
    answer: "1975"
},
{
    question: "“आधुनिक भारत में सामाजिक परिवर्तन’ नामक पुस्तक के लेखक कौन हैं ?",
    option: ["एम० एन० श्रीनिवास", "आर० के० मुखर्जी", "डी० पी० मुखर्जी", "एस० सी० दूबे नर"],
    answer: "एम० एन० श्रीनिवास"
},
{
    question: "’डी०ए० केस’ किस अपराध से संबंधित है ?",
    option: ["हत्या", "बलात्कार", "आप से अधिक सम्पत्ति", "चोरी"],
    answer: "आप से अधिक सम्पत्ति"
},
{
    question: "‘विशेष विवाह अधिनियम’ किस साल पारित हुआ ?",
    option: ["1954", "1956", "1961", "1972"],
    answer: "1954"
},
{
    question: "नगरीय पर्यावरण का सामाजिक जीवन पर निम्न में से कौन प्रभाव नहीं है ?",
    option: ["अपराध", "व्यक्तिवादिता में वृद्धि", "प्रदूषण में कमी", "आवास की समस्या में वृद्धि"],
    answer: "प्रदूषण में कमी"
},
{
    question: "श्रीनिवास ने पश्चिमीकरण की प्रक्रिया के मॉडल के रूप में से निम्न में से किसे आधार माना ?",
    option: ["नयी प्रौद्योगिकी", "आधुनिकीकरण", "शिक्षण संस्थायें", "150 वर्ष के ब्रिटिश शासन"],
    answer: "150 वर्ष के ब्रिटिश शासन"
},
{
    question: "भारत में संस्कृततिकरण को प्रोत्साहित करने वाली दशायें कौन सी है ?",
    option: ["संस्कृति की शिक्षा", "महिला आन्दोलन", "औद्योगीकरण व नगरीकरण", "जनजातीय आन्दोलन"],
    answer: "औद्योगीकरण व नगरीकरण"
},
{
    question: "निम्न में से कौन भारत में औपनिवेशिक शासन के लिए उत्तरदायी है ?",
    option: ["ईस्ट इंडिया कम्पनी", "वारेन हस्टिंग्स", "लार्ड क्लाइव", "इनमें से सभी"],
    answer: "ईस्ट इंडिया कम्पनी"
},
{
    question: "हिन्दू उत्तराधिकार अधिनियम को किस वर्ष संशोधित कर पुत्रियों को पुत्र के समान पैतृक सम्पत्ति में समान अधिकार दिया गया ?",
    option: ["1956", "2005", "1985", "2010"],
    answer: "2005"
},
{
    question: "पश्चिमीकरण को किस तरह की अवधारणा माना जाता है ?",
    option: ["तटस्थ अवधारणा", "यूरोपीय अवधारणा", "भौतिक अवधारणा", "क्षेत्रीय अवधारणा"],
    answer: "तटस्थ अवधारणा"
},
{
    question: "किसने कहा कि नगरीकरण ही आधुनिकीकरण का प्रथम चरण है ?",
    option: ["मैकाईवर", "लर्नर", "श्रीनिवास", "बर्गल"],
    answer: "श्रीनिवास"
},
{
    question: "निम्न में से कौन धर्म का प्रकार्य नहीं है ?",
    option: ["सामाजिक संगठन में बाधक", "सामाजिक नियंत्रण का साधन", "सामाजिक संगठन में सहायक", "सर्व कल्याण में सहायक"],
    answer: "सामाजिक संगठन में बाधक"
},
{
    question: "जब कोई निम्न जाति या जनजाति किसी उच्च जाति की दिशा में अपनी जीवन पद्धति को बदलती है, तो उसे क्या कहते",
    option: ["संस्कृतिकरण", "आधुनिकीकरण", "पश्चिमीकरण", "धर्म निरपेक्षीकरण"],
    answer: "संस्कृतिकरण"
},
{
    question: "भारत में निम्न में से किस राज्य में नगरीकरण की मात्रा सर्वाधिक",
    option: ["बिहार", "पश्चिम बंगाल", "झारखंड", "मध्य प्रदेश"],
    answer: "मध्य प्रदेश"
},
{
    question: "किसने कहा– “नगरीयता एक जीवन पद्धति है” ?",
    option: ["रॉस", "बर्गल", "विर्थ", "कारपेंटर"],
    answer: "बर्गल"
},
{
    question: "1995 ई. में भारत में मलिन बस्तियों में रहने वाले लोगों की संख्या कितनी थी ?",
    option: ["250 लाख", "450 लाख", "300 लाख", "500 लाख"],
    answer: "450 लाख"
},
{
    question: "वर्तमान स्थिति में किसी भी प्रकार के और किसी भी स्तर के बदलाव को कहते हैं",
    option: ["परिवर्तन", "मौसमी प्रवसन", "नगरीकरण", "मलिन बस्तियाँ"],
    answer: "परिवर्तन"
},
{
    question: "यूरोप और अमेरिका की सभ्यताओं से होने वाले परिवर्तन को कहते हैं",
    option: ["उपनिवेशवाद", "मौसमी प्रवसन", "पश्चिमीकरण", "औद्योगिकीकरण"],
    answer: "पश्चिमीकरण"
},
{
    question: "“सामाजिक परिवर्तन से तात्पर्य सामाजिक ढाँचे के परिवर्तन से है” यह कथन किसका था ?",
    option: ["जॉनसन", "गिलिन तथा गिलिन", "डॉ. मजूमदार", "मैकाइवर तथा पेज"],
    answer: "जॉनसन"
},
{
    question: "भारत में औद्योगिकीकरण लगभग कितना वर्ष पुराना है ?",
    option: ["200 वर्ष", "300 वर्ष", "400 वर्ष", "100 वर्ष"],
    answer: "100 वर्ष"
},
{
    question: "“ज्ञान उपयोगी और व्यावहारिक होना चाहिए।” यह कथन किसका है ?",
    option: ["एडम स्मिथ", "आई.बी. शर्मा", "स्टीबेन्सन", "बेलार्ड"],
    answer: "आई.बी. शर्मा"
},
{
    question: "प्रोजेक्ट वास्तविक जीवन पर एक भाग है जिसका प्रयोग विद्यालय में किया जाता है। यह कथन है",
    option: ["बेलाई", "किलपैट्रिक", "स्टीबेन्सन", "रॉबर्ट बीरस्टीक"],
    answer: "बेलाई"
},
{
    question: "भारतीय संविधान के किस अनुच्छेद के अंतर्गत अनुसूचित जातियों को अपनी संस्कृति और भाषा बनाये रखने के लिए संरक्षण प्रदान किया गया है ?",
    option: ["धारा 16", "धारा 29", "धारा 42", "धारा 46"],
    answer: "धारा 29"
},
{
    question: "प्रोजेक्ट एक समस्यामूलक कार्य है जो अपनी स्वाभाविक परिस्थितियों में पूर्णता को प्राप्त करता है",
    option: ["आई.बी. वर्मा", "स्टीबेन्सन", "किल पैट्रिक", "बेवार्ड"],
    answer: "किल पैट्रिक"
},
{
    question: "यह कथन किसका है कि “प्रोजेक्ट वह उद्देश्यपूर्ण कार्य है जो पूर्ण संलग्नता में सामाजिक वातावरण में किया जाता है।”",
    option: ["किल पैट्रिक", "सी.एच. कूले", "एस.बी. केतकर", "मजूमदार और मान"],
    answer: "किल पैट्रिक"
},
{
    question: "शहरीकरण का लक्षण है",
    option: ["व्यापार में विकास", "एक शहर के चारों ओर केन्द्रों का विकास", "ग्रामीण से शहरी प्रवसन", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में से किसको नगरीकरण बढ़ावा देती है ?",
    option: ["गुमनामिता", "भीड़", "प्रदूषण", "उपरोक्त सभी"],
    answer: "उपरोक्त सभी"
},
{
    question: "निम्न में से कौन सी जनजाति उत्तरी–पूर्वी भारत की नहीं है ?",
    option: ["नागा", "कूकी", "बोडा", "खस"],
    answer: "खस"
},
{
    question: "‘सोशल चेंज इन मॉडर्न इण्डिया’ नाम पुस्तक के लेखक हैं ?",
    option: ["मजूमदार एवं मदान", "आर.के. मुखर्जी", "एम.एन. श्रीनिवास", "मैकाइवर एवं पेज"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "“आधुनिकीकरण एक प्रक्रिया है, जो परम्परागत समाज से प्रौद्योगिकी पर आधारित समाज की ओर अग्रसर होती है।” उक्त परिभाषा दी है",
    option: ["रिटजर", "एस.सी. दुबे", "एम.एस. गोरे", "इनमें से कोई नहीं"],
    answer: "एस.सी. दुबे"
},
{
    question: "निम्न में से आधुनिकीकरण का लक्षण है",
    option: ["औद्योगिकीकरण को प्रोत्साहन", "नवीन तकनीकी का प्रयोग", "संचार व यातायात के साधनों में वृद्धि", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "संविधान के किस अनुच्छेद के अनुसार राज्य के नागरिकों के साथ जाति, धर्म, वंश अथवा जन्मस्थान आदि के आधार पर विभेद नहीं किया जायेगा ?",
    option: ["अनुच्छेद 14", "अनुच्छेद 38", "अनुच्छेद 9", "अनुच्छेद 15"],
    answer: "अनुच्छेद 15"
},
{
    question: "“आधुनिकता एक ऐसा बेलगाम घोड़ा है। जिसे किसी भी तरह नियंत्रण में रखना कठिन है” ऐसा किसने कहा ?",
    option: ["रिटजर", "गोरे", "श्याम चरण दूबे", "बी.पी. शाह"],
    answer: "रिटजर"
},
{
    question: "वह कौन–सी प्रक्रिया है जिसके अन्तर्गत कोई भी जाति, जनजाति या समूह अपने से उच्च जाति (प्रायः द्विज जाति) के रीति–रिवाजों, कर्मकाण्ड, विचारधारा और मूल्यों को अपनाकर समाज में अपनी जातीय स्थिति को ऊपर उठाने का प्रयास करती है ?",
    option: ["आधुनिकीकरण", "संस्कृतीकरण", "धर्मनिरपेक्षीकरण", "पश्चिमीकरण"],
    answer: "संस्कृतीकरण"
},
{
    question: "निम्नलिखित में से धर्मनिरपेक्षीकरण की प्रक्रिया का प्रमुख तत्व है",
    option: ["विभेदीकरण में वृद्धि", "धार्मिकता का हास", "तार्किकता में वृद्धि", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "“परिवर्तन की यह प्रक्रिया जो भारतीय जनजीवन, समाज व संस्कृति के विभिन्न पक्षों में उस पश्चिमी संस्कृति के सम्पर्क में आने के कारण उत्पन्न हुई, जिसे ब्रिटिश शासक अपने साथ लाये थे।” यह प्रक्रिया कहलाती है–",
    option: ["पश्चिमीकरण", "औद्योगीकरण", "नगरीकरण", "आधुनिकीकरण"],
    answer: "पश्चिमीकरण"
},
{
    question: "आधुनिक भारत में प्रौद्योगिक विभाजन होता जा रहा है, ऐसा कौन कहा ?",
    option: ["श्रीनिवास", "डॉ. श्यामचरण दूबे", "योगेन्द्र", "इनमें से कोई नहीं"],
    answer: "श्रीनिवास"
},
{
    question: "द टेक्नोलॉजीकल सोसायटी नामक पुस्तक किसने लिखा था ?",
    option: ["श्रीनिवासन", "योगेन्द्र सिंह", "जेक्यूल ईल्लल", "इनमें से कोई नहीं"],
    answer: "जेक्यूल ईल्लल"
},
{
    question: "आधुनिकीकरण सम्बन्धित है",
    option: ["परम्परागत मूल्य से", "बन्द सामाजिक व्यवस्था से", "अर्जित प्रस्थिति से", "प्रथा से"],
    answer: "अर्जित प्रस्थिति से"
},
{
    question: "पश्चिमीकरण की अवधारणा किसके द्वारा दी गई है ?",
    option: ["आगबर्न", "एम.एन. श्रीनिवास", "मैकाइवर", "आर.के. मुखर्जी"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "ब्राह्मणीकरण की अवधारणा किसने विकसित की ?",
    option: ["एम.एन. श्रीनिवास", "ए.आर. देसाई", "एस.सी. दुबे", "जी.एस. घुरिये"],
    answer: "एम.एन. श्रीनिवास"
},
{
    question: "संस्कृतीकरण की प्रक्रिया के अनुसार निम्न जातियाँ किस जाति के व्यवहारों का अनुसरण करती है ?",
    option: ["ब्राह्मण", "द्विज जाति", "प्रभु जाति", "उच्च जाति"],
    answer: "उच्च जाति"
},
{
    question: "परसंस्कृति का सम्बन्ध है",
    option: ["स्वास्थ्य से", "अर्थव्यवस्था से", "संस्कृति से", "कृषि से"],
    answer: "संस्कृति से"
},
{
    question: "निम्न में से कौन भारत में सामाजिक परिवर्तन का कारक नहीं है ?",
    option: ["संस्कृतिकरण", "पश्चिमीकरण", "परम्परा", "औद्योगीकरण एवं नगरीकरण"],
    answer: "परम्परा"
},
{
    question: "‘संस्कृतिकरण’ की अवधारणा किसने प्रतिपादित किया?",
    option: ["एस.सी. दूबे", "एम. एन. श्रीनिवास", "योगेन्द्र सिंह", "के.एल. शर्मा"],
    answer: "एम. एन. श्रीनिवास"
},
{
    question: "सत्यप्रकाश पुस्तक की रचना किसने किया?",
    option: ["विवेकानन्द", "राजाराम मोहन राय", "सहजानन्द सरस्वती", "दयानन्द सरस्वती"],
    answer: "दयानन्द सरस्वती"
},
{
    question: "निम्न में कौन पश्चिमीकरण का कारक है?",
    option: ["रेडियो", "टेलीविजन", "समाचार – पत्र", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "आर्य समाज के संस्थापक कौन हैं?",
    option: ["दयानंद सरस्वती", "सहजानन्द सरस्वती", "विवेकानन्द", "राजा राममोहन राय"],
    answer: "दयानंद सरस्वती"
},
{
    question: "ब्रह्म समाज की स्थापना किसने की थी?",
    option: ["महात्मा गाँधी", "दयानन्द सरस्वती", "राजा राममोहन राय", "समाजीकरण किसने की थी"],
    answer: "राजा राममोहन राय"
},
{
    question: "परंपराओं को त्यागकर नए विचारों को ग्रहण करना कहलाता है?",
    option: ["आधुनिकीकरण", "कार्य निरपेक्षीकरण", "दयानन्द सरस्वती", "संस्कृतिकरण"],
    answer: "आधुनिकीकरण"
},
{
    question: "विधवा विवाह संघ की स्थापना किसने की थी",
    option: ["स्वामी दयानन्द", "महादेव गोविंद रानाडे", "राजा राममोहन राय", "केशव चन्द्र सेन"],
    answer: "महादेव गोविंद रानाडे"
},
{
    question: "ब्रह्म समाज की स्थापना कब की गई थी?",
    option: ["1832 ई. में", "1840 ई. में", "1825 ई. में", "1828 ई. में"],
    answer: "1828 ई. में"
},
{
    question: "मूल शंकर किसके बचपन का नाम था?",
    option: ["गाँधीजी का", "राजा राममोहन राय का", "स्वामी दयानन्द का", "केशवचन्द्र का"],
    answer: "स्वामी दयानन्द का"
},
{
    question: "‘सर्वोदय’ शब्द किसकी देन है?",
    option: ["स्वामी विवेकानन्द का", "राजा राममोहन राय का", "स्वामी दयानन्द का", "गाँधी जी का"],
    answer: "गाँधी जी का"
},
{
    question: "ब्रह्म समाज के स्थापना का क्या उद्देश्य था?",
    option: ["हिन्दू धर्म का समापन करना", "पश्चिमी सभ्यता लागू करना", "हिन्दू धर्म को पुनः व्याख्या करना", "इनमें से सभी"],
    answer: "हिन्दू धर्म को पुनः व्याख्या करना"
},
{
    question: "आधुनिकीकरण की अवधारणा किसने दी?",
    option: ["डेनियल लर्नर", "डेनियल बेल", "डेनियल थॉर्नर", "डेनियल गूच"],
    answer: "डेनियल लर्नर"
},
{
    question: "हरिजन आन्दोलन किसने चलाया था?",
    option: ["राजा राममोहन राय", "गाँधी", "नेहरू जी", "दयानन्द सरस्वती"],
    answer: "गाँधी"
},
{
    question: "भारत में ब्रिटिश उपनिवेशवाद सहायक था?",
    option: ["लॉर्ड कार्नवालिस", "मौसमी", "वारेन हेस्टिंग्ज", "औद्योगीकरण"],
    answer: "औद्योगीकरण"
},
{
    question: "सन् 1995 में भारत में मलिन बस्तियों में रहनेवाले लोगों की संख्या कितनी थी?",
    option: ["250 लाख", "450 लाख", "300 लाख", "500 लाख"],
    answer: "450 लाख"
},
{
    question: "वर्तमान स्थिति में किसी भी प्रकार के और किसी भी स्तर के बदलाव को कहते है",
    option: ["परिवर्तन", "लॉर्ड क्लाइव", "नगरीकरण", "उपर्युक्त सभी"],
    answer: "परिवर्तन"
},
{
    question: "यूरोप और अमेरिका की सभ्यताओं की संस्कृति से प्रभावित होकर होने वाले परिवर्तन को कहते हैं",
    option: ["उपनिवेशवाद", "मौसमी परिवर्तन", "पश्चिमीकरण", "मलिन बस्तियाँ"],
    answer: "पश्चिमीकरण"
},
{
    question: "“सामाजिक परिवर्तन से तात्पर्य सामाजिक ढाँचे के परिवर्तन से है” यह कथन किसका था?",
    option: ["जॉनसन", "गिलिन तथा गिलिन", "डॉ. मजूमदार", "मैकाइवर तथा पेज"],
    answer: "जॉनसन"
},
{
    question: "जब सरकारी उद्यम व्यक्ति या व्यक्तियों के समूह को बेच दिए जाते हैं अथवा चलाने के लिए दिए जाते हैं तो यह प्रक्रिया कहलाती है",
    option: ["उदारीकरण", "निजीकरण", "महिला सशक्तीकरण", "लोक क्षेत्र"],
    answer: "निजीकरण"
},
{
    question: "जातीय संगठन राजनीति में कैसी भूमिका निभा रही है",
    option: ["दबाव समूह", "स्वार्थ समूह", "सक्रिय समूह", "कल्याणकारी समूह"],
    answer: "दबाव समूह"
},
{
    question: "राज्य की परिभाषा का आधार क्या है?",
    option: ["जनसंख्या तथा निश्चित भू – भाग पर आधारित है", "जनसंख्या निश्चित भू – भाग तथा सरकार पर आधारित है।", "जनसंख्या निश्चित भू – भाग, सरकार तथा संप्रभुता पर आधारित है", "उपर्युक्त सभी तत्वों पर आधारित है"],
    answer: "जनसंख्या निश्चित भू – भाग, सरकार तथा संप्रभुता पर आधारित है"
},
{
    question: "निम्न में सही उत्तर पर चिह्न लगावें",
    option: ["संविधान धार्मिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है", "संविधान प्रशासनिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है", "संविधान प्रशासनिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है", "संविधान शैक्षणिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है।"],
    answer: "संविधान प्रशासनिक नियमों तथा प्रावधानों का एक व्यवस्थित प्रलेख है"
},
{
    question: "निम्न में जो सही है उस पर चिह्न लगायें",
    option: ["पंचायत का कार्यकाल तीन वर्षों के लिए निर्धारित है", "पंचायत का कार्यकाल चार वर्षों के लिए निर्धारित है", "पंचायत का कार्यकाल पाँच वर्षों के लिए निर्धारित है", "पंचायत का कार्यकाल छः वर्षों के लिए निर्धारित है"],
    answer: "पंचायत का कार्यकाल पाँच वर्षों के लिए निर्धारित है"
},
{
    question: "किस वर्ष से बलवंत राय मेहता कमिटी की सिफारिशों के आधार पर विभिन्न राज्यों में नया पंचायतीराज कानून लागू होना शुरू हुआ?",
    option: ["1947", "1950", "1959", "1965"],
    answer: "1959"
},
{
    question: "निम्नांकित में कौन आधुनिक राज्य के कार्य हैं?",
    option: ["बाहरी आक्रमण से रक्षा करना", "आंतरिक शांति स्थापित करना", "लोगों के लिए न्याय की व्यवस्था करना", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारतीय संस्कृति की निम्न में से कौन – सी विशेषता है?",
    option: ["धर्म की प्रधानता", "पुनर्जन्म में विश्वास", "कर्मफल में विश्वास", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्न में से किसके प्रयास से सत्ती प्रथा उन्मूलन सम्भव हुआ?",
    option: ["राममोहन राय", "रमा बाई", "बिनोवा भावे", "राम मनोहर लोहिया"],
    answer: "राममोहन राय"
},
{
    question: "पंचायतों को बल प्रदान करने वाला विधेयक संविधान के किस संशोधन द्वारा लाया गया ?",
    option: ["71 वाँ", "73 वाँ", "75 वाँ", "69 वाँ"],
    answer: "73 वाँ"
},
{
    question: "एक ग्राम पंचायत में कौन न्यायाधीश की भूमिका अदा करता है ?",
    option: ["मुखिया", "सरपंच", "पंच", "ग्राम सेवक"],
    answer: "सरपंच"
},
{
    question: "राज्य का क्या अर्थ है ?",
    option: ["जान – माल की रक्षा", "कल्याण", "न्याय", "इनमें सभी"],
    answer: "इनमें सभी"
},
{
    question: "सीटू ‘ का सम्बन्ध किस राजनीतिक दल से है ?",
    option: ["काँग्रेस ( आई )", "मार्क्सवादी कम्युनिस्ट पार्टी", "भारतीय जनता पार्टी", "भारतीय कम्युनिस्ट पार्टी"],
    answer: "मार्क्सवादी कम्युनिस्ट पार्टी"
},
{
    question: "भारतीय अर्थव्यवस्था का मॉडल किस प्रकार का है ?",
    option: ["पूँजीवादी", "मिश्रित", "समाजवादी", "साम्यवादी"],
    answer: "मिश्रित"
},
{
    question: "किस विद्वान ने सर्वप्रथम ‘ दबाव समूह ‘ शब्द का प्रयोग किया है ?",
    option: ["मैक्स वेबर", "पीटर ऑडीगार्ड", "समनर", "टी.के. उम्मन"],
    answer: "मैक्स वेबर"
},
{
    question: "पंचायती राज में सबसे प्रमुख इकाई कौन है ?",
    option: ["मुखिया", "सरपंच", "ग्राम सभा", "ग्राम सेवक"],
    answer: "ग्राम सभा"
},
{
    question: "निम्न में से किसने ग्रामीण नगरीय सातत्य अवधारणा के विकास में योगदान दिया ?",
    option: ["एस.सी. दूबे", "सारोकिन", "रेडफील्ड", "कॉम्ट"],
    answer: "रेडफील्ड"
},
{
    question: "भारत में राजनीतिक दल को कौन मान्यता देता है ?",
    option: ["राष्ट्रपति", "उच्चतम न्यायालय", "संसद", "चुनाव आयोग"],
    answer: "चुनाव आयोग"
},
{
    question: "पंचायती राज व्यवस्था कितने स्तर की है",
    option: ["दो स्तरीय", "तीन स्तरीय", "चार स्तरीय", "पाँच स्तरीय"],
    answer: "तीन स्तरीय"
},
{
    question: "पंचायत समिति का अध्यक्ष कौन होता है ?",
    option: ["सी.ओ.", "प्रमुख", "मुखिया", "बी.डी.ओ"],
    answer: "प्रमुख"
},
{
    question: "प्रजातंत्र की विशेषता है",
    option: ["सार्वभौमिक मताधिकार", "कानून की दृष्टि में समानता", "प्रेस की स्वतंत्रता", "इनमें सभी"],
    answer: "इनमें सभी"
},
{
    question: "73 वें संविधान संशोधन कब किया गया ?",
    option: ["1980 ई. में", "1990 ई. में", "1985 ई. में", "1992 ई. में"],
    answer: "1992 ई. में"
},
{
    question: "किस समाजशास्त्री ने प्रजातंत्र का विरोध किया एवं फासीवाद का समर्थन किया ?",
    option: ["पैरेटो", "कॉम्टे", "मार्क्स", "वेबर"],
    answer: "पैरेटो"
},
{
    question: "संविधान के कौन – से संशोधन के द्वारा स्थानीय स्वशासन निकायों में महिलाओं के प्रतिनिधित्व को बढ़ाने की कोशिश की गई है ?",
    option: ["51 वाँ एवं 52 वाँ", "73 वाँ एवं 74 वाँ", "81 वाँ एवं 82 वाँ", "इनमें से कोई नहीं"],
    answer: "73 वाँ एवं 74 वाँ"
},
{
    question: "पंचायती राज्य के गाँव के विकास के लिए कितनी संस्थाएँ कार्य करती हैं ?",
    option: ["दो", "चार", "तीन", "पाँच"],
    answer: "तीन"
},
{
    question: "बलवंत राय मेहता समिति की सिफारिशों को लागू करने वाला पहला राज्य था ?",
    option: ["बिहार", "मध्य प्रदेश", "राजस्थान", "गुजरात"],
    answer: "राजस्थान"
},
{
    question: "कितने वर्ष के अंतर्गत के बच्चों को किसी खतरनाक कार्य में लगाना दंडनीय अपराध माना गया है ?",
    option: ["14 वर्ष", "18 वर्ष", "10 वर्ष", "20 वर्ष"],
    answer: "14 वर्ष"
},
{
    question: "पंचायती राज संस्थाओं में निम्नलिखित में कौन निम्नतम इकाई है ?",
    option: ["ग्राम पंचायती", "पंचायत समिति", "जिला परिषद्", "पंचायत सेवक"],
    answer: "ग्राम पंचायती"
},
{
    question: "रानाडे व भण्डारकर ने सन् 1867 में किस संस्था की स्थापना की",
    option: ["प्रार्थना समाज", "आर्य समाज", "ब्रह्म समाज", "पारसी समाज"],
    answer: "प्रार्थना समाज"
},
{
    question: "सिस्टर निवेदिता किसकी शिष्य थीं ?",
    option: ["महर्षि दयानन्द सरस्वती", "स्वामी विवेकानन्द", "गोकुल चन्द नारंग", "डॉ. मानिक चन्द्र"],
    answer: "स्वामी विवेकानन्द"
},
{
    question: "आर्य समाज ने गुजराँवाला में गुरुकुल की स्थापना किस वर्ष की थी ?",
    option: ["1900 में", "1901 में", "1903 में", "1904 में"],
    answer: "1900 में"
},
{
    question: "‘ Indian Miror ‘ पुस्तक के लेखक कौन हैं ?",
    option: ["केशवचन्द्र सेन", "देवेन्द्र नाथ ठाकुर", "राजा राममोहन राय", "स्वामी विवेकानन्द"],
    answer: "देवेन्द्र नाथ ठाकुर"
},
{
    question: "“ प्रजातंत्र जनता के लिए, जनता के द्वारा, जनता की सरकार है ” प्रजातंत्र की यह परिभाषा किसने दी है ?",
    option: ["बाराक ओबामा", "महात्मा गाँधी", "अब्राहम लिंकन", "जवाहरलाल नेहरू"],
    answer: "अब्राहम लिंकन"
},
{
    question: "स्वतंत्र भारत में सर्वप्रथम किस पंचवर्षीय योजना में उद्योग पर जोर दिया गया ?",
    option: ["प्रथम पंचवर्षीय योजना", "द्वितीय पंचवर्षीय योजना", "तृतीय पंचवर्षीय योजना", "चतुर्थ पंचवर्षीय योजना"],
    answer: "द्वितीय पंचवर्षीय योजना"
},
{
    question: "ग्यारहवीं पंचवर्षीय योजना का काल क्या है ?",
    option: ["2002-2007", "2007-2009", "2007-2012", "2008-2013"],
    answer: "2007-2012"
},
{
    question: "‘ सत्य शोधक समाज ‘ के संस्थापक कौन थे ?",
    option: ["आचार्य रामानुज", "स्वामी विवेकानन्द", "स्वामी दयानन्द", "ज्योतिबा फुले"],
    answer: "ज्योतिबा फुले"
},
{
    question: "” गाँव एक लघु गणराज्य है ” किसने कहा ?",
    option: ["मेटकॉफ", "ए.आर. देसाई", "कार्ल मार्क्स", "महात्मा गाँधी"],
    answer: "मेटकॉफ"
},
{
    question: "बाल विवाह निरोधक अधिनियम किस साल लागू हुआ ?",
    option: ["1929", "1939", "1910", "1925"],
    answer: "1929"
},
{
    question: "राज्य द्वारा पारित किए गये वे कानून जो सामाजिक कुरीतियों को दूर करने, सामाजिक विघटन को रोकने तथा समाज सुधार के अनुकूल परिस्थितियाँ उत्पन्न करने के उद्देश्य से बनाये जाते हैं, उन्हें कहते हैं",
    option: ["सामाजिक विधान", "प्रार्थना समाज", "आर्य समाज", "भारत सेवक समाज"],
    answer: "सामाजिक विधान"
},
{
    question: "निम्नलिखित में किस राज्य में सर्वप्रथम पंचायत चुनाव में महिलाओं को 50 % आरक्षण दिया गया ?",
    option: ["मध्य प्रदेश", "राजस्थान", "पश्चिम बंगाल", "बिहार"],
    answer: "बिहार"
},
{
    question: "‘ अस्पृश्यता अधिनियम ‘ कब पारित हुआ ?",
    option: ["1950", "1955", "1957", "1959"],
    answer: "1955"
},
{
    question: "‘ नागरिक अधिकार संरक्षण कानून ‘ किस सन् में बना ?",
    option: ["1971", "1972", "1975", "1976"],
    answer: "1976"
},
{
    question: "‘ हिन्दू गोद लेना भरण – पोषण अधिनियम के अनुसार गोद लेने वाले व्यक्ति में निम्न में से कौन – सी विशेषताएँ होनी चाहिए ?",
    option: ["उनका मन स्वस्थ हो", "उनकी आयु कम से कम 18 वर्ष की हो", "यदि उसकी पत्नी जीवित है तो गोद लेने के लिए उसकी सहमति भी आवश्यक है", "उपर्युक्त सभी"],
    answer: "यदि उसकी पत्नी जीवित है तो गोद लेने के लिए उसकी सहमति भी आवश्यक है"
},
{
    question: "निम्नलिखित में से राजनीतिक दल का प्रकार है",
    option: ["एक दलीय व्यवस्था", "द्विदलीय व्यवस्था", "बहुदलीय व्यवस्था", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "‘ पॅलिटिकल साइंस ‘ नामक पुस्तक के रचयिता हैं",
    option: ["लीकॉक", "गैटिल", "मैकाइवर", "गिलक्राइस्ट"],
    answer: "गैटिल"
},
{
    question: "” राजनीतिक दल एक ऐसा समुदाय है, जो किसी ऐसे सिद्धान्त अथवा ऐसी नीति के समर्थन के लिए संगठित हुए हो, जिससे वह वैधानिक साधनों से सरकार का आधार बनाना चाहता हो । ” यह परिभाषा दी है",
    option: ["मैकाइवर", "रूसो", "स्पेंसर", "गैटिल"],
    answer: "मैकाइवर"
},
{
    question: "निम्न में से राजनीतिक दल का कार्य है",
    option: ["जनता और सरकार के बीच समन्वय स्थापित करना", "जनमत तैयार करना", "जनता में राजनैतिक जागरूकता पैदा करना", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "“ दबाव समूह व्यक्तियों का वह समूह है, जो शासकीय विषयों के माध्यम से अथवा उनके बिना ही राजनीतिक परिवर्तन लाने का प्रयत्न करता है । ऐसे दबाव समूहों को विधानमण्डल में राजनीतिक दलों के रूप में कोई प्रतिनिधित्व नहीं होता । ” उक्त परिभाषा सम्बन्धित है",
    option: ["पी. ओडीगार्ड", "लीकॉक", "फ्रांसिस कैसेल्स", "एच. जेगलर"],
    answer: "फ्रांसिस कैसेल्स"
},
{
    question: "निम्न में से दबाव समूह का साधन है",
    option: ["घेराव एवं प्रदर्शन", "जनसंचार के साधनों का प्रयोग", "हड़ताल", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भारत में किस प्रकार शासन प्रणाली पायी जाती है ?",
    option: ["संसदीय शासन प्रणाली", "अध्यक्षीय शासन प्रणाली", "( a ) और ( b ) दोनो", "इनमें से कोई नहीं"],
    answer: "संसदीय शासन प्रणाली"
},
{
    question: "पीटर मार्कल ने दबाव समूह को कितने भागों में वर्गीकृत किया है ?",
    option: ["तीन", "चार", "छः", "आठ"],
    answer: "छः"
},
{
    question: "भारतीय संसद दो सदनों में विभाजित है । प्रथम सदन को लोकसभा कहा जाता है और द्वितीय सदन का नाम है",
    option: ["विधान सभा", "विधान परिषद्", "राज्य सभा", "इनमें से कोई नहीं"],
    answer: "राज्य सभा"
},
{
    question: "निम्नलिखित से संविधान प्रारूप समिति के अध्यक्ष थे",
    option: ["रवीन्द्रनाथ टैगोर", "भीमराव अम्बेडकर", "महात्मा गाँधी", "सरदार पटेल"],
    answer: "भीमराव अम्बेडकर"
},
{
    question: "भारतीय संविधान कब लागू किया गया ?",
    option: ["25 जनवरी, 1948", "20 दिसम्बर, 1949", "26 जनवरी, 1950", "26 जनवरी, 1949"],
    answer: "26 जनवरी, 1950"
},
{
    question: "भारतीय संविधान में निम्न में से कौन से मूल्य निहित हैं",
    option: ["धर्मनिरपेक्षता", "स्वतंत्रता", "समानता", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "निम्नलिखित में किस कमिटी की अनुशंसा के आधार पर पंचायतीराज व्यवस्था लागू की गई ?",
    option: ["काका कालेलकर कमिटी", "अशोक मेहता कमिटी", "बलवंतराय मेहता कमिटी", "थुंगन कमिटी"],
    answer: "बलवंतराय मेहता कमिटी"
},
{
    question: "संविधान के किस अनुच्छेद में वृद्धों, असहायों एवं बालकों को संरक्षण प्रदान किया गया है ?",
    option: ["अनुच्छेद 17", "अनुच्छेद 39", "अनुच्छेद 15 एवं 16", "अनुच्छेद 39"],
    answer: "अनुच्छेद 39"
},
{
    question: "संविधान के किस अनुच्छेद में अनुसूचित जाति, जनजाति एवं पिछड़े वर्गों को लोकसभा एवं राज्य विधान सभाओं में प्रतिनिधित्व का प्रावधान किया गया है ?",
    option: ["अनुच्छेद 330 एवं 332", "अनुच्छेद 14 एवं 14", "अनुच्छेद 23 एवं 24", "इने से कोई नहीं"],
    answer: "अनुच्छेद 330 एवं 332"
},
{
    question: "योजना आयोग के स्थान पर नवीन आयोग का गठन किया गया है। उसे किस नाम से जाना जाता है ?",
    option: ["लोक सेवा आयोग", "जन सेवा आयोग", "नीति आयोग", "कल्याण आयोग"],
    answer: "नीति आयोग"
},
{
    question: "निम्न में से किसे मौलिक अधिकारों की सूची से हटा दिया गया है ?",
    option: ["शिक्षा का अधिकार", "सम्पति का अधिकार", "शोषण के विरुद्ध अधिकार", "स्वतंत्रता का अधिकार"],
    answer: "सम्पति का अधिकार"
},
{
    question: "निम्न में से कौन मौलिक अधिकार नहीं है ?",
    option: ["समानता का अधिकार", "स्वतंत्रता का अधिकार", "शिक्षा का अधिकार", "हिंसा का अधिकार"],
    answer: "हिंसा का अधिकार"
},
{
    question: "डॉ. भीमराव अम्बेडकर का जन्म भारत के किस राज्य में हुआ था ?",
    option: ["गुजरात", "उत्तर प्रदेश", "महाराष्ट्र", "मध्य प्रदेश"],
    answer: "महाराष्ट्र"
},
{
    question: "मंडल आयोग के अध्यक्ष कौन थे ?",
    option: ["बिन्देश्वरी प्रसाद मंडल", "धनिक लाल मंडल", "मंगनी लाल मंडल", "चन्दौश्वरी लाल मंडल"],
    answer: "बिन्देश्वरी प्रसाद मंडल"
},
{
    question: "निम्नलिखित में से किसे शारदा एक्ट कहा जाता है ?",
    option: ["विशेष विवाह एक्ट", "सहमति आयु", "बाल विवाह एक्ट", "हिन्दू विवाह एक्ट"],
    answer: "बाल विवाह एक्ट"
},
{
    question: "कितने वर्ष के अंतर्गत के बच्चों को किसी खतरनाक कार्य में लगाना दंडनीय अपराध माना गया है ?",
    option: ["14", "18", "10", "20"],
    answer: "14"
},
{
    question: "भारत में पंचायतीराज एक्ट कब पारित हुआ ?",
    option: ["1951 ई. में", "1947 ई. में", "1952 ई. में", "1959 ई. में"],
    answer: "1959 ई. में"
},
{
    question: "पंचायतीराज व्यवस्था सर्वप्रथम किस राज्य में लागू किया गया ?",
    option: ["बिहार", "उत्तर प्रदेश", "महाराष्ट्र", "राजस्थान"],
    answer: "राजस्थान"
},
{
    question: "बलवंत राय मेहता समिति किससे सम्बन्धित है ?",
    option: ["भूमि सुधार से", "हरित क्रांति से", "पंचायती राज से", "नक्सल आन्दोलन से"],
    answer: "पंचायती राज से"
},
{
    question: "बिहार में किस वर्ष ग्राम पंचायत की स्थापना हुई ?",
    option: ["1946", "1947", "1949", "1950"],
    answer: "1947"
},
{
    question: "‘ दलित वर्ग कल्याण लीग ‘ की स्थापना किसने की थी ?",
    option: ["महात्मा गाँधी", "राम विलास पासवान", "जगजीवन राम", "बी ० आर ० अम्बेदकर"],
    answer: "जगजीवन राम"
},
{
    question: "बिहार में पंचायती राज के सदस्यों का कार्यकाल कितने वर्षों का होता है ?",
    option: ["पाँच वर्ष", "तीन वर्ष", "सात वर्ष", "चार वर्ष"],
    answer: "पाँच वर्ष"
},
{
    question: "निम्न में कौन ग्रामीण समाज की विशेषता है ?",
    option: ["श्रम विभाजन", "सामाजिक गतिशीलता", "घनी आबादी", "कृषि व्यवसाय"],
    answer: "कृषि व्यवसाय"
},
{
    question: "निम्न में से किस राज्य में भू – सुधार कार्यक्रम सबसे सफल रहा है ?",
    option: ["बिहार", "कर्नाटक", "पश्चिम बंगाल", "उत्तराखण्ड"],
    answer: "पश्चिम बंगाल"
},
{
    question: "हरित क्रांति का मुख्य कारक कौन है ?",
    option: ["उपजाऊ भूमि", "रासायनिक खाद और बीज", "वर्षा", "शिक्षा"],
    answer: "रासायनिक खाद और बीज"
},
{
    question: "जमींदारी उन्मूलन अधिनियम किस वर्ष पारित किया गया ?",
    option: ["1961 ई. में", "1948 ई. में", "1950 ई. में", "1955 ई. में"],
    answer: "1950 ई. में"
},
{
    question: "जीवन जीने के लिए आवश्यक रोजगार या कार्य जिससे धन की प्राप्ति हो उसे कहते हैं",
    option: ["जीविका", "बिचौलिए", "बटाईदारी", "काश्तकारी"],
    answer: "जीविका"
},
{
    question: "भारत में कितना प्रतिशत राष्ट्रीय आय कृषि से प्राप्त होती है ?",
    option: ["28 %", "29 %", "30 %", "40 %"],
    answer: "29 %"
},
{
    question: "गहन कृषि जिला कार्यक्रम आरम्भ किया गया",
    option: ["1961 ई. में", "1951 ई. में", "1971 ई. में", "1991 ई. में"],
    answer: "1961 ई. में"
},
{
    question: "भारत में हरित क्रांति लाने में किसका योगदान है ?",
    option: ["जगदीशचन्द्र बसु", "चन्द्रशेखर वेंकट रमन", "डॉ. होमी जहाँगीर भाभा", "डॉ. एम.एस. स्वामीनाथन"],
    answer: "डॉ. एम.एस. स्वामीनाथन"
},
{
    question: "मध्याह्न भोजन कहाँ लागू हुआ ?",
    option: ["स्कूल", "कॉलेज", "ऑफिस", "उपर्युक्त सभी"],
    answer: "स्कूल"
},
{
    question: "भारत में जमींदारी व्यवस्था के अन्तर्गत भूमि का कितने प्रतिशत भाग आता था ?",
    option: ["20 प्रतिशत", "40 प्रतिशत", "60 प्रतिशत", "80 प्रतिशत"],
    answer: "20 प्रतिशत"
},
{
    question: "राबर्ट रेडफील्ड के अनुसार कृषक समाज की विशेषता है",
    option: ["समरूप समाज", "कृषि भूमि पर नियंत्रण", "स्वयं उत्पादनकर्ता", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "थियोडोर शनीन ने कृषक समाज के कितने मौलिक पक्षों का उल्लेख किया है ?",
    option: ["तीन", "चार", "पाँच", "छः"],
    answer: "चार"
},
{
    question: "हरित क्रांति के प्रथम चरण के रूप में ‘ गहन कृषि जिला कार्यक्रम ‘ कब लागू किया गया ?",
    option: ["सन् 1960", "सन् 1962", "सन् 1961", "सन् 1963"],
    answer: "सन् 1961"
},
{
    question: "भारत सरकार की ओर से भूमि के पुनर्गठन हेतु कौन – सा प्रयास किया गया ?",
    option: ["भूमि – प्रबन्धन", "सहकारी कृषि", "चकबन्दी", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "हरित क्रांति का उत्प्रेरक कौन है ?",
    option: ["नदियाँ", "संकरित बीज", "उपजाऊ जमीन", "वर्षा"],
    answer: "संकरित बीज"
},
{
    question: "हरित क्रान्ति किस राज्य में ज्यादा सफल रही ?",
    option: ["गुजरात", "असम ( असोम )", "पंजाब", "बिहार"],
    answer: "पंजाब"
},
{
    question: "निम्नलिखित में कौन हरित क्रान्ति के तत्व हैं ?",
    option: ["अच्छे बीज का उपयोग", "बहु फसल", "सिंचाई पर बल", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्नलिखित में कौन हरित क्रान्ति का प्रकार्य है ?",
    option: ["शैक्षणिक विकास", "क्षेत्रीय असमानता", "अर्थव्यवस्था में विकास", "उपर्युक्त सभी"],
    answer: "अर्थव्यवस्था में विकास"
},
{
    question: "इनमें से कौन आदिम अर्थव्यवस्था का दूसरा स्तर है ?",
    option: ["शिकार एवं भोजन संग्रह स्तर", "कृषि स्तर", "पशुचारण स्तर", "औद्योगिक स्तर"],
    answer: "कृषि स्तर"
},
{
    question: "‘ सबला ‘ स्कीम केन्द्रित है",
    option: ["असहाय महिलाएँ", "किशोरियाँ", "मातृत्व लाभ", "इनमें से सभी"],
    answer: "किशोरियाँ"
},
{
    question: "बिहार में कौन – सी संस्था ग्रामीण विवादों का निपटारा करती है ?",
    option: ["न्याय पंचायत", "पंचायत कचहरी", "ग्राम कचहरी", "इनमें से कोई नहीं"],
    answer: "ग्राम कचहरी"
},
{
    question: "भूमंडलीकरण का सम्बन्ध किससे है ?",
    option: ["उदारीकरण से", "निजीकरण से", "(a) एवं (b) दोनों से", "इनमें से कोई नहीं"],
    answer: "(a) एवं (b) दोनों से"
},
{
    question: "उदारीकरण से क्या अर्थ निकलता है ?",
    option: ["समाजवाद", "मनुष्य का उदार होना", "काफी उन्नति होना", "मुक्त बाजार व्यवस्था"],
    answer: "मुक्त बाजार व्यवस्था"
},
{
    question: "निम्न में से कौन – सी दशा उदारीकरण का परिणाम नहीं है ?",
    option: ["उपभोक्तावाद", "ग्रामीण उद्योग का विघटन", "बेरोजगारी", "संयुक्त परिवार का विघटन"],
    answer: "उपभोक्तावाद"
},
{
    question: "किस वर्ष अंतर्राष्ट्रीय श्रम संगठन की स्थापना हुई ?",
    option: ["1918 ई. में", "1919 ई. में", "1941 ई. में", "1949 ई. में"],
    answer: "1919 ई. में"
},
{
    question: "विश्व व्यापार संगठन की स्थापना कब किया गया ?",
    option: ["1990 ई. में", "1980 ई. में", "1977 ई. में", "1995 ई. में"],
    answer: "1995 ई. में"
},
{
    question: "वैश्वीकरण का संबंध है",
    option: ["सार्वभौमिकरण के साथ", "एकीकरण के साथ", "सजातीयता के साथ", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "विश्व व्यापार संगठन का मुख्यालय कहाँ है ?",
    option: ["नई दिल्ली", "पेरिस", "जिनेवा", "इस्लामाबाद"],
    answer: "जिनेवा"
},
{
    question: "इनमें कौन विदेशी चैनल है ?",
    option: ["सहारा", "स्टार", "आज तक", "इनमें से कोई नहीं"],
    answer: "स्टार"
},
{
    question: "निम्न में कौन विकसित देश है ?",
    option: ["श्रीलंका", "नेपाल", "अमेरिका", "भारत"],
    answer: "अमेरिका"
},
{
    question: "ऐसी कंपनियाँ जो एक से अधिक देशों में अपना उत्पादन करती है अथवा बाजार सेवाएं प्रदान करती है, उसे क्या कहते हैं ?",
    option: ["स्वदेशी निगम", "पारा राष्ट्रीय निगम", "लघु उद्योग", "वृहत् उद्योग"],
    answer: "पारा राष्ट्रीय निगम"
},
{
    question: "भूमण्डलीकरण वह प्रक्रिया है जो पूँजीवाद के विस्तार एवं उसकी समृद्धि के कारण उत्पन्न हुई है। इस परिभाषा के प्रस्तुतकर्त्ता कौन हैं ?",
    option: ["गिड्डेन्स", "बेलरस्टेन", "इन्टरनेशनल सोशियालॉजी", "इनमें से कोई नहीं"],
    answer: "बेलरस्टेन"
},
{
    question: "The Consequence of Modernity पुस्तक के लेखक कौन हैं ?",
    option: ["दीपक गुप्ता", "गिड्डेन्स", "बेलरस्टेन", "इनमें से कोई नहीं"],
    answer: "गिड्डेन्स"
},
{
    question: "Historical Capitalism के लेखक कौन हैं ?",
    option: ["कार्ल मार्क्स", "जॉर्ज रिट्यर", "दीपंकर गुप्ता", "बेलरस्टेन"],
    answer: "बेलरस्टेन"
},
{
    question: "भूमण्डलीकरण को आगे बढ़ाने वाले प्रमुख प्रेरक कौन से हैं ?",
    option: ["बाजार की खोज", "बहुराष्ट्रीय विनिवेश", "प्रौद्योगिकी, इलेक्ट्रॉनिक के नए उपकरण और नेटवर्क", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "निम्न में से कौन – सा एक प्रभाव भारत पर भूमण्डलीकरण का प्रभाव नहीं है ?",
    option: ["राष्ट्रीय आय में वृद्धि", "महिला जागरूकता", "राष्ट्रीयकरण", "कृषि उत्पादन में वृद्धि"],
    answer: "राष्ट्रीयकरण"
},
{
    question: "समाजशास्त्रीय दृष्टिकोण से भूमण्डलीकरण की अवधारणा का विश्लेषण किसने किया ?",
    option: ["के. डेविस", "टी.बी. बाटोमोर", "मैकाइवर एवं पेज", "एंथनी गिड्डेन्स"],
    answer: "एंथनी गिड्डेन्स"
},
{
    question: "भूमण्डलीकरण का मौलिक उद्देश्य प्रत्येक राष्ट्र को विश्व स्तर पर क्या सुगम रूप से उपलब्ध कराना है ?",
    option: ["संसाधन", "ज्ञान", "तकनीकी", "ये सभी"],
    answer: "ये सभी"
},
{
    question: "यद्यपि भूमण्डलीकरण प्रक्रिया का कार्य क्षेत्र आर्थिक माना जाता है तथापि कौन – सा क्षेत्र इससे अछूता नहीं है ?",
    option: ["सामाजिक", "सांस्कृतिक", "राजनीतिक", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "भूमण्डलीकरण का प्रमुख आधार है",
    option: ["भौतिकवादी दर्शन", "राजदर्शन", "सामाजिक दर्शन", "इनमें से कोई नहीं"],
    answer: "भौतिकवादी दर्शन"
},
{
    question: "भारत में भूमण्डलीकरण का प्रारम्भ किस वर्ष हुआ ?",
    option: ["सन् 1990", "सन् 1991", "सन् 2000", "सन् 2001"],
    answer: "सन् 1991"
},
{
    question: "निम्न में से कौन सामाजिक परिवर्तन की विशेषता नहीं है ?",
    option: ["विश्वव्यापी", "सामुदायिक परिवर्तन", "स्थायी अवधारणा", "अनिश्चित भविष्यवाणी"],
    answer: "अनिश्चित भविष्यवाणी"
},
{
    question: "निम्न में से कौन – सा एक प्रभाव भारत में वैश्वीकरण का प्रभाव नहीं है ?",
    option: ["राष्ट्रीय आय में वृद्धि", "महिला जागरूकता", "राष्ट्रीयकरण", "कृषि उत्पादन में वृद्धि"],
    answer: "राष्ट्रीयकरण"
},
{
    question: "इनमें से किसको प्रजातंत्र का चौथा स्तंभ कहा जाता है ?",
    option: ["कार्यपालिका", "विधायिका", "प्रेस", "न्यायपालिका"],
    answer: "प्रेस"
},
{
    question: "रेडियो का आविष्कार कब हुआ ?",
    option: ["1895 ई. में", "1795 ई. में", "1695 ई. में", "1595 ई. में"],
    answer: "1895 ई. में"
},
{
    question: "प्रसार भारती का गठन हुआ",
    option: ["1985 ई. में", "1987 ई. में", "1997 ई. में", "1999 ई. में"],
    answer: "1997 ई. में"
},
{
    question: "भारत में विधिवत टी.वी. सेवा का आरंभ कब हुआ ?",
    option: ["15 अगस्त, 1965 में", "15 अगस्त, 1970 में", "15 अगस्त, 1968 में", "15 अगस्त, 1966 में"],
    answer: "15 अगस्त, 1965 में"
},
{
    question: "F.M. रेडियो की शुरूआत हुई",
    option: ["1960 ई. में", "1980 ई. में", "1975 ई. में", "1993 ई. में"],
    answer: "1993 ई. में"
},
{
    question: "BBC ने अपना टेलीविजन सेवा शुरू की",
    option: ["1936 ई. में", "1940 ई. में", "1942 ई. में", "1945 ई. में"],
    answer: "1936 ई. में"
},
{
    question: "जनसंचार के प्रभावस्वरूप भारतीय समाज ने किस मूल्य को आत्मसात किया है ?",
    option: ["स्वतंत्रतावादी", "धर्मनिरपेक्षवादी", "समानतावादी", "उपर्युक्त सभी"],
    answer: "समानतावादी"
},
{
    question: "वर्तमान भारतीय संस्कृति सर्वाधिक रूप से किससे प्रभावित है ?",
    option: ["नैतिकता से", "पाश्चात्य संस्कृति से", "प्रबुद्ध वर्ग से", "आदर्शवाद से"],
    answer: "पाश्चात्य संस्कृति से"
},
{
    question: "भारत के सामान्य ग्रामीणों में जनसंचार के किस साधन का प्रचलन सबसे अधिक है ?",
    option: ["समाचार पत्र", "चलचित्र", "टेलीविजन", "रेडियो"],
    answer: "रेडियो"
},
{
    question: "यह किसका कथन है कि “जनसंचार एक ऐसी प्रक्रिया है जिसके द्वारा कुछ विचारों को विभिन्न साधनों के माध्यम से सम्पूर्ण समुदाय तक पहुँचाया जाता है।”",
    option: ["लैपियर", "विल्सन", "मैकाइवर", "मर्टन"],
    answer: "मैकाइवर"
},
{
    question: "निम्नलिखित में से जनसंचार का प्रकार है",
    option: ["मुद्रित संचार", "विद्युत संचार", "दृश्य – श्रव्य संचार", "उपर्युक्त सभी"],
    answer: "उपर्युक्त सभी"
},
{
    question: "मोबाइल फोन, फैक्स और इन्टरनेट आदि जनसंचार के किस साधन के अन्तर्गत आते हैं ?",
    option: ["विद्युत संचार के साधन", "मुद्रित संचार", "दृश्य – श्रव्य संचार के साधन के साधन", "इनमें से कोई नहीं"],
    answer: "विद्युत संचार के साधन"
},
{
    question: "चिपको आंदोलन की अगुआयी किसने की ?",
    option: ["इंद्रेश चिपकलानी", "मेघा पाटेकर", "सुंदरलाल बहुगुणा", "स्वामी अग्निवेष"],
    answer: "सुंदरलाल बहुगुणा"
},
{
    question: "निम्न में से किसका सम्बन्ध जनजातीय आंदोलन से है ?",
    option: ["राम जयपाल सिंह का", "बिरसा मुंडा का", "शिबू सोरेन का", "इनमें सभी"],
    answer: "इनमें सभी"
},
{
    question: "निम्न में से कौन महिला आंदोलन से जुड़े हैं ?",
    option: ["सरोजनी नायडू", "मोहिनी गरि", "रंजना कुमारी", "इनमें से सभी"],
    answer: "इनमें से सभी"
},
{
    question: "पिछड़े वर्गों के लिए बनाया गया प्रथम आयोग के अध्यक्ष कौन थे ?",
    option: ["कर्पूरी ठाकुर", "मुंगेरी लाल", "वी.पी. मंडल", "काका कालेलकर"],
    answer: "काका कालेलकर"
},
{
    question: "मानसरोवर बांध के खिलाफ आंदोलन को नेतृत्व किसने प्रदान किया ?",
    option: ["सुंदरलाल बहुगुणा", "अरूंधती राय", "मेधा पाटकर", "सुनिता नारायण"],
    answer: "मेधा पाटकर"
},
{
    question: "निम्न में कौन किसान नेता माने जाते हैं ?",
    option: ["जयप्रकाश नारायण", "स्वामी सहजानंद सरस्वती", "लाला लाजपत", "इनमें से कोई नहीं"],
    answer: "स्वामी सहजानंद सरस्वती"
},
{
    question: "भारत के किस राज्य में पिछड़ी जाति आन्दोलन सर्वप्रथम शुरू हुआ ?",
    option: ["बिहार", "पश्चिम बंगाल", "आन्ध्र प्रदेश", "तमिलनाडु"],
    answer: "तमिलनाडु"
},
{
    question: "ताना भगत आन्दोलन संबंधित है",
    option: ["पिछड़ी जाति से", "दलित से", "जनजाति से", "इनमें से सभी"],
    answer: "जनजाति से"
},
{
    question: "फरवरी – मार्च 2015 से किस भारतीय ने किसान आन्दोलन में पदार्पण किया ?",
    option: ["राकेश टिकैत", "अन्ना हजारे", "अरविन्द केजरीवाल", "इनमें से कोई"],
    answer: "अन्ना हजारे"
},
{
    question: "भारत में नारीवादी आन्दोलन के पुरोधा के रूप में किनकी पहचान है ?",
    option: ["सुचेता कृपलानी", "सरोजिनी नायडू", "इन्दिरा गाँधी", "कमला नेहरू"],
    answer: "सरोजिनी नायडू"
},
{
    question: "स्वामी सहजानन्द सरस्वती का सम्बन्ध है",
    option: ["साम्यवादी आन्दोलन से", "किसान आन्दोलन से", "मजदूर आन्दोलन से", "इनमें से कोई नहीं"],
    answer: "किसान आन्दोलन से"
},
{
    question: "किस प्रकार के आन्दोलन के साथ आप रामस्वामी नाइक के नाम की जोड़ते हो ?",
    option: ["किसान आन्दोलन", "पर्यावरण सम्बन्धी आन्दोलन", "नारी – स्वतंत्रता आन्दोलन", "पिछड़ी वर्ग आन्दोलन"],
    answer: "पिछड़ी वर्ग आन्दोलन"
},
{
    question: "चिपको आन्दोलन सम्बन्धित है",
    option: ["वृक्षों की रक्षा से", "जल की रक्षा से", "पशुओं की रक्षा से", "खनिजों की रक्षा से"],
    answer: "वृक्षों की रक्षा से"
},
{
    question: "जनजातीय आंदोलन संबंधित है",
    option: ["जाति से", "जनजाति से", "सम्प्रदाय से", "धर्म से"],
    answer: "जनजाति से"
},
{
    question: "भारतीय किसान यूनियन के किसान आन्दोलन में नए सिरे से प्राण फेंकने का श्रेय किसे जाता है ?",
    option: ["विजय सिंह पथिक", "एम. एस. जोशी", "महेन्द्र सिंह टिकैत", "इनमें से कोई नहीं"],
    answer: "महेन्द्र सिंह टिकैत"
},
{
    question: "आत्मसम्मान आंदोलन के प्रणेता कौन थे ?",
    option: ["कर्पूरी ठाकुर", "राम मनोहर लोहिया", "रामास्वामी नायकर", "कांशीराम"],
    answer: "रामास्वामी नायकर"
},
{
    question: "‘मुण्डा विद्रोह’ का नेतृत्व किसने किया था ?",
    option: ["जतरा भगत", "बिरसा मुण्डा", "सिद्धो कान्हो", "करिया मुण्डा"],
    answer: "बिरसा मुण्डा"
},
{
    question: "भारत में किस वर्ष प्रधानमंत्री रोजगार योजना शुरू की गयी ?",
    option: ["1993", "1994", "2011", "2009"],
    answer: "1993"
},
{
    question: "किस वर्ष बालिका समृद्धि योजना की शुरूआत की गई ?",
    option: ["1997", "1998", "1999", "1986"],
    answer: "1997"
},
{
    question: "अहिंसा के आधार पर चलाया गया एक आंदोलन जिसे गाँधीजी ने चलाया, उसका नाम है",
    option: ["तेभागा आंदोलन", "ट्रेड यूनियन आंदोलन", "जन आंदोलन", "सत्याग्रह आंदोलन"],
    answer: "सत्याग्रह आंदोलन"
},
{
    question: "चिपको आन्दोलन चलाया गया",
    option: ["1973 ई. में", "1970 ई. में", "1983 ई. में", "1999 ई. में"],
    answer: "1973 ई. में"
},
{
    question: "“ताड़ी की बिक्री बंद करो” यह आंदोलन किस राज्य में शुरू हुआ ?",
    option: ["बिहार", "झारखण्ड", "गुजरात", "आंध्र प्रदेश"],
    answer: "आंध्र प्रदेश"
},
{
    question: "दलित – पैंथर्स की स्थापना कब की गई ?",
    option: ["1972 ई. में", "1980 ई. में", "1970 ई. में", "1983 ई. में"],
    answer: "1972 ई. में"
},
{
    question: "भारत सरकार ने महिला सशक्तिकरण के लिए राष्ट्रीय नीति की घोषणा कब की ?",
    option: ["2003 ई. में", "2005 ई. में", "2001 ई. में", "2002 ई. में"],
    answer: "2001 ई. में"
},
{
    question: "निम्न में से किस आन्दोलन का सम्बन्ध पर्यावरण समस्याओं से जुड़ा हुआ है ?",
    option: ["दलित आन्दोलन", "आदिवासी आन्दोलन", "चिपको आन्दोलन", "पिछड़ी जाति आन्दोलन"],
    answer: "चिपको आन्दोलन"
},
{
    question: "‘संथाल विद्रोह’ का नेतृत्व किसने किया था ?",
    option: ["जतरा भगत", "बिरसा मुंडा", "सिद्धो – कान्हो", "करिया मुंडा"],
    answer: "सिद्धो – कान्हो"
},
{
    question: "मेघा पाटेकर किस आन्दोलन से जुड़ी है ?",
    option: ["पर्यावरण आन्दोलन", "दलित आन्दोलन", "किसान आन्दोलन", "छात्र आन्दोलन"],
    answer: "पर्यावरण आन्दोलन"
},
{
    question: "बिहार में ग्राम पंचायतों में महिलाओं के लिए कितने प्रतिशत स्थान आरक्षित किये गये हैं ?",
    option: ["25 %", "33 %", "67 %", "50 %"],
    answer: "50 %"
},
{
    question: "चिपको आन्दोलन का संबंध किस राज्य से है ?",
    option: ["उत्तर प्रदेश", "उत्तराखण्ड", "मध्य प्रदेश", "आंध्र प्रदेश"],
    answer: "उत्तराखण्ड"
},
{
    question: "वर्ग संघर्ष का सिद्धान्त किसने दिया ?",
    option: ["कार्ल मार्क्स", "मैकाइवर", "रिजले", "फ्रेजर"],
    answer: "कार्ल मार्क्स"
},
{
    question: "भारतीय किसान यूनियन का गठन किस वर्ष किया गया ?",
    option: ["सन् 1979", "सन् 1980", "सन् 1982", "सन् 1984"],
    answer: "सन् 1979"
},
{
    question: "“जीवन की एक नई व्यवस्था को स्थापित करने के उद्देश्य से किए गए सामूहिक प्रयास ही सामाजिक आन्दोलन है।” यह कथन किसका है ?",
    option: ["एम.एस.ए. राव", "हरबर्ट ब्लूमर", "केमरान", "इनमें से कोई नहीं"],
    answer: "हरबर्ट ब्लूमर"
},
{
    question: "सूचना का अधिकार के लिए आन्दोलन, पर्यावरण बचाओ, कृषक आन्दोलन आदि किस प्रकार के आन्दोलन हैं ?",
    option: ["सुधारवादी", "क्रान्तिकारी", "विरोधवादी", "इनमें से कोई नहीं"],
    answer: "सुधारवादी"
},
{
    question: "“श्रमिक आन्दोलन से आशय श्रमिकों की उन समस्त संगठित क्रियाओं से है जो तत्काल या निकट भविष्य में उनकी दशाओं को श्रेष्ठ बनाने के लिए की जाती है।” यह परिभाषा किसने दी है ?",
    option: ["जी.डी.एच. कोल", "डेल योडर", "हेनिमन", "जे.आर. कामन्स"],
    answer: "जे.आर. कामन्स"
},
{
    question: "भारत में श्रमिक आन्दोलन का विकास किसके फलस्वरूप हुआ ?",
    option: ["नगरीकरण", "औद्योगीकरण", "निजीकरण", "उदारीकरण"],
    answer: "औद्योगीकरण"
},
{
    question: "भारत में सर्वप्रथम किस वर्ष सोरानजी शाहपुर ने श्रमिकों की दुर्दशा की ओर सरकार का ध्यान आकर्षित किया ?",
    option: ["सन् 1875", "सन् 1880", "सन् 1895", "सन् 1905"],
    answer: "सन् 1875"
},
{
    question: "भारत में श्रम संघ का इतिहास किस वर्ष से शुरू होता है ?",
    option: ["सन् 1880", "सन् 1890", "सन् 1900", "सन् 1910"],
    answer: "सन् 1890"
},
{
    question: "श्रमिकों की समस्याओं पर नियंत्रण पाने के वाद – विवाद अधिनियम कब पारित किया गया ?",
    option: ["सन् 1950", "सन् 1949", "सन् 1948", "सन् 1947"],
    answer: "सन् 1947"
},
{
    question: "सभी श्रमिक संघों को एक मंच पर लाने के लिए कम्युनिस्ट पार्टी (मार्क्सवादी) ने किस संगठन की स्थापना की ?",
    option: ["यूनाइटेड ट्रेड यूनियन काँग्रेस", "हिन्दू मजदूर सभा", "भारतीय श्रमिक संघ केन्द्र", "इण्डियन नेशनल ट्रेड यूनियन काँग्रेस"],
    answer: "भारतीय श्रमिक संघ केन्द्र"
},
{
    question: "भारत की किस आर्थिक नीति को भूमण्डलीकरण के साथ अपनाया गया ?",
    option: ["आर्थिक नीति, 1972", "आर्थिक नीति, 1991", "आर्थिक नीति, 2001", "आर्थिक नीति, 2011"],
    answer: "आर्थिक नीति, 1991"
},
{
    question: "“कोई भी आन्दोलन कृषक आन्दोलन हो सकता है बशर्ते उसका मूल उद्देश्य कृषकों के अधिकार की लड़ाई हो, चाहे वह कृषकों द्वारा गठित हो या अन्य समूहों द्वारा।” यह कथन किसका है ?",
    option: ["प्रो. आर. सिंह", "आर.बी. पाण्डेय", "घुरिये", "सी.आर. पाण्डेय"],
    answer: "आर.बी. पाण्डेय"
},
{
    question: "वर्ष 1928-29 में बारदोली (गुजरात) के किसान आन्दोलन (बारदोली सत्याग्रह) का नेतृत्व किसने किया ?",
    option: ["जयप्रकाश नारायण", "बल्लभ भाई पटेल", "महात्मा गाँधी", "इनमें से कोई नहीं"],
    answer: "बल्लभ भाई पटेल"
},
{
    question: "बिहार किसान सभा की स्थापना किस वर्ष हुई ?",
    option: ["सन् 1927", "सन् 1929", "सन् 1931", "सन् 1933"],
    answer: "सन् 1929"
},
{
    question: "बिहार किसान सभा किस वर्ष अखिल भारतीय किसान सभा में परिवर्तित हो गई ?",
    option: ["सन् 1938", "सन् 1937", "सन् 1936", "सन् 1934"],
    answer: "सन् 1936"
},
{
    question: "तिभागा आन्दोलन के प्रमुख नेता कौन थे ?",
    option: ["भोवानी सेन", "रत्नसेन", "योगेश चन्द्र चटर्जी", "इनमें से कोई नहीं"],
    answer: "भोवानी सेन"
},
{
    question: "तिभागा आन्दोलन किस वर्ष समाप्त हो गया ?",
    option: ["सन् 1945", "सन् 1947", "सन् 1949", "सन् 1953"],
    answer: "सन् 1947"
},
{
    question: "तेलांगाना आन्दोलन हैदराबाद के नोलगोण्डा जिले में कब शुरू हुआ ?",
    option: ["सन् 1992", "सन् 1932", "सन् 1944", "सन् 1946"],
    answer: "सन् 1946"
},
{
    question: "पंजाब में उन्नीसवीं शताब्दी के अन्त में प्रारम्भ हुए किसान आन्दोलन का नेतृत्व किसने किया ?",
    option: ["लाला लाजपत राय", "सरदार अजीत सिंह", "उपर्युक्त दोनों", "इनमें से कोई नहीं"],
    answer: "उपर्युक्त दोनों"
},
{
    question: "भारत में निम्न में से कौन – सा कारक राष्ट्रीय एकता में बाधक है ?",
    option: ["जातिवाद", "क्षेत्रवाद", "धर्मान्धता", "इनमें से सभी"],
    answer: "इनमें से सभी"
}
];

// English Questions
const sociologyEnglish = [
  // Introducing Indian Society
  { question: "What is sociology?", option: ["Study of society", "Study of individual", "Study of politics", "Study of economy"], answer: "Study of society" },
  { question: "What is characteristic of Indian society?", option: ["Diversity", "Uniformity", "Equality", "None"], answer: "Diversity" },
  
];

// --- Helper: Shuffle questions ---
const shuffleQuestions = (questions) => {
  const shuffled = [...questions];
  for (let i = shuffled.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
  }
  return shuffled;
};

// --- Component ---
export default function Sociology12thQuiz() {
  const [started, setStarted] = useState(false);
  const [submitted, setSubmitted] = useState(false);
  const [timer, setTimer] = useState(3600); // 60 minutes = 3600 seconds
  const [language, setLanguage] = useState('hi');
  const [questions, setQuestions] = useState([]);
  const [current, setCurrent] = useState(0);
  const [answers, setAnswers] = useState({});
  const [score, setScore] = useState(0);
  const [resultDetails, setResultDetails] = useState([]);
  const [showTimerWarning, setShowTimerWarning] = useState(false);
  const resultRef = useRef(null);

  useEffect(() => {
    if (started && !submitted && timer > 0) {
      const t = setInterval(() => {
        setTimer((p) => {
          if (p <= 60) setShowTimerWarning(true);
          return p - 1;
        });
      }, 1000);
      return () => clearInterval(t);
    }
    if (timer === 0 && started && !submitted) {
      submitExam();
    }
  }, [started, submitted, timer]);

  const startExam = () => {
    const questionBank = language === 'hi' ? sociologyHindi : sociologyEnglish;
    // Select only 100 questions (all of them)
    const selectedQuestions = shuffleQuestions(questionBank).slice(0, 100);
    setQuestions(selectedQuestions);
    setStarted(true);
    setTimer(3600);
    setAnswers({});
    setCurrent(0);
    setShowTimerWarning(false);
  };

  const submitExam = () => {
    let s = 0;
    const details = questions.map((q, i) => {
      const isCorrect = answers[i] === q.answer;
      if (isCorrect) s++;
      return {
        question: q.question,
        option: q.option,
        correctAnswer: q.answer,
        userAnswer: answers[i] || (language === 'hi' ? "प्रयास नहीं किया" : "Not Attempted"),
        isCorrect: isCorrect,
        isAttempted: answers[i] !== undefined,
      };
    });
    setScore(s);
    setResultDetails(details);
    setSubmitted(true);
  };

  const toggleLanguage = () => {
    if (!started) {
      setLanguage(language === 'hi' ? 'en' : 'hi');
    }
  };

  const downloadResult = () => {
    if (resultRef.current) {
      const printWindow = window.open('', '_blank');
      if (printWindow) {
        const content = resultRef.current.innerHTML;
        printWindow.document.write(`
          <html>
            <head>
              <title>${language === 'hi' ? 'समाजशास्त्र 12वीं परिणाम' : 'Sociology 12th Result'}</title>
              <style>
                body { font-family: Arial, sans-serif; padding: 20px; }
                .result-container { max-width: 800px; margin: 0 auto; }
                .header { text-align: center; padding: 20px; background: linear-gradient(135deg, #1a237e, #3f51b5); color: white; border-radius: 10px; margin-bottom: 20px; }
                .score-card { text-align: center; padding: 20px; border: 2px solid #1a237e; border-radius: 10px; margin-bottom: 20px; }
                .score { font-size: 40px; font-weight: bold; color: #1a237e; }
                .status { font-size: 20px; margin: 10px 0; }
                .pass { color: #28a745; }
                .fail { color: #dc3545; }
                .question-item { padding: 15px; margin: 10px 0; border-radius: 8px; border-left: 4px solid #48bb78; background: #f8f9fa; }
                .question-item.wrong { border-left-color: #dc3545; background: #fff5f5; }
                .question-item .q { font-weight: bold; font-size: 14px; }
                .question-item .your-answer { margin-top: 5px; font-size: 13px; }
                .question-item .correct-answer { margin-top: 3px; font-size: 13px; color: #28a745; font-weight: bold; }
                .wrong-answer { color: #dc3545; }
                .correct-answer-text { color: #28a745; }
                .not-attempted { color: #ffc107; }
                .footer { text-align: center; margin-top: 20px; padding: 10px; color: #666; font-size: 12px; border-top: 1px solid #ddd; }
              </style>
            </head>
            <body>
              <div class="result-container">
                ${content}
              </div>
            </body>
          </html>
        `);
        printWindow.document.close();
        printWindow.print();
      }
    }
  };

  const getText = (key) => {
    const texts = {
      'title': { hi: '👥 समाजशास्त्र 12वीं', en: '👥 Sociology 12th' },
      'subtitle': { hi: 'कक्षा 12 समाजशास्त्र प्रश्नोत्तरी', en: 'Class 12 Sociology Quiz' },
      'questions': { hi: '📝 प्रश्न', en: '📝 Questions' },
      'time': { hi: '⏱️ समय', en: '⏱️ Time' },
      'instructions': { hi: '📋 निर्देश:', en: '📋 Instructions:' },
      'compulsory': { hi: 'सभी प्रश्न अनिवार्य हैं', en: 'All questions are compulsory' },
      'marks': { hi: 'प्रत्येक प्रश्न 1 अंक का है', en: 'Each question carries 1 mark' },
      'negative': { hi: 'कोई नकारात्मक अंकन नहीं', en: 'No negative marking' },
      'start': { hi: '🚀 क्विज़ शुरू करें', en: '🚀 Start Quiz' },
      'answered': { hi: 'उत्तर दिए:', en: 'Answered:' },
      'prev': { hi: '⬅ पिछला', en: '⬅ Prev' },
      'next': { hi: 'अगला ➡', en: 'Next ➡' },
      'submit': { hi: '📤 जमा करें', en: '📤 Submit' },
      'navigator': { hi: 'प्रश्न नेविगेटर', en: 'Question Navigator' },
      'answered_status': { hi: '🟢 उत्तर दिया', en: '🟢 Answered' },
      'current_status': { hi: '🔵 वर्तमान', en: '🔵 Current' },
      'unanswered_status': { hi: '⚪ अनुत्तरित', en: '⚪ Unanswered' },
      'congrats': { hi: '🎉 शानदार प्रदर्शन!', en: '🎉 Excellent Performance!' },
      'practice': { hi: '📖 सीखते रहें!', en: '📖 Keep Learning!' },
      'passed': { hi: '✔️ उत्तीर्ण', en: '✔️ Passed' },
      'failed': { hi: '❌ सुधार की आवश्यकता', en: '❌ Needs Improvement' },
      'review': { hi: '📋 उत्तर समीक्षा', en: '📋 Answer Review' },
      'your_answer': { hi: 'आपका उत्तर:', en: 'Your Answer:' },
      'correct_answer': { hi: 'सही उत्तर:', en: 'Correct Answer:' },
      'new_quiz': { hi: '🔄 नई क्विज़ लें', en: '🔄 Take New Quiz' },
      'warning': { hi: '⚠️ 1 मिनट से कम समय शेष!', en: '⚠️ Less than 1 minute remaining!' },
      'download': { hi: '📥 परिणाम डाउनलोड करें', en: '📥 Download Result' },
      'status': { hi: 'स्थिति', en: 'Status' },
      'correct': { hi: 'सही', en: 'Correct' },
      'wrong': { hi: 'गलत', en: 'Wrong' },
      'not_attempted': { hi: 'प्रयास नहीं किया', en: 'Not Attempted' },
    };
    return texts[key]?.[language] || texts[key]?.['en'] || key;
  };

  // Home Page
  if (!started) {
    return (
      <div style={{
        minHeight: "100vh",
        display: "flex",
        justifyContent: "center",
        alignItems: "center",
        background: "linear-gradient(135deg, #1a237e 0%, #283593 50%, #3f51b5 100%)",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif",
        padding: "20px"
      }}>
        <div style={{
          backgroundColor: "white",
          padding: "25px 20px",
          borderRadius: "16px",
          boxShadow: "0 20px 60px rgba(0,0,0,0.6)",
          textAlign: "center",
          maxWidth: "500px",
          width: "100%",
          animation: "fadeInUp 0.6s ease"
        }}>
          <div style={{ fontSize: "48px", marginBottom: "5px" }}>👥</div>
          <h1 style={{ 
            color: "#1a237e", 
            marginBottom: "3px", 
            fontSize: "22px",
            fontWeight: "700"
          }}>
            {getText('title')}
          </h1>
          <p style={{ color: "#666", fontSize: "12px", marginBottom: "15px" }}>
            {getText('subtitle')}
          </p>
          <div style={{
            height: "3px",
            background: "linear-gradient(90deg, #1a237e, #3f51b5)",
            margin: "10px auto",
            width: "60px"
          }}></div>

          {/* Language Toggle */}
          <div style={{
            display: "flex",
            justifyContent: "center",
            alignItems: "center",
            gap: "12px",
            marginTop: "15px",
            marginBottom: "15px"
          }}>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'hi' ? "700" : "400",
              color: language === 'hi' ? "#1a237e" : "#999"
            }}>हिन्दी</span>
            <button
              onClick={toggleLanguage}
              style={{
                width: "50px",
                height: "26px",
                borderRadius: "13px",
                background: language === 'hi' ? "#3f51b5" : "#4a90d9",
                border: "none",
                cursor: "pointer",
                position: "relative",
                transition: "all 0.3s ease"
              }}
            >
              <div style={{
                width: "20px",
                height: "20px",
                borderRadius: "50%",
                background: "white",
                position: "absolute",
                top: "3px",
                left: language === 'hi' ? "3px" : "27px",
                transition: "all 0.3s ease",
                boxShadow: "0 2px 4px rgba(0,0,0,0.2)"
              }}></div>
            </button>
            <span style={{ 
              fontSize: "14px", 
              fontWeight: language === 'en' ? "700" : "400",
              color: language === 'en' ? "#1a237e" : "#999"
            }}>English</span>
          </div>

          <div style={{
            display: "grid",
            gridTemplateColumns: "1fr 1fr",
            gap: "10px",
            marginTop: "10px"
          }}>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('questions')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>100</div>
            </div>
            <div style={{ 
              backgroundColor: "#e8f0fe", 
              padding: "12px", 
              borderRadius: "10px"
            }}>
              <div style={{ fontSize: "11px", color: "#666" }}>{getText('time')}</div>
              <div style={{ fontSize: "22px", fontWeight: "bold", color: "#1a237e" }}>60 Mins</div>
            </div>
          </div>

          <div style={{
            backgroundColor: "#e8f0fe",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#1a237e"
          }}>
            💡 {language === 'hi' ? 'कक्षा 12 समाजशास्त्र के सभी अध्यायों की व्यापक कवरेज' : 'Comprehensive coverage of all Class 12 Sociology chapters'}
          </div>

          <div style={{
            backgroundColor: "#f8f9fa",
            padding: "10px",
            borderRadius: "10px",
            marginTop: "10px",
            fontSize: "12px",
            color: "#555",
            textAlign: "left"
          }}>
            <strong>{getText('instructions')}</strong>
            <ul style={{ margin: "5px 0 0 0", paddingLeft: "18px" }}>
              <li>{getText('compulsory')}</li>
              <li>{getText('marks')}</li>
              <li>{getText('negative')}</li>
            </ul>
          </div>

          <button
            onClick={startExam}
            style={{
              padding: "14px 40px",
              fontSize: "18px",
              fontWeight: "bold",
              background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
              color: "white",
              border: "none",
              borderRadius: "50px",
              cursor: "pointer",
              marginTop: "20px",
              width: "100%",
              transition: "transform 0.3s, box-shadow 0.3s",
              boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)"
            }}
            onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
            onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
          >
            {getText('start')}
          </button>
        </div>
      </div>
    );
  }

  // Result Page
  if (submitted) {
    const percentage = ((score / questions.length) * 100).toFixed(2);
    const isPassed = percentage >= 60;
    return (
      <div style={{
        minHeight: "100vh",
        background: "#f5f7fa",
        padding: "15px",
        fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
      }}>
        <div style={{
          maxWidth: "800px",
          margin: "0 auto"
        }}>
          {/* Result Card - For Download */}
          <div ref={resultRef} style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "25px 20px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)",
            textAlign: "center",
            marginBottom: "20px",
            animation: "slideIn 0.5s ease"
          }}>
            <div className="header" style={{
              background: "linear-gradient(135deg, #1a237e, #3f51b5)",
              color: "white",
              padding: "15px",
              borderRadius: "10px",
              marginBottom: "15px"
            }}>
              <h1 style={{ margin: "0", fontSize: "22px" }}>{getText('title')}</h1>
              <p style={{ margin: "5px 0 0", fontSize: "12px", opacity: 0.9 }}>
                {language === 'hi' ? 'कक्षा 12 समाजशास्त्र क्विज़' : 'Class 12 Sociology Quiz'}
              </p>
            </div>
            
            <h2 style={{ 
              fontSize: "20px", 
              marginBottom: "5px",
              color: "#2d3748"
            }}>
              {isPassed ? getText('congrats') : getText('practice')}
            </h2>
            <div style={{
              width: "80px",
              height: "80px",
              borderRadius: "50%",
              background: isPassed ? "#d4edda" : "#f8d7da",
              display: "flex",
              alignItems: "center",
              justifyContent: "center",
              margin: "15px auto",
              fontSize: "32px"
            }}>
              {isPassed ? "✅" : "📝"}
            </div>
            <div style={{ fontSize: "40px", fontWeight: "bold", color: "#1a237e" }}>
              {score} <span style={{ fontSize: "20px", color: "#888" }}>/ {questions.length}</span>
            </div>
            <div style={{ 
              fontSize: "18px", 
              color: isPassed ? "#28a745" : "#dc3545", 
              marginTop: "5px",
              fontWeight: "600"
            }}>
              {percentage}% {isPassed ? getText('passed') : getText('failed')}
            </div>
            <div style={{
              marginTop: "10px",
              fontSize: "13px",
              color: "#718096"
            }}>
              {language === 'hi' ? "भाषा: हिन्दी" : "Language: English"} • {getText('negative')}
            </div>

            <div style={{
              marginTop: "15px",
              display: "grid",
              gridTemplateColumns: "1fr 1fr 1fr",
              gap: "10px",
              fontSize: "13px"
            }}>
              <div style={{ backgroundColor: "#d4edda", padding: "8px", borderRadius: "8px", color: "#155724" }}>
                ✅ {getText('correct')}: {resultDetails.filter(r => r.isCorrect).length}
              </div>
              <div style={{ backgroundColor: "#f8d7da", padding: "8px", borderRadius: "8px", color: "#721c24" }}>
                ❌ {getText('wrong')}: {resultDetails.filter(r => !r.isCorrect && r.isAttempted).length}
              </div>
              <div style={{ backgroundColor: "#fff3cd", padding: "8px", borderRadius: "8px", color: "#856404" }}>
                ⚪ {getText('not_attempted')}: {resultDetails.filter(r => !r.isAttempted).length}
              </div>
            </div>
          </div>

          {/* Download Button */}
          <div style={{ textAlign: "center", marginBottom: "20px" }}>
            <button
              onClick={downloadResult}
              style={{
                padding: "12px 30px",
                fontSize: "15px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #48bb78 0%, #38a169 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                boxShadow: "0 4px 15px rgba(72, 187, 120, 0.4)",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('download')}
            </button>
          </div>

          {/* Answer Review */}
          <div style={{
            backgroundColor: "white",
            borderRadius: "16px",
            padding: "20px 15px",
            boxShadow: "0 10px 40px rgba(0,0,0,0.1)"
          }}>
            <h2 style={{ 
              borderBottom: "2px solid #eee", 
              paddingBottom: "12px", 
              marginBottom: "15px",
              fontSize: "18px",
              color: "#2d3748"
            }}>
              {getText('review')}
            </h2>
            {resultDetails.map((item, index) => (
              <div
                key={index}
                className={item.isCorrect ? '' : 'wrong'}
                style={{
                  backgroundColor: item.isCorrect ? "#f0fff4" : 
                                   item.isAttempted ? "#fff5f5" : "#fff3cd",
                  borderLeft: `4px solid ${item.isCorrect ? "#48bb78" : 
                              item.isAttempted ? "#fc8181" : "#ffc107"}`,
                  padding: "12px 15px",
                  marginBottom: "12px",
                  borderRadius: "8px",
                  animation: `fadeIn 0.3s ease ${index * 0.05}s`
                }}
              >
                <div style={{ display: "flex", justifyContent: "space-between", alignItems: "flex-start" }}>
                  <h4 style={{ 
                    margin: "0", 
                    fontSize: "14px", 
                    color: "#2d3748",
                    flex: 1,
                    marginRight: "10px"
                  }}>
                    Q{index + 1}. {item.question}
                  </h4>
                  <span style={{ fontSize: "18px", flexShrink: 0 }}>
                    {item.isCorrect ? "✅" : item.isAttempted ? "❌" : "⚪"}
                  </span>
                </div>
                <div style={{ marginTop: "8px", marginLeft: "5px", fontSize: "13px" }}>
                  <p style={{ margin: "3px 0" }}>
                    <strong>{getText('your_answer')}</strong>{" "}
                    <span style={{ 
                      color: item.isCorrect ? "#48bb78" : 
                             item.isAttempted ? "#dc3545" : "#ffc107",
                      fontWeight: item.isAttempted ? "bold" : "normal"
                    }}>
                      {item.userAnswer}
                    </span>
                    {!item.isAttempted && (
                      <span style={{ color: "#ffc107", marginLeft: "5px" }}>
                        ({getText('not_attempted')})
                      </span>
                    )}
                  </p>
                  {!item.isCorrect && (
                    <p style={{ margin: "3px 0" }}>
                      <strong>{getText('correct_answer')}</strong>{" "}
                      <span style={{ color: "#48bb78", fontWeight: "bold" }}>{item.correctAnswer}</span>
                    </p>
                  )}
                </div>
              </div>
            ))}
          </div>

          <div style={{ textAlign: "center", marginTop: "20px" }}>
            <button
              onClick={() => {
                setStarted(false);
                setSubmitted(false);
                setAnswers({});
                setResultDetails([]);
                setTimer(3600);
                setShowTimerWarning(false);
                setQuestions([]);
              }}
              style={{
                padding: "14px 35px",
                fontSize: "16px",
                fontWeight: "bold",
                background: "linear-gradient(135deg, #1a237e 0%, #3f51b5 100%)",
                color: "white",
                border: "none",
                borderRadius: "50px",
                cursor: "pointer",
                width: "100%",
                maxWidth: "300px",
                boxShadow: "0 4px 15px rgba(63, 81, 181, 0.4)",
                transition: "transform 0.3s ease"
              }}
              onMouseEnter={(e) => e.target.style.transform = "scale(1.02)"}
              onMouseLeave={(e) => e.target.style.transform = "scale(1)"}
            >
              {getText('new_quiz')}
            </button>
          </div>
        </div>
      </div>
    );
  }

  // Exam Page
  const q = questions[current] || { question: "", option: [], answer: "" };
  const answeredCount = Object.keys(answers).length;

  return (
    <div style={{
      minHeight: "100vh",
      background: "#f5f7fa",
      padding: "10px",
      fontFamily: "'Segoe UI', Tahoma, Geneva, Verdana, sans-serif"
    }}>
      <div style={{
        maxWidth: "800px",
        margin: "0 auto"
      }}>
        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "10px 14px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          display: "flex",
          justifyContent: "space-between",
          alignItems: "center"
        }}>
          <div style={{ flex: 1 }}>
            <p style={{ 
              margin: "0", 
              fontSize: "11px", 
              color: "#718096"
            }}>
              Q{current + 1}/{questions.length}
            </p>
            <p style={{ 
              margin: "2px 0 0", 
              fontSize: "10px", 
              color: "#a0aec0"
            }}>
              {getText('answered')} {answeredCount}/{questions.length}
            </p>
          </div>
          <div style={{
            fontSize: "20px",
            fontWeight: "bold",
            color: timer < 60 ? "#fc8181" : "#1a237e",
            display: "flex",
            alignItems: "center",
            gap: "6px"
          }}>
            <span style={{ fontSize: "16px" }}>⏱️</span>
            <span>{Math.floor(timer / 60)}:{String(timer % 60).padStart(2, "0")}</span>
          </div>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "16px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginBottom: "10px",
          animation: "fadeIn 0.3s ease"
        }}>
          <div style={{
            display: "inline-block",
            backgroundColor: "#e8f0fe",
            padding: "2px 10px",
            borderRadius: "12px",
            fontSize: "11px",
            color: "#1a237e",
            marginBottom: "12px"
          }}>
            📌 {language === 'hi' ? 'समाजशास्त्र 12वीं' : 'Sociology 12th'}
          </div>
          <h3 style={{
            fontSize: "16px",
            color: "#1a237e",
            marginBottom: "16px",
            fontWeight: "600",
            lineHeight: "1.5"
          }}>
            {q.question}
          </h3>

          <div style={{ marginTop: "5px" }}>
            {q.option && q.option.map((op, idx) => (
              <div
                key={idx}
                style={{
                  padding: "10px 12px",
                  margin: "5px 0",
                  backgroundColor: answers[current] === op ? "#ebf8ff" : "#f7fafc",
                  border: answers[current] === op ? "2px solid #3f51b5" : "2px solid transparent",
                  borderRadius: "8px",
                  cursor: "pointer",
                  transition: "all 0.3s ease",
                  display: "flex",
                  alignItems: "center",
                  transform: answers[current] === op ? "scale(1.01)" : "scale(1)"
                }}
                onClick={() => setAnswers({ ...answers, [current]: op })}
                onMouseEnter={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f0f0f0";
                    e.currentTarget.style.transform = "scale(1.005)";
                  }
                }}
                onMouseLeave={(e) => {
                  if (answers[current] !== op) {
                    e.currentTarget.style.backgroundColor = "#f7fafc";
                    e.currentTarget.style.transform = "scale(1)";
                  }
                }}
              >
                <input
                  type="radio"
                  id={`q${current}-opt${idx}`}
                  name={`question-${current}`}
                  checked={answers[current] === op}
                  onChange={() => {}}
                  style={{ marginRight: "10px", width: "16px", height: "16px", flexShrink: 0 }}
                />
                <label
                  htmlFor={`q${current}-opt${idx}`}
                  style={{
                    fontSize: "14px",
                    cursor: "pointer",
                    flex: 1,
                    margin: "0",
                    color: "#2d3748"
                  }}
                >
                  {op}
                </label>
              </div>
            ))}
          </div>
        </div>

        <div style={{
          display: "flex",
          gap: "8px",
          flexWrap: "wrap",
          justifyContent: "space-between"
        }}>
          <div style={{ display: "flex", gap: "8px" }}>
            <button
              onClick={() => setCurrent(Math.max(0, current - 1))}
              disabled={current === 0}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === 0 ? "#e2e8f0" : "#3f51b5",
                color: current === 0 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === 0 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== 0) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('prev')}
            </button>
            <button
              onClick={() => setCurrent(Math.min(questions.length - 1, current + 1))}
              disabled={current === questions.length - 1}
              style={{
                padding: "8px 14px",
                fontSize: "13px",
                backgroundColor: current === questions.length - 1 ? "#e2e8f0" : "#3f51b5",
                color: current === questions.length - 1 ? "#a0aec0" : "white",
                border: "none",
                borderRadius: "8px",
                cursor: current === questions.length - 1 ? "not-allowed" : "pointer",
                fontWeight: "600",
                transition: "all 0.3s ease"
              }}
              onMouseEnter={(e) => {
                if (current !== questions.length - 1) {
                  e.target.style.transform = "scale(1.05)";
                  e.target.style.boxShadow = "0 4px 12px rgba(63, 81, 181, 0.3)";
                }
              }}
              onMouseLeave={(e) => {
                e.target.style.transform = "scale(1)";
                e.target.style.boxShadow = "none";
              }}
            >
              {getText('next')}
            </button>
          </div>

          <button
            onClick={submitExam}
            style={{
              padding: "8px 18px",
              fontSize: "13px",
              backgroundColor: "#48bb78",
              color: "white",
              border: "none",
              borderRadius: "8px",
              cursor: "pointer",
              fontWeight: "600",
              transition: "all 0.3s ease",
              boxShadow: "0 2px 8px rgba(72, 187, 120, 0.3)"
            }}
            onMouseEnter={(e) => {
              e.target.style.transform = "scale(1.05)";
              e.target.style.boxShadow = "0 4px 15px rgba(72, 187, 120, 0.5)";
            }}
            onMouseLeave={(e) => {
              e.target.style.transform = "scale(1)";
              e.target.style.boxShadow = "0 2px 8px rgba(72, 187, 120, 0.3)";
            }}
          >
            {getText('submit')}
          </button>
        </div>

        <div style={{
          backgroundColor: "white",
          borderRadius: "12px",
          padding: "12px",
          boxShadow: "0 2px 8px rgba(0,0,0,0.08)",
          marginTop: "10px"
        }}>
          <p style={{ 
            margin: "0 0 8px 0", 
            color: "#718096", 
            fontSize: "11px", 
            fontWeight: "600" 
          }}>
            {getText('navigator')}
          </p>
          <div style={{
            display: "flex",
            flexWrap: "wrap",
            gap: "5px"
          }}>
            {questions.map((_, idx) => (
              <button
                key={idx}
                onClick={() => setCurrent(idx)}
                style={{
                  width: "32px",
                  height: "32px",
                  fontSize: "11px",
                  backgroundColor: answers[idx] ? "#48bb78" : 
                                   current === idx ? "#3f51b5" : "#e2e8f0",
                  color: answers[idx] ? "white" :
                         current === idx ? "white" : "#4a5568",
                  border: current === idx ? "2px solid #3f51b5" : "none",
                  borderRadius: "6px",
                  cursor: "pointer",
                  fontWeight: "bold",
                  transition: "all 0.3s ease",
                  transform: answers[idx] ? "scale(1.05)" : "scale(1)"
                }}
                onMouseEnter={(e) => {
                  e.target.style.transform = "scale(1.1)";
                }}
                onMouseLeave={(e) => {
                  e.target.style.transform = answers[idx] ? "scale(1.05)" : "scale(1)";
                }}
              >
                {idx + 1}
              </button>
            ))}
          </div>
          <div style={{
            display: "flex",
            gap: "12px",
            marginTop: "8px",
            fontSize: "10px",
            color: "#4a5568",
            flexWrap: "wrap"
          }}>
            <span>{getText('answered_status')}</span>
            <span>{getText('current_status')}</span>
            <span>{getText('unanswered_status')}</span>
          </div>
        </div>

        {showTimerWarning && (
          <div style={{
            position: "fixed",
            bottom: "15px",
            right: "15px",
            left: "15px",
            backgroundColor: "#fc8181",
            color: "white",
            padding: "12px 18px",
            borderRadius: "10px",
            boxShadow: "0 4px 15px rgba(252, 129, 129, 0.4)",
            textAlign: "center",
            fontSize: "14px",
            fontWeight: "600",
            animation: "pulse 1.5s ease-in-out infinite",
            maxWidth: "400px",
            margin: "0 auto"
          }}>
            {getText('warning')}
          </div>
        )}
      </div>
      <style>
        {`
          @keyframes pulse {
            0% { opacity: 1; transform: scale(1); }
            50% { opacity: 0.6; transform: scale(0.98); }
            100% { opacity: 1; transform: scale(1); }
          }
          @keyframes fadeInUp {
            from { opacity: 0; transform: translateY(20px); }
            to { opacity: 1; transform: translateY(0); }
          }
          @keyframes fadeIn {
            from { opacity: 0; transform: translateX(-10px); }
            to { opacity: 1; transform: translateX(0); }
          }
          @keyframes slideIn {
            from { opacity: 0; transform: translateY(-30px); }
            to { opacity: 1; transform: translateY(0); }
          }
        `}
      </style>
    </div>
  );
}